[
  {
    "id": 1,
    "title": "China Unveils Web3 Strategy to Bolster NFT and Blockchain Innovation",
    "absoluteURL": "https://www.todaynftnews.com/china-unveils-web3-strategy-to-bolster-nft-and-blockchain-innovation/",
    "fullContent": "SNEAK PEEK China’s Ministry of Science and Technology, the Chinese Academy of Sciences and the China Association for Science and Technology. The strategy aims to provide direction and support for the Web3 industry, highlighting the importance of innovation, security, and the government’s role. The announcement indicates China’s commitment to exploring new business models like Non-Fungible Tokens and distributed applications. China’s Ministry of Science and Technology, in a collaborative initiative with the Chinese Academy of Sciences and the China Association for Science and Technology, announced the release of a comprehensive Web3 strategy. This strategic document aims to provide clear direction and support for the burgeoning Web3 industry, underscoring the importance of innovation, security, and government roles in this sector. The ministry’s announcement, delivered on Tuesday, emphasizes a solid commitment to exploring new business models like Non-Fungible Tokens (NFTs) and distributed applications (dApps). This move is particularly noteworthy given China’s current stance on cryptocurrencies, demonstrating the country’s interest in the broader potential of blockchain technology beyond crypto. Moreover, the ministry highlighted the significance of reinforcing collaborations across various departments to foster Web3 innovation. This approach includes further research initiatives and a focus on cultivating industry talent, ensuring a robust infrastructure for the evolving digital ecosystem. In recent times, China has already witnessed several Web3-oriented initiatives. These include policy documents such as “Guiding Opinions on Accelerating the Application of Blockchain Technology and Industrial Development” and “Blockchain Information Service Management Regulations.” These policies, formulated by the Technology Ministry and the Cyberspace Administration of China, lay the groundwork for the planned Web3 advancements. Additionally, blockchain pilot projects have been conducted across various sectors, such as energy, legal, copyright, and trade finance. These initiatives, undertaken by the Cyberspace Administration of China and other departments, indicate a methodical approach to integrating blockchain technology into multiple facets of society. In the future, Web3 strategies will center on crucial areas like government affairs and industrial applications. The ministry aims to expedite the adoption of Web3 technologies and the establishment of a digital ecosystem, charting a path forward in a rapidly evolving digital landscape. This strategic document paves the way for innovative applications in Web3 and represents a significant step in China’s digital transformation journey. By embracing the potential of blockchain and related technologies, China positions itself at the forefront of the digital era.",
    "tags": [
      "#Blockchain",
      "#China",
      "#NFT market",
      "#Web3"
    ],
    "publishDate": "21/12/2023"
  },
  {
    "id": 2,
    "title": "Modex Announces New NFT Release in Collaboration with FIFA+ Collect",
    "absoluteURL": "https://www.todaynftnews.com/modex-announces-new-nft-release-in-collaboration-with-fifa-collect/",
    "fullContent": "SNEAK PEEK Modex, in partnership with FIFA+ Collect Club, recently achieved a sold-out debut NFT drop in just three hours. A new NFT collection, including 900 unique items, featuring exclusive experiences from the FIFA Club World Cup 2023, will be launched on OpenSea. The collection will be issued on the Polygon network, emphasizing the growing demand for sports-related digital collectables. Modex, in partnership with FIFA+ Collect Club, recently achieved a remarkable milestone with their debut NFT drop, which sold out in three hours. Building on this success, the company has announced a new NFT collection set to be launched on OpenSea, available from December 19 at 11 AM EST. This collection, issued on the Polygon network, will include 900 unique NFTs featuring exclusive VIP experiences and physical items from the FIFA Club World Cup 2023™. The initial success story began with FIFA+ Collect Club’s limited edition NFT Membership Cards, each priced at $999. These cards garnered an overwhelming response, selling out swiftly within three hours of their release. This rapid sellout underscores the growing enthusiasm and market demand for sports-related digital collectables. Adding to the excitement, Modex has revealed a special airdrop scheduled for December 26 for VIP Membership Card holders. This airdrop will feature key moments from the FIFA Club World Cup Saudi Arabia 2023™. Notably, selected moments in this airdrop will offer holders exclusive tickets to the FIFA World Cup 2026™ and FIFA Club World Cup 2025™ finals in the USA. Moreover, holders of these VIP cards will enjoy additional perks, such as the Adidas Level 4 membership. This status is usually reserved for customers who accumulate over 9,000 points from Adidas purchases. This move signifies Modex’s commitment to providing value-added experiences to its NFT collectors. The upcoming NFT Drop on OpenSea is poised to offer a range of unique items. These include tickets to “The Best FIFA Football Awards™”, VIP visits with a FIFA Legend to the FIFA Museum in Zurich, and memorabilia like signed Yellow/Red cards by referees and corner flags signed by team captains from the FIFA Club World Cup 2023™ Saudi Arabia. Additionally, the collection will feature 812 uniquely numbered posters representing each team from the tournament. This series of events illustrates the growing synergy between digital art, sports fandom, and blockchain technology. Modex’s strategic alliance with FIFA+ Collect Club has not only catered to the sports memorabilia market but also introduced a new way for fans to connect with their favourite sports events through innovative digital means. This collaboration is a testament to the evolving landscape of sports collectables and the potential of NFTs in enhancing fan experiences.",
    "tags": [
      "#Blockchain",
      "#FIFA",
      "#NFT market"
    ],
    "publishDate": "20/12/2023"
  },
  {
    "id": 3,
    "title": "OKX NFT Marketplace Sets New Standard in Daily Trading Volumes, Surpassing Blur and OpenSea",
    "absoluteURL": "https://www.todaynftnews.com/okx-nft-marketplace-sets-new-standard-in-daily-trading-volumes-surpassing-blur-and-opensea/",
    "fullContent": "SNEAK PEEK OKX NFT Marketplace, a subsidiary of the crypto exchange OKX, reached a monumental $50 million in trading volume within just 24 hours. This significant achievement eclipsed the combined trading volumes of competitors Blur, Magic Eden, and OpenSea, which totaled around $24 million. The surge in OKX NFT Marketplace’s trading activity follows its recent integration of Bitcoin Ordinals trading, marking a strategic and successful move. The digital trading realm witnessed a significant shift as OKX NFT Marketplace, a renowned crypto exchange OKX subsidiary, soared to new heights in daily trading volumes. On December 18, this bustling marketplace registered an impressive $50 million in trades within 24 hours. This feat notably eclipsed the combined efforts of its closest competitors, Blur, Magic Eden, and OpenSea, who collectively achieved around $24 million in the same timeframe. This remarkable surge in trading volume at OKX NFT Marketplace comes after its recent integration of Bitcoin Ordinals trading. This strategic move has catalyzed a spike in activity, aligning with broader market trends that saw a remarkable week for Bitcoin network sales. According to data from NFT tracker CryptoSlam, the Bitcoin network alone amassed a staggering $367 million in sales volume over the past week, outpacing the combined weekly books of Ethereum and Solana, which stood at $91 million. Guess which #Bitcoin NFT collections are in the gallery 🎨👇   ________________ ╱| ______________ ╱| | |🟧🟧🐸🟧🟧|  | | |🟧🐀🟧🗺️🟧|  | | |🦧🟧👨‍🦲🟧🪨|  | |╱ ￣ ￣￣💃￣ ￣ |╱ ￣￣🚶￣￣👫￣ — OKX (@okx) December 18, 2023 The dominance of OKX NFT Marketplace on December 18 is a testament to its growing influence in the NFT sector. While the trading volume slightly dipped to $35 million later today, the platform’s performance remains a clear indicator of its emerging leadership. Moreover, the broader NFT market is also witnessing a resurgence. November saw the collective volume of the NFT space approaching the $1 billion mark. Notably, the average value of NFT transactions in this period shot up by 114%, escalating from $126 to $270. This trend highlights growing confidence among traders, signalling a willingness to engage in higher-value exchanges compared to previous months. OKX NFT Marketplace’s achievement is more than a mere numerical triumph. It underscores a shift in trader preference and market dynamics within the NFT space. As the marketplace continues to innovate and adapt, its impact on the digital trading landscape is poised to expand, marking a new era of NFT trading that aligns with evolving consumer behaviours and market trends.",
    "tags": [
      "#NFT Marketplace",
      "#OKX Exchange",
      "#OpenSea"
    ],
    "publishDate": "19/12/2023"
  },
  {
    "id": 4,
    "title": "BetFury Launches Exclusive NFT Lootboxes",
    "absoluteURL": "https://www.todaynftnews.com/betfury-launches-exclusive-nft-lootboxes/",
    "fullContent": "SNEAK PEEK BetFury has introduced NFT Lootboxes, marking its entry into the NFT ecosystem. Players have a chance to win rare NFTs and other rewarding prizes. NFT Lootboxes on BetFury offer over a 90% chance of winning a profitable prize, distinguishing them in the crypto space. BetFury has rolled out its latest offering, NFT Lootboxes, marking the platform’s entry into the NFT ecosystem. These Lootboxes promise a chance to win rare NFTs and a slew of other lucrative rewards. For a mere few dollars, players have the opportunity to become the first fortunate winners of coveted art masterpieces. Lootboxes, a popular feature in the gaming world, have made their way into the crypto industry. BetFury has taken this concept and elevated it by incorporating high-quality NFTs as the main rewards. What sets these NFT Lootboxes apart is their impressive over 90% chance of winning a profitable prize, making them a simple yet rewarding addition to the platform. Rewards Inside the Lootboxes BetFury’s NFT Lootboxes offer a variety of rewards, each with a different probability of dropping NFTs. Besides the chance to win NFTs, players can also get rewards such as BTC, ETH, USDT, BNB, TRX, free spins for various games, free bets for sports betting, and the platform’s native token, BFG. While standard NFT Lootboxes guarantee prizes, the premium ones may have a sector without a reward, but even this occurs with only a 1% probability. The chances of leaving empty-handed are minimal, and users can explore the Lootboxes through a demo spin before diving into real-money gameplay. Epic Win: Realizing Profits A recent success story on BetFury involves a user winning Bored Ape Yacht Club #5663. Despite a slim 0.77% chance of success, the $1,657 spin resulted in an NFT worth an impressive $76,545. This triumph showcases that NFT Lootboxes can indeed deliver substantial profits, enabling users to achieve remarkable success. The allure of NFT Lootboxes lies in the opportunity to obtain some of the rarest NFTs on the market, presenting an exclusive chance to acquire valuable items for just a few dollars. BetFury’s Lootboxes feature blue-chip collections, including Wrapped Cryptopunks, Bored Ape Yacht Club, Azuki Originals, Mutant Ape Yacht Club, Pudgy Penguins, DeGods, and many more. BetFury offers a range of NFT Loot Boxes catering to different budgets and preferences, allowing users interested in rare NFTs and other luxury rewards to choose options that suit their preferences. BetFury stands as an ecosystem of crypto products designed for entertainment and additional income. With its native BFG token, listed on major crypto exchanges, BetFury offers over 8,000 slots and original games, 80+ sports options, and lucrative bonuses, making it a comprehensive platform for crypto enthusiasts seeking both entertainment and financial gains.",
    "tags": [
      "#Blockchain",
      "#NFT market"
    ],
    "publishDate": "19/12/2023"
  },
  {
    "id": 5,
    "title": "Blockchain Networks Face Unprecedented Surge in Transaction Fees Amidst EVM Inscription Boom",
    "absoluteURL": "https://www.todaynftnews.com/blockchain-networks-face-unprecedented-surge-in-transaction-fees-amidst-evm-inscription-boom/",
    "fullContent": "SNEAK PEEK The Ethereum Virtual Machine (EVM) ecosystem witnessed a significant rise in transaction fees, driven by growing interest in EVM inscriptions. Gas fees reached record highs, with Dune Analytics reporting costs of $8.3 million on December 16, predominantly in Avalanche and Arbitrum One networks. Arbitrum One faced a 78-minute outage, illustrating the strain of increased inscription activity on blockchain infrastructures. The digital landscape of blockchain technology recently experienced a seismic shift, particularly in the Ethereum Virtual Machine (EVM) ecosystem, where a significant uptick in transaction fees was observed. This phenomenon, largely driven by the rapidly growing interest in EVM inscriptions, marked a notable milestone in blockchain activity over the past weekend. The rise in EVM chain activities led to a record-breaking increase in gas fees, with figures reaching a new zenith. According to the latest insights from Dune Analytics, the cost of inscriptions escalated to a staggering $8.3 million on December 16. Among the networks, Avalanche witnessed the heftiest gas expenses, accounting for more than $5.6 million that day. Not far behind, Arbitrum One recorded around $2.1 million in gas fees due to inscription activities. This trend transcended the Ethereum ecosystem, impacting the Bitcoin network as well. The surge in Bitcoin inscriptions led to a significant demand for block space, resulting in an extensive queue of almost 280,000 unconfirmed transactions. The heightened activity pushed Bitcoin transaction fees to a peak of $37, presenting a challenge for smaller, peer-to-peer transactions on the network. Top 10 Ordinal PFP Collections Ranked by Market Cap: RANK COLLECTION MCAP 1 Bitcoin Frogs $182.2M 2 OMB $79.3M 3 OCM Genesis $38.1M 4 Bitcoin Punks $29.4M 5… — Leonidas (@LeonidasNFT) December 17, 2023 The heightened inscription activity has been challenging. For instance, the Arbitrum One network grappled with a 78-minute outage on December 15, highlighting the stress these activities can place on blockchain infrastructures. Amid these developments, EVM inscriptions are gaining traction, similar to the Ordinals on the Bitcoin network. These inscriptions involve embedding unique information within transaction call data to create distinct, on-chain, nonfungible tokens (NFTs). The interest in this area is palpable, evidenced by the Bitcoin Frogs Ordinals collection’s market capitalization soaring to $182 million. Industry veterans, including Bitcoin pioneer Adam Back, view these developments as a vital push towards innovation in blockchain technologies, especially in layer-2 solutions. This sentiment is mirrored within the blockchain community, with enthusiasts and developers exploring new applications and capabilities of these platforms. The recent events in the blockchain sector underscore a pivotal evolution, with EVM inscriptions at the forefront. This movement highlights the escalating fascination with NFTs and digital collectibles and emphasizes the necessity for scalable and robust network solutions to cater to the increasing demand. As blockchain technology evolves, it paves the way for the next chapter of digital innovation and exploration.",
    "tags": [
      "#Blockchain",
      "#NFT market"
    ],
    "publishDate": "18/12/2023"
  },
  {
    "id": 6,
    "title": "Millions of Dollars in NFTs Stolen from Trader, Stolen Apes Returned After Bounty Payment",
    "absoluteURL": "https://www.todaynftnews.com/millions-of-dollars-in-nfts-stolen-from-trader-stolen-apes-returned-after-bounty-payment/",
    "fullContent": "SNEAK PEEK Hackers who infiltrated NFT Trader and stole valuable digital assets, including Bored Ape and Mutant Ape Yacht Club NFTs, were swiftly countered The incident demonstrated the strong unity and proactive approach within the NFT community. The breach exposed weaknesses in NFT trading platforms, leading to calls for enhanced security Hackers proactive approach within the NFT community In a striking turn of events, the NFT community witnessed a remarkable recovery of stolen digital assets. Recently, hackers infiltrated NFT Trader, a prominent peer-to-peer trading platform, pilfering a significant collection of nonfungible tokens (NFTs). Among the spoils were 37 Bored Ape Yacht Club (BAYC), 13 Mutant Ape Yacht Club (MAYC) tokens, and other valuable NFTs like VeeFriends and World of Women. Nearly $3 million theft left the digital art world in shock. Congratulations to the @BoringSecDAO in getting back those Apes. 🦍 Well done. ✅🎉🙌🏻 @BoredApeYC pic.twitter.com/brVGQ58Sg2 — realniceguy.eth ❄️🍌 (@realniceguy_SRH) December 17, 2023 However, the story took an unexpected twist. Boring Security, a Web3 security project, orchestrated a swift and effective response. They collaborated with Greg Solano, co-founder of Yuga Labs – the creator of BAYC and MAYC. Together, they strategised a resolution that involved a bounty payment. Their efforts bore fruit, and within 24 hours, all stolen NFTs were recovered. In exchange for the digital assets, the hackers received a 120 Ether (ETH) bounty, valued at approximately $267,000. This operation’s success hinged on the swift action and collaborative spirit within the NFT community. The gesture by Solano to finance the bounty and the proactive approach by Boring Security underscored resilience and unity in the face of adversity. It vividly demonstrated the community’s determination to uphold Security and integrity in the burgeoning NFT space. Meanwhile, the incident exposed vulnerabilities in NFT trading platforms, prompting urgent calls for enhanced security measures. Users were advised to revoke permissions granted to two specific old contracts, identified as potential gateways for similar attacks. This precaution was crucial in preventing further unauthorized NFT transfers. The NFT Trader team, aided by a developer known as Foobar, addressed the breach promptly. Their efforts highlighted the ongoing challenges and the need for continual vigilance in the dynamic world of digital asset trading. As the NFT market evolves, this incident serves as a stark reminder of the importance of robust security measures and the power of community collaboration in safeguarding valuable digital assets.",
    "tags": [
      "#BAYC",
      "#Hacking",
      "#MAYC",
      "#NFT Trader"
    ],
    "publishDate": "18/12/2023"
  },
  {
    "id": 7,
    "title": "Sotheby’s Auction of Bitcoin NFTs Surpasses Expectations, Fetches $450,000",
    "absoluteURL": "https://www.todaynftnews.com/sothebys-auction-of-bitcoin-nfts-surpasses-expectations-fetches-450000/",
    "fullContent": "SNEAK PEEK Sotheby’s recently hosted its inaugural auction of NFTs on the Bitcoin blockchain, marking a significant milestone in the worlds of art and cryptocurrency. The auction featured “BitcoinShrooms,” a collection of pixelated images, which collectively garnered an impressive $450,000, far exceeding initial estimates. A standout piece in the collection, resembling a character from the Super Mario series, was sold for an astonishing $240,000. In a historic moment for the world of art and cryptocurrency, Sotheby’s recently held its first-ever auction of NFTs on the Bitcoin blockchain, featuring a collection of pixelated images known as “BitcoinShrooms.” The results were nothing short of astonishing, as the three images on offer collectively garnered a staggering $450,000, surpassing estimates by a factor of five. The auction concluded on Wednesday and featured a trio of digital artworks, with one standout piece resembling a mushroom character from the iconic Super Mario franchise fetching an astounding $240,000. Another image, a pixelated avocado titled “BIP39 SEED,” originally expected to sell for $20,000 to $30,000, stunned observers by selling for $101,600. This auction was even more remarkable because over two-thirds of the bidders were new to the Sotheby’s platform, indicating a growing interest in NFTs on Bitcoin. This surge in popularity harkens back to the frenzy that engulfed digital-asset markets a couple of years ago when NFTs and digital artwork first started commanding eye-popping prices. Notably, one NFT by artist Beeple fetched an astonishing $69 million at Christie’s auction house. However, many of those NFT collections were built on the Ethereum blockchain, making Sotheby’s Bitcoin NFT auction a unique event. The “BitcoinShrooms” collection is credited to the pseudonymous artist Shroomtoshi and is part of the Ordinals inscriptions, a technology Casey Rodarmor developed atop the Bitcoin blockchain late last year. These inscriptions have gained popularity, causing congestion and increased fees on the Bitcoin network. The success of this auction raises an interesting debate within the Bitcoin community about whether to filter out transactions related to NFT-like inscriptions. Some argue that these inscriptions need to align with the original vision of Bitcoin as a peer-to-peer payment network. However, the perceived value of these digital images as high art could shift the balance in favour of profit interests. Sotheby’s groundbreaking auction of NFTs on the Bitcoin blockchain has demonstrated the mainstream appeal of these digital collectibles. With new bidders flocking to the platform and record-breaking sales, the intersection of art and cryptocurrency is evolving in exciting and unexpected ways.",
    "tags": [
      "#Bitcoin",
      "#Blockchain",
      "#NFT market"
    ],
    "publishDate": "16/12/2023"
  },
  {
    "id": 8,
    "title": "Polygon Joins Forces with The Sandbox for Lower Fee NFT Trading",
    "absoluteURL": "https://www.todaynftnews.com/polygon-joins-forces-with-the-sandbox-for-lower-fee-nft-trading/",
    "fullContent": "SNEAK PEEK The Sandbox has launched its NFT marketplace on the Polygon network, making it more accessible and cost-effective for users. Users can now mint digital assets using CATALYSTs on this new platform, democratizing the NFT creation process. The introduction of a secondary market allows for the resale of ASSETs, broadening trading and monetization opportunities. The Sandbox, a prominent player in the world of NFTs and virtual metaverse creation, has taken a significant stride towards enhancing accessibility and reducing costs for creators and users. The latest development sees the launch of The Sandbox Marketplace on Polygon, a move that promises to reshape the NFT landscape. One of the most notable features of this launch is the ability for anyone to mint their digital assets (ASSETs) on the Polygon marketplace using CATALYSTs. This democratizes the NFT creation process, making it accessible to a broader audience. Notably, Polygon’s network significantly reduces transaction fees, addressing a long-standing concern in the NFT space. Furthermore, The Sandbox introduces a secondary market, allowing NFT owners to resell ASSETs that they didn’t originally create on the platform. This opens up new avenues for trading and monetizing digital collectibles. For those already holding CATALYSTs, minting on the Polygon marketplace becomes readily accessible. But what if you don’t have CATALYSTs yet? The Sandbox plans to distribute CATALYSTs to ecosystem contributors, including LAND owners, as part of their commitment to expanding opportunities for creators. Existing ASSET holders need not worry about the fate of their assets. Minted assets on the Ethereum chain will remain usable and can be bridged to the Polygon layer in the future. Non-minted assets, like equipment, will be migrated to align with the new structure, ensuring a smooth transition for users. Gas fees have long been a concern for NFT enthusiasts, but The Sandbox addresses this by significantly reducing fees on the Polygon marketplace. Additionally, they cover a portion of Polygon transaction fees for users across their ecosystem, enhancing affordability. The user interface of the marketplace has undergone a revamp, with improved asset upload flows, asset moderation, and an enhanced user experience. This ensures a seamless and efficient trading experience for users. To buy your first NFT on Polygon via The Sandbox Marketplace, you need to log in, connect your wallet to the Polygon network, browse the marketplace, select your desired NFT, and complete the purchase. The process is streamlined, making it accessible to both newcomers and seasoned collectors. As The Sandbox expands its metaverse and NFT offerings, creators are encouraged to participate in VoxEdit contests and contribute to the vibrant community. The launch of the new marketplace also comes with a captivating collection from 30 talented artists, adding to the diversity of available ASSETs. The Sandbox’s move to launch its marketplace on Polygon opens up exciting opportunities for creators and collectors alike. With reduced fees, improved user experience, and a commitment to accessibility, it marks a significant step forward in the ever-evolving world of NFTs.",
    "tags": [
      "#NFT market",
      "#Polygon",
      "#The Sandbox"
    ],
    "publishDate": "15/12/2023"
  },
  {
    "id": 9,
    "title": "Casio Unveils Virtual G-Shock Watches as Ethereum NFTs with Exclusive Perks",
    "absoluteURL": "https://www.todaynftnews.com/casio-unveils-virtual-g-shock-watches-as-ethereum-nfts-with-exclusive-perks/",
    "fullContent": "SNEAK PEEK Casio, a Japanese electronics giant, ventures into the NFT space with a limited-edition collection of digital art featuring their iconic G-Shock brand. The NFT offering includes 2,000 art pieces showcasing futuristic “Virtual G-Shock” designs, priced at 0.1 ETH each. The company hints at potential collaborations with NFT holders for co-creating new digital Casio products. Japanese electronics giant Casio has made a bold move into the world of NFTs, offering a limited-edition collection of digital art collectibles featuring their iconic G-Shock brand of watches. This marks Casio’s second venture into the NFT space, following the successful debut of free G-Shock Creator Pass NFTs on the Ethereum scaling network Polygon back in September. The latest offering consists of 2,000 NFT art pieces, showcasing two futuristic and imaginative “Virtual G-Shock” designs. These designs push the boundaries of what’s possible with traditional physical materials and offer collectors a unique digital experience. Priced at 0.1 ETH each, roughly equivalent to $230 at the time of writing, the 1,000 editions of each Virtual G-Shock design promise more than just digital art. Owners of these Ethereum NFTs will enjoy a range of exclusive benefits, including behind-the-scenes access to Casio. They will have the opportunity to tour the G-Shock Endurance Test Laboratory in Tokyo, where they can witness the rigorous durability testing that has made the G-Shock brand legendary. Additionally, NFT collectors will participate in roundtable discussions with Casio’s designers, gaining insight into the creative process behind the virtual G-Shock models. They will also receive exclusive design materials associated with these digital watches and will be given the first right to purchase the next wave of Virtual G-Shock NFTs. Casio has even hinted at potential future collaborations with NFT holders to co-create new digital Casio products, demonstrating their commitment to digital and physical innovation. Oh Takahashi, Casio’s Senior General Manager of Timepieces, expressed the company’s dedication to deepening its engagement with the G-Shock community, stating, “These special incentives for collectors show our passion for innovation in both the digital and physical realms. We aim to deepen our engagement with the G-Shock community, bringing them into the heart of our innovation process.” With this move, Casio has joined the ranks of companies exploring the NFT space, offering enthusiasts not unique digital art but also exclusive experiences and opportunities, making it an exciting development for collectors and fans of the iconic G-Shock brand.",
    "tags": [
      "#Blockchain",
      "#Ethereum",
      "#NFT market"
    ],
    "publishDate": "15/12/2023"
  },
  {
    "id": 10,
    "title": "Web3 Chess Game Developer Discontinues Play-to-Earn Feature Amidst Rampant Cheating",
    "absoluteURL": "https://www.todaynftnews.com/web3-chess-game-developer-discontinues-play-to-earn-feature-amidst-rampant-cheating/",
    "fullContent": "SNEAK PEEK Immortal Game, a popular blockchain chess game, has announced the closure of its play-to-earn and NFT features. The decision was driven by widespread cheating, undermining the game’s integrity and player experience. This move has significantly impacted the play-to-earn gaming community and NFT market. Developers of the popular blockchain chess game Immortal Game have announced a significant decision that is sending shockwaves through the world of play-to-earn (P2E) gaming and nonfungible tokens (NFTs). In a surprising move, the creators have decided to shut down the P2E and NFT features of the Game due to a growing problem of rampant cheating. This move, announced on December 13, has left the gaming community in awe as Immortal Game was initially hailed as a pioneering platform aiming to provide players with a legitimate opportunity to earn income through chess. However, their noble intentions have backfired, leading to an influx of unfair practices and cheating within the Game. The root of the problem is the large sums of cash rewards offered with no entry barriers, which inadvertently encouraged players to exploit the system. In their announcement, immortal Game’s developers noted that this situation degraded the experience for genuine players who sought a fair and secure environment to enjoy online chess. Starting immediately, the marketplace for Immortal Game NFTs will be discontinued, and players will no longer be able to use the native P2E Checkmate token (CMT) within the Game. While NFTs will continue on the blockchain, users will no longer receive CMT rewards for participating in tournaments or daily challenges. Instead, fiat currency rewards may be introduced as an alternative. In a further adjustment, users will no longer see their ETH and CMT balances displayed on the platform, although these tokens will remain in their wallets. Those using custodial wallets must connect a personal wallet to facilitate asset transfers. Before its discontinuation, Immortal Game NFTs had amassed a lifetime trading volume of $885,600, while the CMT token boasted a fully diluted market capitalization of $360,075. These NFTs were minted on the Immutable blockchain, adding to the gaming landscape. This decision by Immortal Game’s developers marks a turning point in the P2E and NFT gaming industry, as it highlights the challenges and pitfalls associated with offering substantial financial incentives to players. It remains to be seen whether other projects in the space will follow suit or find innovative solutions to combat cheating while maintaining the allure of play-to-earn gaming.",
    "tags": [
      "#Blockchain",
      "#NFT market",
      "#Web3"
    ],
    "publishDate": "14/12/2023"
  },
  {
    "id": 11,
    "title": "NFT Division of Line Messenger Secures $140 Million Funding for Web3 Services",
    "absoluteURL": "https://www.todaynftnews.com/nft-division-of-line-messenger-secures-140-million-funding-for-web3-services/",
    "fullContent": "SNEAK PEEK Line Next, the NFT arm of Line, secures $140 million in funding for its global NFT marketplace, DOSI. Funding led by Crescendo Equity Partners, backed by Peter Thiel, showcases strong support for Line Next’s Web3 initiatives. DOSI integrates with Line’s existing Japan-based NFT marketplace, offering a comprehensive mobile app for worldwide NFT trading. Line Next, the NFT arm of the popular messaging app Line, has secured $140 million in funding as it gears up to launch a global NFT marketplace, DOSI, in January 2024. The funding round was led by Crescendo Equity Partners, a private equity firm backed by Peter Thiel. Line Next, dedicated to exploring Web3 initiatives, is poised to make waves in the NFT ecosystem with this substantial backing. DOSI, Line Next’s forthcoming global NFT marketplace, is set to integrate with Line’s existing Japan-based NFT marketplace, known as Line NFT. This integration will offer users an extensive and seamless NFT trading experience, all accessible through a mobile app that will be available worldwide. However, the ambitions of Line Next extend beyond just the NFT marketplace. Part of the $140 million fund will be allocated to the development of new Web3-focused services. Among these is a social app that enables users to interact with AI-generated characters, adding a unique twist to the social media landscape. Additionally, Web3 games will be part of Line Next’s repertoire, aiming to harness the power of blockchain technology for gaming enthusiasts. One notable aspect of Line’s NFT marketplace is its choice of blockchain technology. It will be built on the Finschia public blockchain, solidifying Line Next and Crescendo’s role as governance members of the Finschia Foundation. This strategic move positions Line Next to leverage the benefits of blockchain technology effectively. Shane Mac, co-founder of XMTP, emphasized the significance of Web3 messaging in a recent podcast, highlighting its potential to offer users greater control over their online interactions. Web3 messaging, he explained, represents a shift toward a new form of identity, where individuals have their wealth and personalities tied to wallet addresses. This innovative approach enhances security and trust in online communication. Line Next’s successful funding round and its upcoming NFT marketplace launch mark a significant development in the Web3 landscape. With a focus on AI-powered social apps and Web3 games, Line Next is poised to make waves in the NFT ecosystem and beyond. Utilizing blockchain technology further underscores the commitment to innovative solutions for the digital age.",
    "tags": [
      "#LINE App",
      "#NFT market",
      "#Web3"
    ],
    "publishDate": "13/12/2023"
  },
  {
    "id": 12,
    "title": "FIFA Set to Debut NFT Collection Ahead of 2023 Club World Cup",
    "absoluteURL": "https://www.todaynftnews.com/fifa-set-to-debut-nft-collection-ahead-of-2023-club-world-cup/",
    "fullContent": "SNEAK PEEK FIFA partners with Modex for its first NFT collection, set to launch on December 15. 100 exclusive NFTs offer a unique opportunity to secure tickets to the FIFA World Cup 2026 final. 900 digital collectibles on Polygon and OpenSea showcase memorable moments from the Club World Cup. FIFA, the international governing body for soccer, has announced its foray into the world of nonfungible tokens (NFTs), with an exclusive collection set to premiere just ahead of the 2023 Club World Cup in Saudi Arabia. In collaboration with blockchain firm Modex, FIFA’s inaugural NFT collection promises to offer fans an exciting opportunity. The collection, scheduled to launch on December 15, will consist of 100 NFTs, each of which grants the lucky owner a chance to secure tickets to the FIFA World Cup 2026 final—an enticing prospect for soccer enthusiasts worldwide. Additionally, 900 digital collectibles will be issued on the Polygon network and OpenSea this month. These NFTs will feature memorable moments from the tournament and digital renditions of coveted memorabilia. The FIFA Club World Cup, commencing on December 12 in Jeddah, Saudi Arabia, will bring together seven of the world’s finest football teams, including champions from FIFA’s six confederations. Fans eager to acquire these NFTs can do so via FIFA’s dedicated platform, FIFA+ Collect, launched in September 2022 and operates on the Algorand blockchain. Digital collectibles have rapidly gained popularity among sports enthusiasts, offering novel ways for fans to engage with their favorite players, teams, and the beautiful game. Francesco Abbate, CEO of Modex, expressed his enthusiasm, stating, “Digital collectibles increase how fans can interact with their favorite players, teams, and the game they love, and we’re honored to support FIFA in realizing this goal.” Since its inception, FIFA+ Collect has hosted 11 NFT drops, minting 909,255 digital collectibles held by 16,448 individuals. Notably, these NFTs have generated a trading volume of $2.4 million across primary and secondary NFT markets. FIFA+ Collect Info clarifies that the mint volume may include packs obtained through challenges rather than those purchased with USDC. This move by FIFA into the NFT space underscores the growing influence of blockchain technology in sports, offering fans unique opportunities to own digital pieces of soccer history while fostering a deeper connection with the sport they love. As the 2023 Club World Cup unfolds, the NFT world eagerly awaits the launch of this exclusive collection, setting a new precedent for the intersection of sports and blockchain technology.",
    "tags": [
      "#FIFA",
      "#NFT market"
    ],
    "publishDate": "13/12/2023"
  },
  {
    "id": 13,
    "title": "Former U.S. President Donald Trump Unveils NFT Collection with a ‘MugShot’ Theme",
    "absoluteURL": "https://www.todaynftnews.com/former-u-s-president-donald-trump-unveils-nft-collection-with-a-mugshot-theme/",
    "fullContent": "SNEAK PEEK Former President Trump announces his third NFT drop titled “MugShot,” depicting his historic arrest in 2023. Digital trading cards are available for $99; buyers of 47 or more cards can own Trump’s actual suit and dine with him at Mar-a-Lago. NFTs accessible through credit card or wETH, transferable on December 31, 2024; buyers must provide KYC information. Former U.S. President Donald Trump has announced his third nonfungible token (NFT) drop, titled “MugShot,” which revolves around his ongoing legal troubles. These unique digital trading cards are available for $99 each, with an intriguing incentive for buyers who acquire 47 or more cards: the chance to own a piece of President Trump’s actual suit from his infamous mugshot and enjoy dinner at Mar-a-Lago with the former president himself. What sets this NFT collection apart is its connection to a significant historical moment. On August 24, 2023, Donald Trump was formally arrested in Fulton County, Georgia, marking the first-ever mugshot of a United States President. In the arresting photo, Trump sports a furrowed brow and a determined gaze, symbolizing his unwavering spirit with the caption, “he’ll never surrender.” This NFT drop is accessible through credit card payments or Wrapped Ether (wETH), but there’s a catch. These digital assets will be transferable on December 31, 2024. Additionally, buyers must provide Know Your Customer (KYC) information, even if they opt to use cryptocurrency for their purchase. The “MugShot” NFT collection follows Trump’s two successful NFT launches. Notably, the former First Lady Melania Trump has also ventured into the NFT space with her collection. Trump decided to release this NFT collection as he seeks a non-consecutive second term in the 2024 U.S. presidential election. Currently facing 91 felony charges on allegations of business fraud and efforts to overturn the 2020 U.S. presidential election, it’s important to note that the U.S. Constitution does not automatically disqualify suspects or convicted individuals from running for federal office. Enforcing the 14th Amendment, which bars condemned insurrectionists from holding public office, would require congressional action. In the world of NFTs, where art and history intersect with digital innovation, President Trump’s “MugShot” drop adds another layer of intrigue and controversy, reflecting the ongoing narrative of his legal battles and political ambitions. This collection will draw attention and scrutiny as NFTs captivate the digital art world.",
    "tags": [
      "#Donald Trump NFT",
      "#NFT market"
    ],
    "publishDate": "13/12/2023"
  },
  {
    "id": 14,
    "title": "Yuga Labs Co-Founder Addresses Speculations About Their Return During Ongoing Health Hiatus",
    "absoluteURL": "https://www.todaynftnews.com/yuga-labs-co-founder-addresses-speculations-about-their-return-during-ongoing-health-hiatus/",
    "fullContent": "SNEAK PEEK Yuga Labs co-founder Wylie Aronow postpones return due to ongoing health recovery, prioritizing long-term well-being. Aronow, aka Gordon Goner, maintains a board role and strategic advisory position despite a congestive heart failure diagnosis. Despite health challenges, Aronow actively observes Yuga Labs’ operations, identifying key issues and suggesting changes. NFT entrepreneur Wylie Aronow, co-founder of Yuga Labs, has officially addressed rumors about his potential return to the NFT firm. Despite making steady progress in his health recovery, Aronow has firmly stated that he is not yet ready to return, emphasizing the importance of ensuring his long-term well-being. Aronow, who also goes by the name Gordon Goner, had taken a leave of absence from Yuga Labs in late January due to a congestive heart failure diagnosis. At that time, he clarified that he would continue to serve as a board member and strategic adviser to the company. In his recent statement, Aronow revealed the unpredictable nature of his health journey, describing days when he feels ready to dive back into work and others when he feels the need for immediate medical attention. While he has been away, Aronow has been watching Yuga Labs’ operations, responsible for popular NFT projects like Bored Ape Yacht Club (BAYC) and CryptoPunks. He has identified key issues hindering the company’s progress and has suggested necessary changes during board meetings. Despite his absence, Aronow expressed confidence in the current leadership of Yuga Labs, especially as the company faces a critical year in 2024. He believes the team is well-prepared to meet the challenges and impress the community. Before stepping back, Aronow acknowledged that he had pushed himself to the limits, working long hours nearly every day. He admitted that he should have heeded the advice of those around him and sought a better work-life balance. Yuga Labs has not stood still during Aronow’s absence, appointing Daniel Alegre, the former president and chief operating officer of Activision Blizzard, as its new CEO about a month before Aronow’s leave. In February 2021, Aronow co-founded Yuga Labs alongside Greg Solano, Zeshan Ali, and Kerem Atalay. The company’s portfolio includes notable NFTs such as CryptoPunks, BAYC, MeeBits, and Othersidemeta. Aronow’s commitment to his health and support to Yuga Labs from the sidelines highlight the resilience and determination of the entrepreneur and the NFT industry in navigating challenges and uncertainties.",
    "tags": [
      "#Blockchain",
      "#NFT market",
      "#Yuga Labs"
    ],
    "publishDate": "12/12/2023"
  },
  {
    "id": 15,
    "title": "South Korea Exempts NFTs and CBDCs from Cryptocurrency Interest Mandate",
    "absoluteURL": "https://www.todaynftnews.com/south-korea-exempts-nfts-and-cbdcs-from-cryptocurrency-interest-mandate/",
    "fullContent": "SNEAK PEEK Starting July 2024, South Korea’s FSC will enable investors to earn interest on digital asset deposits in exchanges. The directive excludes nonfungible tokens and central bank digital currencies from earning interest. Exchanges must segregate user deposits, entrust them to banks, and store 80% of coins in cold wallets. South Korea’s Financial Services Commission (FSC) has issued a new directive that will impact digital asset investors and exchanges in the country. According to the FSC’s notice, starting from July 2024, investors who deposit their digital assets into exchanges will be entitled to receive interest on their deposits. This move is part of South Korea’s efforts to regulate the crypto space more comprehensively. However, there are exceptions to this new rule. Nonfungible tokens (NFTs) and central bank digital currencies (CBDCs) have been excluded from the mandate. The FSC’s decision to exclude NFTs and CBDCs reflects the unique nature of these digital assets, which may not fit the criteria for interest-bearing deposits. Interestingly, the FSC has left room for potential exceptions to this exclusion. If certain NFTs are categorized as payment methods and are issued in significant quantities, they may be reclassified as virtual assets and become eligible for interest when deposited into exchanges. This shows the regulator’s flexibility in adapting to the evolving landscape of digital assets. In addition to addressing interest on deposits, the FSC has also laid out guidelines for the safe handling of user deposits by virtual asset operators. Exchanges are now required to segregate user deposits from their own assets and entrust them to a bank. Furthermore, a substantial portion, specifically 80%, of the coins must be stored in a secure cold wallet, enhancing security measures. The FSC’s directive also covers preparations for potential hacks or computer incidents. Virtual asset service providers are mandated to either acquire insurance or accumulate reserves to mitigate the impact of such incidents. Additionally, the new law prohibits exchanges from blocking deposits or withdrawals unless it is deemed absolutely necessary and authorized by the courts or financial regulators. South Korea has been actively solidifying its regulatory framework for the cryptocurrency industry. Earlier in December, financial regulators called on users to report unlicensed crypto exchanges operating within the country. This initiative was led by the Digital Asset Exchange Association and the Financial Intelligence Unit of South Korea. As South Korea continues to adapt to the ever-evolving landscape of digital assets, these regulatory changes aim to strike a balance between investor protection and industry growth. The FSC’s decision to exclude NFTs and CBDCs, while allowing for potential exceptions, highlights the need for flexible and nuanced regulation in the world of cryptocurrencies.",
    "tags": [
      "#NFT market",
      "#South Korea"
    ],
    "publishDate": "11/12/2023"
  },
  {
    "id": 16,
    "title": "NFT Trading Surges Close to $1 Billion as Bullish Momentum Grips Crypto Markets",
    "absoluteURL": "https://www.todaynftnews.com/nft-trading-surges-close-to-1-billion-as-bullish-momentum-grips-crypto-markets/",
    "fullContent": "SNEAK PEEK The trading volume of Non-Fungible Tokens (NFTs) is approaching a significant milestone, nearing $1 billion in total value. A substantial 125% increase in NFT trading activity occurred in November. The average transaction value of NFTs has significantly risen, indicating a growing market interest and value. In a compelling turn of events, the nonfungible token (NFT) market has experienced a robust surge in trading volume, approaching the $1 billion mark in November. DappRadar, a decentralized app tracking platform, released data revealing that NFT trading has embraced the bullish wave, marking the second consecutive month of upward momentum. The report from DappRadar indicates a remarkable 125% increase in NFT trading volume in November, signaling a significant shift in user behavior compared to previous downtrends in NFT activity. Notably, this surge comes amid a broader positive trend in the cryptocurrency markets. Executives within the Web3 space are optimistic about the continuation of this trend. Jonathan Perkins, the co-founder of SuperRare, conveyed to Cointelegraph on November 14 that the worst of the bear market appears to be behind us, suggesting a favorable outlook for the NFT sector in the coming months. In addition to the surge in trading volume, the average value of NFT transactions experienced an impressive 114% increase, climbing from $126 to $270 throughout November. This indicates a growing confidence and willingness among participants to engage in higher-value transactions within the NFT space. DappRadar’s report also sheds light on the increased daily unique active wallets (UAW) in blockchain gaming, witnessing a 14% rise. The decentralized applications industry saw blockchain gaming with a 34% market dominance, reinforcing its status as a fundamental pillar in the decentralized ecosystem. Despite a seemingly bearish mood throughout the year, blockchain gaming projects have managed to secure a substantial $2.3 billion in investments from the beginning of 2023 up to October. This resilience is particularly evident in the third quarter of 2023, where blockchain gaming secured an impressive $600 million in investments, even amidst lower cryptocurrency market prices than previous peaks. In conclusion, the NFT market’s remarkable resurgence and the resilience of blockchain gaming investments paint a picture of a dynamic and evolving landscape within the cryptocurrency space. As the crypto markets turn bullish, these trends may signal a broader shift in user sentiment and behavior, marking a positive outlook for the industry in the months ahead.",
    "tags": [
      "#Blockchain",
      "#NFT market"
    ],
    "publishDate": "11/12/2023"
  },
  {
    "id": 17,
    "title": "Animoca Brands Secures Additional $11.88 Million for Mocaverse in Second Funding Tranche",
    "absoluteURL": "https://www.todaynftnews.com/animoca-brands-secures-additional-11-88-million-for-mocaverse-in-second-funding-tranche/",
    "fullContent": "SNEAK PEEK Animoca Brands Corporation Limited successfully raised $11.88 million in a second funding tranche for Mocaverse. Key participants in this funding round included Block1, OKX Ventures, Foresight Ventures, Polygon Ventures, Dapper Labs, among others. The funding was achieved by issuing new ordinary shares priced at A$4.50 each, and investors received free-attaching utility token warrants on a 1:1 dollar basis. Animoca Brands Corporation Limited has announced the successful completion of a second funding tranche for Mocaverse, raising $11.88 million. This comes after an initial investment of $20 million in September 2023. We are pleased to announce that we have raised an additional US$11.88 million for @MocaverseNFT to build the digital identity and point system for #Web3 #gaming, culture, and entertainment.🎉 Full details: https://t.co/g4GXNp1NEB pic.twitter.com/yCt5wfmPET — Animoca Brands (@animocabrands) December 8, 2023 Prominent participants in this funding round included Block1, OKX Ventures, Foresight Ventures, Polygon Ventures, Dapper Labs, and others. The funding was raised by issuing new ordinary shares at a price per share of A$4.50. Notably, investors in each round were granted free-attaching utility token warrants on a 1:1 dollar basis. Mocaverse is focused on establishing itself as the empowerment layer for Web3 culture and entertainment. It aims to facilitate seamless onboarding and sustained growth for Web3 projects through its loyalty system, the Web3 Frequent Player Program, powered by Mocaverse loyalty points known as “Realm Points.” Mocaverse is set to serve as an interoperable meta-experience layer for Web3 identity, social interactions, and growth. Users can create their digital identity, build a reputation, and earn and spend Realm Points within the Mocaverse ecosystem. This ecosystem is supported by Animoca Brands’ extensive portfolio of over 400 companies and a partner network with more than 700 million addressable users. The recently introduced Moca ID will play a pivotal role as a digital passport, allowing users to earn Realm Points through engagement within the Mocaverse ecosystem. These points can then be redeemed for exclusive real-life benefits and rewards offered by Mocaverse and Animoca Brands. The Web3 Frequent Player Program is envisioned as a permissionless and interoperable loyalty system, with plans for progressive decentralization to enable third-party adoption and integration of Moca ID. This approach aims to enhance accessibility and foster growth within the broader Web3 ecosystem. Animoca Brands is raising funds through Simple Agreements for Future Equity (SAFEs) with sophisticated investors, totaling $11.88 million at a share price of A$4.50. The SAFEs will automatically convert to ordinary shares after six months, with the number of new shares determined by the AUD: USD exchange rate at settlement. Currently, Animoca Brands has 1,910,074,127 outstanding fully paid ordinary shares. This additional funding for Mocaverse marks a significant step in advancing the vision of Web3 culture and entertainment empowerment. Mocaverse’s innovative approach and the support from prominent investors underscore its potential to reshape the Web3 landscape.",
    "tags": [
      "#Animoca Brands",
      "#OKX Exchange",
      "#Web3"
    ],
    "publishDate": "08/12/2023"
  },
  {
    "id": 18,
    "title": "Reebok Enters the Realm of Digital Fashion and Gaming, Enhanced by AI, Following Nike’s Lead",
    "absoluteURL": "https://www.todaynftnews.com/reebok-enters-the-realm-of-digital-fashion-and-gaming-enhanced-by-ai-following-nikes-lead/",
    "fullContent": "SNEAK PEEK Reebok, a sportswear brand owned by Adidas, is entering the digital fashion and gaming sphere by partnering with crypto tech startup Futureverse. This collaboration is focused on integrating AI and blockchain technologies into Reebok’s products, reminiscent of Nike’s earlier ventures in digital fashion. The partnership aims to bring Reebok’s styles into the digital world as wearable NFTs and to create immersive virtual gaming experiences. Reebok, a prominent sportswear brand, is making significant strides into digital fashion and gaming, reminiscent of Nike’s earlier ventures. Owned by Adidas, Reebok has formed a unique partnership with the crypto tech startup Futureverse, marking a significant step towards integrating AI and blockchain technologies into their products. Thrilled to announce our exclusive partnership with @Reebok to leverage our AI and metaverse technology to revolutionize digital fashion. Together, we introduce @ReebokImpact. Coming 2024. pic.twitter.com/30Qk02aujk — Futureverse (@futureverse) December 7, 2023 This collaboration aims to revolutionize digital fashion and extend Reebok’s brand into virtual spaces. The plan includes the development of AI-enhanced and blockchain-supported games and digital experiences. This initiative brings Reebok’s styles into the digital world as wearable NFTs and emphasizes creating immersive virtual gaming experiences. A critical project in this partnership is “Reebok Impact,” which is slated for launch next year. This initiative is described as a “mind and heart-bending digital shoe experience” that integrates AI technology with on-chain digital wearables. The goal is to illustrate that life’s essence is not just about the sneakers one wears but about one’s experiences while wearing them. Reebok CEO Todd Krinsky highlighted the importance of participating in the world purposefully, and this partnership with Futureverse is seen as a step towards redefining the limits of innovation and consumer engagement in the digital evolution of products. Futureverse, which secured $54 million in Series A funding in July, aims to create an “open metaverse” where digital assets like NFTs can move freely across multiple platforms. The company is expanding its ecosystem by acquiring other crypto firms, games, and metaverse experiences, although this collaboration with Reebok marks its first foray into digital footwear. In comparison, Nike acquired RTFKT, an NFT sneaker studio, in December 2021, leading the footwear industry into the virtual domain. Since then, Nike has built a robust NFT community and released exclusive physical sneaker collections with digital counterparts. Following this trend, brands like Adidas, Dior, and Puma have launched similar “phygital” products. While Reebok has not announced any plans for physical sneakers linked to digital tokens yet, it has revealed a limited-edition sneaker drop in collaboration with Gary Vaynerchuk’s NFT brand VeeFriends. This special edition will initially be available to VeeFriends token holders before being released globally. Reebok’s partnership with Futureverse represents a significant move into the digital realm, blending AI and blockchain technology to create unique gaming and digital fashion experiences, potentially reshaping how consumers interact with the brand in virtual spaces.",
    "tags": [
      "#Blockchain",
      "#NFT market"
    ],
    "publishDate": "08/12/2023"
  },
  {
    "id": 19,
    "title": "Megadeth Leaps into NFT Realm with Exclusive Fan Experiences",
    "absoluteURL": "https://www.todaynftnews.com/megadeth-leaps-into-nft-realm-with-exclusive-fan-experiences/",
    "fullContent": "SNEAK PEEK Megadeth’s NFTs redefine music fan engagement, bridging real and virtual realms for a groundbreaking experience. Exclusive content and one-on-one interactions make Megadeth’s NFTs more than collectibles, enhancing fan connections. The heavy metal genre’s embrace of NFTs, exemplified by Avenged Sevenfold, signals a growing trend in the music industry. Thrash metal pioneer Megadeth has made a significant entry into the world of NFTs. On December 5, they announced a unique collection that merges digital and physical realms. This initiative marks a new era for fan interaction in the music industry. The band, fronted by Dave Mustaine, has millions of loyal followers. Their excitement is palpable, signaling a significant shift in how fans engage with music icons. The collection, named MegadethDigital, features 5,000 generative pieces. It stars Vic Rattlehead, the band’s digital mascot, in a fresh artistic vision. The initiative, set to go live on December 22, transcends typical fan club boundaries. Hence, it promises a community-owned experience, blending the real and the virtual worlds. Introducing @MegadethDigital. Our 5000-piece generative collection featuring Vic Rattlehead brought to life in a new way by our talented artist @TheHaddy. Live on December 22nd, you\u0027ll have the opportunity to unlock doors in the real and metaverse world alike, gaining access to… pic.twitter.com/Ed9YxqCTe6 — Megadeth (@Megadeth) December 5, 2023 Moreover, these NFTs are not mere collectibles. They serve as keys to exclusive content and experiences. Holders can access special merchandise and VIP events. Additionally, they offer chances for one-on-one interactions with band members. This approach adds a tangible, personal touch to digital assets. Megadeth’s foray into NFTs mirrors a growing trend in the heavy metal genre. Notably, Avenged Sevenfold’s Deathbats Club has also embraced Web3 technology. They pioneered NFT ticketing for their concerts, receiving a warm welcome from fans. Consequently, this movement signifies a broader acceptance of NFTs in the music industry. Shoutout to @DeathbatsClub for leading the way in NFT utility and a seamless purchasing of tickets. I know a lot of happy fans out there right now who are glad they bought in! #A7X3rdLeg #A7X #DBC 💀🦇🔥 pic.twitter.com/wYDemKrMTW — Nate (@BestBagleinTown) November 29, 2023 Significantly, Megadeth’s move is more than a nod to current trends. It is a strategic embrace of technology for deeper fan engagement. Their NFTs act as a bridge, connecting the virtual and physical fan experiences. This innovative approach could set a new standard for artist-fan interactions. However, the initiative’s success hinges on the fans’ reception and participation. Early responses suggest a positive outlook. Fans are eager to explore this new dimension of their favorite band. The combination of heavy metal and NFTs is a winning formula. Megadeth’s NFT venture reflects the evolving landscape of music and technology. It not only offers exclusive experiences but also empowers fans. As this trend grows, it could revolutionize how artists and fans connect. MegadethDigital is not just a collection; it’s a pioneering step into a future where music, art, and technology converge seamlessly.",
    "tags": [
      "#NFT market"
    ],
    "publishDate": "07/12/2023"
  },
  {
    "id": 20,
    "title": "Ethereum NFT Developers Rush to Safeguard Projects Against Thirdweb Security Flaw",
    "absoluteURL": "https://www.todaynftnews.com/ethereum-nft-developers-rush-to-safeguard-projects-against-thirdweb-security-flaw/",
    "fullContent": "SNEAK PEEK Thirdweb, a provider of crypto development tools, has disclosed a significant vulnerability in their smart contracts, impacting the Ethereum NFT community. The issue affects pre-built contracts from Thirdweb, particularly concerning Ethereum’s ERC-721, ERC-1155, and ERC-20 standards. OpenZeppelin, another smart contract library, confirmed that the vulnerability does not originate from their code but is helping to address the issue. In the dynamic world of Ethereum NFTs, a recent revelation about a vulnerability in Thirdweb’s smart contracts has sent ripples through the community. Thirdweb, known for its crypto development tools, disclosed a significant issue in a widely used open-source library for Web3 smart contracts. This discovery has prompted a swift response from Ethereum NFT marketplaces and creators, underscoring the urgency of securing digital assets. The vulnerability, which remains undisclosed to prevent exploitation, affects pre-built contracts provided by Thirdweb and potentially others. Smart contracts are the backbone of decentralized apps and NFT collections, making this a critical concern for stakeholders. OpenZeppelin, another prominent player in smart contract libraries, clarified that the problem does not originate from its repository. Despite this, the company has committed to leading the community in identifying affected parties and offering mitigation strategies. IMPORTANT On November 20th, 2023 6pm PST, we became aware of a security vulnerability in a commonly used open-source library in the web3 industry. This impacts a variety of smart contracts across the web3 ecosystem, including some of thirdweb’s pre-built smart contracts.… — thirdweb (@thirdweb) December 5, 2023 In a proactive measure, Thirdweb advises projects to lock down their current smart contracts and transition to new ones, ensuring the safety of their collections. The firm has also pledged to support affected parties financially by covering the network fees for this migration. This recommendation comes after Thirdweb implemented a fix to its smart contract templates on November 22, ensuring that contracts deployed after this date are secure. The exploit impacts NFT smart contracts adhering to Ethereum’s ERC-721 and ERC-1155 standards and ERC-20 standard fungible tokens. Thirdweb’s blog post provides a detailed list of affected contract types and a tool for identifying compromised contracts. Several major industry players have weighed in on the situation. OpenSea and Rarible, leading NFT marketplaces, are exploring ways to assist collection owners with contract migrations. Coinbase revealed that some collections on its NFT platform are affected, while Manifold, a smart contract startup, confirmed its contracts are safe. Base, an Ethereum layer-2 network, acknowledged the impact on some project contracts but assured the network’s security. Ethereum profile picture project Cool Cats and Animoca Brands’ Mocaverse gaming platform are moving to new contracts to safeguard their NFT collections. In response to the challenge, Thirdweb has doubled its bug bounty payments to $50,000 and committed to a more stringent auditing process in the future. This incident highlights the ongoing challenges in the rapidly evolving field of NFTs and the importance of robust security measures to protect digital assets in the decentralized space.",
    "tags": [
      "#Ethereum",
      "#NFT market"
    ],
    "publishDate": "06/12/2023"
  },
  {
    "id": 21,
    "title": "Tiger Global \u0026 Coatue Management Cut NFT Investments Amid Market Volatility",
    "absoluteURL": "https://www.todaynftnews.com/tiger-global-coatue-management-cut-nft-investments-amid-market-volatility/",
    "fullContent": "SNEAK PEEK Tiger Global’s NFT portfolio slashes reflect crypto market caution amid volatility. Coatue Management marks down OpenSea investment by 90%, echoing NFT market reevaluation. The evolving NFT space prompts major investors to recalibrate, shaping crypto’s future stability. In a significant move, Tiger Global, a prominent investment firm, has drastically reduced its investments in notable non-fungible token (NFT) projects. These investments include the Bored Ape Yacht Club (BAYC) collection and the NFT marketplace OpenSea. Bloomberg’s recent report reveals that Tiger Global slashed its BAYC stakes by 69% and OpenSea holdings by 94%. Moreover, the firm has also cut valuations for several other portfolio companies. Tiger Global’s decision reflects a cautious approach towards the volatile crypto market. The firm has been diversifying its investments in the crypto realm, focusing on NFTs and blockchain security and privacy-focused initiatives. In 2021, it co-led a $24 million funding round for blockchain security company CertiK, emphasizing its commitment to enhancing decentralized finance (DeFi) security. Furthermore, in 2022, Tiger Global participated in a Series B investment for Aleo, a zero-knowledge applications platform, which successfully raised $200 million. This round saw leading investors like Kora Management LP and SoftBank Vision Fund 2. Additionally, the firm invested in Polygon, a layer-2 network, showcasing its broad interest in crypto. However, Tiger Global is not alone in this cautious stance. Coatue Management, another major player and co-lead investor in OpenSea, recently marked down its investment in the NFT marketplace by 90%. This reduction brought OpenSea’s valuation down to $1.4 billion, a significant decrease from its previous valuation. These markdowns by Tiger Global and Coatue Management signal a broader trend of reevaluation within the NFT market. Investors are becoming more circumspect, primarily due to fluctuating market values. Consequently, this shift could lead to more conservative investment strategies in the NFT and broader crypto sectors. Besides these adjustments, these investment giants’ moves underscore the NFT space’s evolving nature. Hence, as the market matures, further recalibrations in investments are likely. These developments may pave the way for more stable and sustainable growth in the crypto and NFT sectors in the long run.",
    "tags": [
      "#NFT market"
    ],
    "publishDate": "02/12/2023"
  },
  {
    "id": 22,
    "title": "Notable NFT Collector Expands His Digital Art Portfolio Adam Weitsman’s Bold NFT Move with Gold Mega Koda",
    "absoluteURL": "https://www.todaynftnews.com/notable-nft-collector-expands-his-digital-art-portfolio-adam-weitsmans-bold-nft-move-with-gold-mega-koda/",
    "fullContent": "SNEAK PEEK Adam Weitsman’s acquisition of Gold Mega Koda #9969 signals his deep commitment to NFTs and Web3 gaming. Weitsman’s involvement in high-value NFT transactions, like the 100 ETH purchase, showcases his dedication to digital collectibles. Animoca Brands’ role in this sale and the involvement of APPRECIATION emphasizes the significance of this NFT transaction in the digital art world. In a significant development within the NFT industry, Adam Weitsman acquired Gold Mega Koda #9969, as shared in a recent announcement. This move marks another important step in Weitsman’s journey within the digital art space. Weitsman, renowned for his business acumen, notably heads Upstate Shredding. He is also a respected figure in the entrepreneurial and philanthropic spheres. His latest acquisition from Animoca Brands speaks volumes. It demonstrates his unwavering commitment to the digital realm, particularly Web3 gaming. Weitsman, a staunch supporter of the Yuga Labs ecosystem, continues to showcase his belief in its potential. Consequently, his investment in NFTs and digital art has been consistent and impactful. Welcome to the family! Thank you @animocabrands for your trust 🙏🏼 pic.twitter.com/t1L1boankc — Adam Weitsman (@AdamWeitsman) November 29, 2023 The purchase, made for a handsome sum of 100 ETH, is not just a financial transaction. It signifies a deeper involvement in the ever-evolving world of digital collectibles. This year has seen Weitsman make several noteworthy acquisitions. Among them, the rare Mega Koda #9951 stands out. Additionally, his purchase of the Dookie Dash Golden Key, later transforming into the Legendary HV-MTL #1, made headlines with its $1.6 million price tag. The Gold Mega Koda #9969 is unique in its design and features. It boasts Gold-Melted Eyes, a Regal Head, and a 24k Thoracic Core. Furthermore, it is equipped with an Everlights Wand, making it a coveted item among collectors. Weitsman’s gratitude to Animoca Brands for this transaction highlights the mutual respect in this partnership. Congratulations on the new #NFT acquisition @AdamWeitsman! 🤝 https://t.co/8XjsXRbmKM — Animoca Brands (@animocabrands) November 30, 2023 Animoca Brands, a prominent player in the NFT market, facilitated this sale. Their reputation for handling high-profile transactions remains unblemished. Moreover, the involvement of APPRECIATION, led by Steven Papas, in brokering this deal adds another layer of prestige. This advisory firm specializes in digital art and collectible acquisitions, further legitimizing the significance of this transaction. Weitsman’s latest acquisition is more than just an addition to his collection. It represents his belief in the potential of NFTs and Web3 gaming. This move solidifies his position as a key player in the digital landscape. Hence, it also underscores the growing importance of NFTs in the broader context of digital art and collectibles.",
    "tags": [
      "#Animoca Brands",
      "#NFT market",
      "#Web3"
    ],
    "publishDate": "01/12/2023"
  },
  {
    "id": 23,
    "title": "RARI Chain Revolutionizes NFT Royalties on Arbitrum",
    "absoluteURL": "https://www.todaynftnews.com/rari-chain-revolutionizes-nft-royalties-on-arbitrum/",
    "fullContent": "SNEAK PEEK RARI Chain’s creator-centric approach guarantees fair royalties, reshaping NFT economics. Rarible’s stance on creator rights led to a 637% trading volume surge within 24 hours. The partnership with Arbitrum, LayerZero, and WalletConnect strengthens RARI Chain’s commitment to ensuring fair compensation. The RARI Foundation recently unveiled an Ethereum Virtual Machine (EVM)-compatible blockchain named RARI Chain. This chain uniquely embeds royalties into its nodes. Consequently, it offers an NFT infrastructure solution built on Arbitrum. Moreover, this innovation ensures that creators receive the royalties due to them, solidifying their success in the digital realm. Significantly, the introduction of the RARI Chain follows Rarible’s impressive trading volume surge. This uptick occurred after Rarible’s firm stance on maintaining creator royalties in August. They excluded marketplaces like OpenSea and Blur.io from their data aggregation for not supporting these royalties. This move reflects Rarible’s dedication to creator rights and has led to a 637% increase in trading volume within 24 hours, as reported by DappRadar. 1/ Following @rarible\u0027s decision to maintain creator royalties, and remove both @opensea and @blur_io from their aggregation data, Rarible\u0027s trading volume is up 637% in the past 24h. Do you think Rarible is right? 🤔 View @rarible on DappRadar 👇https://t.co/9hh0AQa7Nj pic.twitter.com/cg1dPChYar — DappRadar (@DappRadar) August 23, 2023 Moreover, the RARI Chain is not just another blockchain solution. It represents a pivotal shift in how creators’ earnings are protected in the Web3 ecosystem. Alex Salnikov, co-founder of Rarible, emphasizes the need for a “creator-centric ecosystem.” He asserts that embedding royalties at the node level isn’t just a promise but a guarantee of creator earnings. This approach ensures a sustainable economy for digital creators. Additionally, the RARI Foundation’s partnership with key players like Arbitrum, LayerZero, and WalletConnect substantially supports the new chain. From the Arbitrum Foundation, Nina Rong highlights the importance of fair compensation for creators. She points out that enforcing royalties at the node level advances this goal. Imagine a lighting-fast chain where royalties are always guaranteed, with low and predictable costs, and Ethereum-grade security. Introducing RARI Chain: the chain that always puts creators first👇 pic.twitter.com/EELDilSXrI — RARI Foundation (@rarifoundation) November 30, 2023 However, this is about more than just technology. It’s about reshaping the digital landscape to favor creators. The RARI Chain stands as a testament to the potential of blockchain technology in protecting the interests of digital artists and creators. It marks a significant stride in preventing the disintermediation of creators from the burgeoning growth of Web3. The RARI Foundation’s latest initiative with RARI Chain brings a new era in NFT trading and creator compensation. By embedding royalties into the blockchain nodes, they ensure creators are fairly rewarded. Hence, this development is a technological advancement and a cultural shift towards a more equitable digital economy.",
    "tags": [
      "#Blockchain",
      "#NFT market",
      "#Rarible"
    ],
    "publishDate": "01/12/2023"
  },
  {
    "id": 24,
    "title": "Recent Studies Reveal Personal Experiences as Key Drivers in NFT Market Movements",
    "absoluteURL": "https://www.todaynftnews.com/recent-studies-reveal-personal-experiences-as-key-drivers-in-nft-market-movements/",
    "fullContent": "SNEAK PEEK New research studies offer fresh insights into the NFT market, emphasizing the roles of personal experiences, luck, scarcity, and optimism. Guneet Kaur Nagpal and Luc Renneboog’s study on CryptoPunks reveals Ethereum investors’ tendencies towards higher-cost activities and gains. The research indicates that Ethereum’s market performance influences asset sale decisions more than NFT prices. In a fascinating twist in understanding the nonfungible token (NFT) market, new research studies have revealed that personal experiences, luck, scarcity, and consumer optimism play crucial roles in market dynamics. This insight emerges from a trio of studies conducted by academicians from several prestigious institutions, offering a fresh perspective on the factors influencing the NFT landscape. At the forefront of these studies, researchers Guneet Kaur Nagpal from Western University and Luc Renneboog from Tilburg University explored the market dynamics of CryptoPunks, a leading NFT asset collection. Their study, “On Nonfungible Tokens, Blockchain Hypes, and the Creation of Scarcity,” highlighted that Ethereum (ETH) investors were more inclined to engage in higher-cost market activities and experienced significant gains. Interestingly, the study noted that ETH’s market performance did not directly influence NFT prices but impacted decisions on asset sales. Meanwhile, Chuyi Sun of the University of North Carolina at Chapel Hill delved into how personal experiences shape market behavior in the NFT domain. In the study “Personal Experience Effects across Markets: Evidence from NFT and Cryptocurrency Investing,” Sun analyzed data from approximately one million wallets. The findings revealed that investors receiving more valuable NFTs in initial offerings were likelier to engage in subsequent NFT purchases and gravitate towards speculative cryptocurrencies. Contrastingly, a study from the Rennes School of Business, “The Impact of Experience, Overconfidence and Optimism on Future Cryptocurrency Ownership,” conducted by Akanksha Jalan and Roman Matkovskyy, brought to light an intriguing aspect of investor behavior. Contrary to expectations, negative past experiences and investor optimism positively influenced future engagements in cryptocurrencies and NFTs. This trend suggests a unique resilience among investors, attributing losses to external factors like market volatility rather than personal decision-making. These studies offer a nuanced understanding of the NFT market, moving beyond conventional economic models. They underscore the importance of personal experiences and psychological factors in driving market trends. This research paves the way for a deeper exploration of the human elements behind the burgeoning world of NFTs, suggesting that market movements are as much about individual stories and perceptions as they are about economic indicators. The recent findings challenge traditional market theories, highlighting the complex interplay of personal experiences, luck, scarcity, and optimism in shaping the future of NFTs. This new knowledge enriches our understanding of the NFT market and opens doors for more human-centric approaches to studying digital asset economies.",
    "tags": [
      "#Blockchain",
      "#NFT market"
    ],
    "publishDate": "30/11/2023"
  },
  {
    "id": 25,
    "title": "Bioniq Ushers in a New Era in Bitcoin NFT Trading with ICP Integration",
    "absoluteURL": "https://www.todaynftnews.com/bioniq-ushers-in-a-new-era-in-bitcoin-nft-trading-with-icp-integration/",
    "fullContent": "SNEAK PEEK Bioniq emerges as a key player in cryptocurrency with a Bitcoin NFT marketplace The platform uses Internet Computer Protocol to reduce network congestion and fees. Bioniq offers contract auctions and a cross-chain wallet bridging Bitcoin and ICP. Bioniq has emerged as a pivotal player in the dynamic world of cryptocurrency, launching an innovative Bitcoin nonfungible token (NFT) marketplace. This platform stands out for its strategic use of the Internet Computer Protocol (ICP), significantly reducing the network congestion and high fees often associated with Bitcoin Ordinals inscriptions. Developed in the wake of the creation of Bitcoin Ordinals in early 2023, Bioniq is set to revolutionize the way Bitcoin-based NFTs are traded. Leveraging the ICP’s native Bitcoin integration, Bioniq has crafted a seamless marketplace featuring innovative contract auctions and a comprehensive cross-chain wallet bridging Bitcoin and ICP. Bob Bodily, CEO and co-founder of Bioniq emphasized the platform’s quick response to the immense potential of Ordinals, starting its development as early as February 2023. The platform’s innovation doesn’t stop there. Bioniq introduces an intelligent wallet, enabling users to manage their private keys through Web3Auth. This feature brings the convenience of logging in via standard Web2 Google accounts while retaining noncustodial control over wallets and assets. Furthermore, Bioniq capitalizes on the advantages of partially signed Bitcoin transactions (PSBTs) integrated within the ICP’s Bitcoin network. This integration allows for smart contract capabilities directly on Bitcoin, bypassing the need for centralized cross-chain bridges. Backed by influential names like Polychain Capital, Bioniq takes a unique approach by treating Internet Computers as a Bitcoin layer-2 network. This strategy harnesses the ICP’s efficiencies in time and cost through a token-wrapping process. Users can transfer their Bitcoin and Ordinals assets into Bioniq’s wallet, opting to wrap their assets for safekeeping while generating equivalent NFTs on the ICP network. This process enables trading on the ICP network, free from the usual gas or transaction fees and immune to the Bitcoin network’s speed limitations. Bioniq’s launch addresses the market capitalization growth of BRC-20 tokens and tackles the issue of Bitcoin network congestion. The platform’s unique approach offers a more reliable and efficient trading experience, even in high Bitcoin fee environments. Looking ahead, Bioniq plans to expand its offerings, including a launchpad for new collections, a crypto borrowing feature using Ordinals assets as collateral, and a platform for collection offers targeting specific projects. This holistic approach marks a significant step forward in the crypto marketplace, bringing efficiency and innovation to the forefront.",
    "tags": [
      "#Bitcoin",
      "#NFT market"
    ],
    "publishDate": "30/11/2023"
  },
  {
    "id": 26,
    "title": "Solana’s Mad Lads NFTs Eclipse Bored Ape Yacht Club Sales",
    "absoluteURL": "https://www.todaynftnews.com/solanas-mad-lads-nfts-eclipse-bored-ape-yacht-club-sales/",
    "fullContent": "SNEAK PEEK Mad Lads, a Solana-based NFT, reaches a new floor price of 123 SOL or over $7,100. In November, the collection’s value more than tripled, indicating rapid growth. Mad Lads outperformed other NFTs with over $1.39 million in 24-hour sales. The digital asset space is witnessing a remarkable surge in the value and popularity of Mad Lads, a Solana-based profile picture (PFP) NFT collection. Outperforming many leading NFT projects, Mad Lads has reached new heights in its floor price and sales volume. As noted by Solana Floor data, Mad Lads’ entry price has recently experienced a significant increase. The collection’s floor price now stands at 123 SOL, equating to over $7,100. This marks a substantial rise, with the price more than tripling in November alone. On November 13, Decrypt reported the collection’s floor value at nearly $4,500 worth of SOL, highlighting a robust growth trajectory. Regarding sales, Mad Lads is making waves in the secondary markets. Over the past 24 hours, sales have exceeded $1.39 million, according to CryptoSlam data. This volume surpasses other notable NFT projects, including the Fortune Founder’s Pass from Army of Fortune and the renowned Bored Ape Yacht Club on Ethereum. The latter registered approximately $881,000 in sales, while Solana’s Tensorians followed closely with about $810,000. Several elements contribute to the increasing demand and value of Mad Lads. The Solana token has seen significant appreciation, rising from around $21 to a current value of $58, even touching $65 recently. This price increase has impacted the broader Solana NFT market, with sales topping $62 million in November, a steep rise from October’s $28 million. Mad Lads distinguishes itself with unique attributes. Developed by startup Coral, the collection integrates with the Backpack app and its executable NFTs (xNFTs) standard, providing a range of experiences around tokenized assets. Coral’s upcoming crypto exchange, licensed in Dubai and led by former FTX general counsel Can Sun, has also added to the project’s appeal. Mad Lads NFT holders were given priority access to exchange signups and received PYTH tokens during the recent Pyth Network airdrop on Solana. These factors, combined with the project’s innovative approach and exclusive holder benefits, fuel the increasing demand for Mad Lads NFTs. Mad Lads’ success is not just a triumph for the project itself but also signifies a pivotal moment in the NFT sector, especially for Solana-based projects. Its performance against Ethereum’s Bored Ape Yacht Club, a long-time leader in the NFT market, suggests a shift in investor interest toward Solana’s ecosystem. This shift could lead to increased competition and innovation within the NFT space as projects strive to offer unique benefits and experiences to their communities. As the NFT market continues to evolve, the success of collections like Mad Lads will likely inspire new developments and trends within this dynamic and ever-changing industry.",
    "tags": [
      "#Bored Ape Yacht Club",
      "#NFT market",
      "#Solana"
    ],
    "publishDate": "29/11/2023"
  },
  {
    "id": 27,
    "title": "Bored Ape Yacht Club Member Almost Falls for a Phony Forbes Scheme While Seeking a Banana",
    "absoluteURL": "https://www.todaynftnews.com/bored-ape-yacht-club-member-almost-falls-for-a-phony-forbes-scheme-while-seeking-a-banana/",
    "fullContent": "SNEAK PEEK A Bored Ape Yacht Club member named Crumz narrowly escaped a sophisticated scam disguised as an interview opportunity with Forbes. The scammer impersonated Forbes editor Robert LaFanco and contacted Crumz directly by message. Red flags included a non-premium Zoom account and a request to use a separate screen recording bot. In a recent turn of events, the Bored Ape Yacht Club (BAYC) community has witnessed an alarming scam attempt. A member of this prestigious NFT group, known as Crumz, narrowly escaped a well-orchestrated scheme. The scam, posing as an opportunity for an interview with Forbes, targeted Crumz through a direct message from an impersonator of Robert LaFanco, a real Forbes editor. Crumz faced several red flags during the interview, including the interviewer’s non-premium Zoom account and a request to use a separate recorder bot for screen recording. Despite these signs, Crumz initially complied with the requests. The scammer asked Crumz to fetch a banana, supposedly to add a personal touch related to his BAYC NFT. However, Crumz later realized that this request was a ploy to distract him and gain control of his computer remotely. 🚨🚨SCAM ALERT!!🚨🚨 I just spent the last 2hours on Zoom with \u0027@Forbes\u0027 it was pretty sophisticated and well thought out because I\u0027m usually on high alert but luckily I wasn\u0027t caught. Here\u0027s what they did. 🧵1/8 — Crumz 🇮🇪 (@crumz10) November 26, 2023 Upon refusing to leave his computer, Crumz observed the scammers attempting to take over his screen. He acted quickly to prevent any potential theft of his valuable digital assets. This incident highlights the growing sophistication of scams within the NFT community. Similar scams have been reported, involving fake journalists luring NFT owners into compromising their security for a supposed media feature. This case serves as a warning to the NFT community, particularly high-value asset holders like BAYC members. The incident underscores the importance of vigilance and skepticism when dealing with unsolicited offers, especially those involving access to personal or digital assets. The BAYC community and broader NFT holders are now more aware of these tactics, thanks to the sharing of this experience by Crumz and others who have encountered similar situations. As the NFT market thrives, collectors must stay informed and cautious. This incident not only reflects the vulnerabilities within the digital asset space but also the resilience of its members in the face of evolving cyber threats.",
    "tags": [
      "#Bored Ape Yacht Club",
      "#NFT market"
    ],
    "publishDate": "28/11/2023"
  },
  {
    "id": 28,
    "title": "Pudgy Penguins Unveil Limited Edition Walmart ‘Influencer Package’ for Cyber Monday",
    "absoluteURL": "https://www.todaynftnews.com/pudgy-penguins-unveil-limited-edition-walmart-influencer-package-for-cyber-monday/",
    "fullContent": "SNEAK PEEK Pudgy Penguins, an Ethereum-based NFT giant, is launching an exclusive ‘Influencer Box’ through Walmart on Cyber Monday. Priced at $25 on Walmart.com, this bundle offers significant savings compared to the regular price of individual items. Pudgy Penguins has a strategic partnership with Walmart, distributing their toy line across over 2,000 U.S. stores. Ethereum-based NFT giant Pudgy Penguins marks a distinctive entry into the retail arena this Cyber Monday with an exclusive offering through Walmart. The unique ‘Influencer Box,’ a blend of physical and digital collectibles, demonstrates the brand’s innovative approach in a fluctuating market. It aimed at mainstream consumers; this box includes a variety of engaging items: a 12-inch plush toy, an action figure, a clip-on plush, an igloo toy, and a certificate for a complimentary NFT on the zkSync Era, redeemable on the Pudgy World gaming platform. With a promotional price of $25, exclusively available on Walmart.com, this bundle represents significant savings from its regular combined item value. Each 12-inch plush toy, part of this collection, is usually priced between $20 and $25. Pudgy Penguins’ strategic partnership with Walmart has already seen their toy line distributed across over 2,000 stores in the United States, according to Brittany Smith, Walmart U.S. VP. This collaboration underscores a unique fusion of physical and digital play experiences for children. This Cyber Monday we partnered with @Walmart to release our influencer box bundle, exclusively on their website. Details below. pic.twitter.com/KbOGAcBuws — Pudgy Penguins (@pudgypenguins) November 27, 2023 The Pudgy Penguins collection, initially launched in 2021 amidst the NFT boom, has experienced notable growth and transformation under the leadership of entrepreneur Luca Netz. Acquired for $2.5 million during community unrest, Netz’s stewardship has seen the project’s Instagram following exceed a million, alongside expansion into new product lines. The collection’s impressive value increase highlights this growth trajectory: an all-time high of over $13,000 in ETH, marking a sevenfold rise since Netz’s takeover in April 2022. Despite the broader market downturn since May 2022, Pudgy Penguins stands out as a resilient and growing NFT project in USD value. Their continuous innovation, as seen with the latest Cyber Monday exclusive, showcases their commitment to staying relevant and accessible in a changing digital landscape. This newest offering aligns with their broader strategy of expanding their brand presence and appeal beyond the traditional NFT space, reaching out to a more varied consumer base.",
    "tags": [
      "#NFT market",
      "#Pudgy Penguins NFT"
    ],
    "publishDate": "28/11/2023"
  },
  {
    "id": 29,
    "title": "Azuki DAO Undergoes Rebranding to ‘Bean’, Withdraws Legal Action Against its Founder",
    "absoluteURL": "https://www.todaynftnews.com/azuki-dao-undergoes-rebranding-to-bean-withdraws-legal-action-against-its-founder/",
    "fullContent": "SNEAK PEEK Azuki DAO rebrands to “Bean,” marking a significant shift in strategy. The DAO drops a lawsuit against NFT collection founder Zagabond. Bean transitions to a memecoin project within Ethereum’s Blast ecosystem. In a significant shift, Azuki DAO, the decentralized autonomous organization associated with the Azuki nonfungible token (NFT) series, has announced a rebranding to “Bean.” This change comes alongside the decision to drop a previously proposed lawsuit against the NFT collection’s founder, Zagabond. The legal action concerned a contentious $39 million NFT minting event in June, initially stirring up substantial debate within the community. Moreover, the rebranding marks a strategic pivot for the DAO. Bean will transition into a memecoin project as part of its new direction, integrating into the Ethereum layer-2 Blast ecosystem. This move will enhance the project’s presence and capabilities within the digital asset space. Developers have revealed that Bean has already garnered significant support, securing $10 million in funding from notable investors. This financial backing aims to accelerate the project’s growth and development within the Blast ecosystem. The proposed Bean memecoin will have a total supply of 1 billion tokens, indicating the project’s ambitions for widespread adoption and utility. Additionally, there have been updates regarding the token distribution plan. Initially, as outlined on the DAO’s website, the plan detailed a 40% allocation of tokens to the treasury, 50% to Azuki DAO members, and 10% to Zagabond, the Azuki NFT creator. It also stated that minting would be exclusively available to Azuki NFT holders, with a 24-hour window for action, after which any unclaimed tokens would be subject to burn. However, recent clarifications indicate changes in the distribution strategy. The follow-up statement from the developers specified that “50% of the $Bean [token] was allocated to the Azuki DAO community for the airdrop of Azuki series NFTs,” a process concluded four months ago. The statement also confirmed that “40% of $Bean [token] was allocated to the Bean Treasury, and 10% of $Bean was allocated to Zagabond.” Godspeed @cz_binance pic.twitter.com/jIaCj43sx8 — ZAGABOND.ETH (@ZAGABOND) November 21, 2023 This rebranding and strategic shift signify a new chapter for the former Azuki DAO, now Bean. By dropping the lawsuit and embarking on a fresh path with a memecoin project, the organization is set to explore new horizons in the blockchain and NFT sphere. The move reflects decentralized organizations’ dynamic and evolving nature and the digital asset industry.",
    "tags": [
      "#Azuki NFT",
      "#NFT market"
    ],
    "publishDate": "27/11/2023"
  },
  {
    "id": 30,
    "title": "Square Enix Reveals Auction Schedule for Symbiogenesis Non-Fungible Tokens",
    "absoluteURL": "https://www.todaynftnews.com/square-enix-reveals-auction-schedule-for-symbiogenesis-non-fungible-tokens/",
    "fullContent": "SNEAK PEEK Square Enix, known for the Final Fantasy series, is venturing into the NFT space with its blockchain game Symbiogenesis. The game combines narrative-driven gameplay with Ethereum-based NFTs, marking a new direction for the company in blockchain technology. Symbiogenesis auctions are divided into three phases, starting with an exclusive event for early backers on Nov 27 and 28. Square Enix, the renowned developer behind the Final Fantasy series, has recently unveiled its latest venture into the world of nonfungible tokens (NFTs) by announcing auction dates for its upcoming blockchain game, Symbiogenesis. Set to revolutionize the gaming and digital collectible experience, Symbiogenesis introduces a unique blend of narrative-driven gameplay and Ethereum-based NFTs. This innovative approach marks a significant stride in Square Enix’s exploration of blockchain technology following their successful introduction of Final Fantasy NFT trading cards earlier this year. 来週より、いよいよオークションが開催！ フェーズ1：11/27 12:00～11/28 11:59 フェーズ2：11/30 12:00～12/1 11:59 フェーズ3：12/2 12:00～12/3 11:59 詳しくはこちらhttps://t.co/MFprrAq47W#SYMBIOGENESIS — SYMBIOGENESIS -NFT Art＆Game Project- | SQUARE ENIX (@symbiogenesisPR) November 24, 2023 The auctions for Symbiogenesis NFTs are scheduled in three distinct phases, each offering a different array of digital collectibles. The first phase, slated for Nov 27 to 28, is an exclusive event targeting early backers, termed “stakeholders.” This phase will feature a selection of facet and mesh characters intricately designed to capture the essence of the Symbiogenesis universe. This exclusive access underscores the company’s appreciation for early investors’ support. Following this, the second auction phase, from Nov 30 to Dec 4, and the third phase, from Dec 2 to 3, will open doors to a broader audience. Eligibility for these phases was determined through an allowlist entry campaign, which Square Enix conducted from Nov 7 to 21. This campaign was an engaging blend of quizzes and a treasure hunt within a prototype of the game world, adding an interactive element to the qualification process. Top performers in the campaign, specifically the 50 highest scorers, along with 40 randomly chosen participants from the 51st to 300th rank, earned the privilege to acquire NFTs in the second phase. The remaining participants can bid in the third phase, ensuring an inclusive participation spectrum. Symbiogenesis, described as a “narrative-unlocked NFT entertainment” game, is more than a digital collectible platform. It promises an immersive story-driven experience intertwined with the ownership and trade of unique NFTs. The scheduled launch date for this ambitious project is Dec 21, a day anticipated by gaming and crypto enthusiasts alike. Square Enix’s move into blockchain gaming reflects the company’s adaptability and innovative spirit in the ever-evolving digital entertainment landscape. With a legacy of over 173 million units sold in the Final Fantasy series alone, Square Enix’s foray into NFTs with Symbiogenesis is not just an expansion of their digital offerings but a testament to their commitment to staying at the forefront of gaming technology. As the gaming world eagerly awaits the arrival of Symbiogenesis, it stands as a beacon of the exciting possibilities that blockchain technology brings to interactive storytelling and digital ownership.",
    "tags": [
      "#Gaming",
      "#NFT market"
    ],
    "publishDate": "25/11/2023"
  },
  {
    "id": 31,
    "title": "Yuga Labs unveils CryptoPunks721 wrapper to simplify NFT trading Yuga Labs unveils CryptoPunks721 wrapper to simplify NFT trading",
    "absoluteURL": "https://crypto.news/yuga-labs-unveils-cryptopunks721-wrapper-to-simplify-nft-trading/",
    "fullContent": "Bored Ape developer Yuga Labs has rolled out a new wrapper for the CryptoPunks collection to ease trades on marketplaces. According to an X thread by Yuga Labs‘ smart contract developer, @0xQuit, the newly introduced CryptoPunks721 wrapper operates on a permissionless basis and utilizes Larva Labs‘ PunksData smart contract for on-chain metadata. The primary objective behind developing the new wrapper is to streamline the trading of NFTs from the CryptoPunks collection, originally minted in 2017, predating the widespread acceptance of the ERC-721 standard in January 2018. Last week, Yuga finalized a series of interconnected contracts that unlock new possibilities across our projects. They\u0027ll start simple, but they\u0027re designed to allow evolution over time. Introducing: Your Stash. 1/🧵 pic.twitter.com/lI5L0eapZQ — quit (👀,🦄) (@0xQuit) December 20, 2023 As noted by @0xQuit, the original NFTs from the CryptoPunks collection necessitate wrapping before being eligible for sale on key marketplaces. Wrapping involves creating a cloned token with equivalent value, while a custodian securely holds the original token. This process involves multiple transactions, resulting in high operational costs. You might also like: CryptoPunks drive NFT surge with $1.1m sale The introduction of the CryptoPunks721 wrapper aims to address these limitations by enabling both wrapping and unwrapping of C721 tokens in a single transaction, consequently reducing gas fees. Launched in 2017 by Matt Hall and John Watkinson of Larva Labs, CryptoPunks is a collection of 10,000 algorithmically generated pixel art characters in the form of NFTs on the Ethereum blockchain. Each CryptoPunk is distinct and has its own set of features, contributing to its rarity. In March 2022, Yuga Labs, the company behind the Bored Ape Yacht Club (BAYC) NFT collection, acquired the NFT series of CryptoPunks and Meebits. The financial terms of the deal were not disclosed. Read more: What’s the story behind Bored Ape Yacht Club creator Yuga Labs Follow Us on Google News",
    "tags": [
      "#CryptoPunks",
      "#Larva Labs",
      "#NFT",
      "#Yuga Labs"
    ],
    "publishDate": "21/12/2023"
  },
  {
    "id": 32,
    "title": "Epic Games Store welcomes blockchain games despite ‘adults only’ ratings Epic Games Store welcomes blockchain games despite ‘adults only’ ratings",
    "absoluteURL": "https://crypto.news/epic-games-store-welcomes-blockchain-games-despite-adults-only-ratings/",
    "fullContent": "Epic Games, known for Fortnite, breaks its ban on ‘adults only’ games, allowing blockchain titles with AO ratings by the ESRB. The Epic Games Store, a digital distribution platform operated by Epic Games, the creator of popular video games like Fortnite and Unreal Tournament, has decided to welcome back blockchain-powered video games that were previously classified as “Adults Only” (AO) by the Entertainment Software Rating Board (ESRB), according to the firm’s latest updates. The move marks a departure from the platform’s strict prohibition on AO-rated games, typically associated with excessive nudity or violence. You might also like: CoinGecko: 75% of web3 games over last five years have failed The marketplace’s content guidelines page now says that the Epic Games Store makes an “exception for products in cases where an AO rating was applied solely due to the usage of blockchain or NFT technology.” In a commentary to The Verge, a spokesperson for Epic Games confirmed the move, saying that some blockchain-based video games received AO ratings only due to their particular implementation of blockchain. 📣 Heads up: Gods Unchained and Striker Manager 3 have returned to the Store after a change in our content policy regarding ratings for blockchain-based games. Learn more: https://t.co/RQGGzWGeG8 — Epic Games Store (@EpicGames) December 19, 2023 With the latest update, the Epic Games Store returned some of the games like Gods Unchained and Striker Manager 3, which were previously removed due to their ratings. The ESRB’s AO rating is recognized as the strictest, prompting some stores to abstain from selling these games entirely. In contrast to platforms like Steam and Itch.io, which allow AO games with the option for users to filter them, Steam does not embrace blockchain games. According to blockchain developers, Steam’s point of view is that “items have value and they [Steam developers] don’t allow items that can have real-world value on their platform.” Read more: How to make money playing crypto games Follow Us on Google News",
    "tags": [
      "#Blockchain",
      "#Epic Games",
      "#Gods Unchained",
      "#NFT",
      "#Steam"
    ],
    "publishDate": "20/12/2023"
  },
  {
    "id": 33,
    "title": "FIFA’s NFTs find instant trading frenzy FIFA’s NFTs find instant trading frenzy",
    "absoluteURL": "https://crypto.news/fifas-nfts-find-instant-trading-frenzy/",
    "fullContent": "The inaugural NFT drop from FIFA+ Collect Club sold out just three hours after release, according to an announcement shared with crypto.news. The FIFA+ Collect Club, a collaboration between FIFA and technology firm Modex, made digital collectible “membership cards” available on Dec. 12 priced at $999 each. According to Modex, the full allotment of membership cards was purchased within three hours. In a press release, Modex indicated that as part of the membership program, holders of the sold-out VIP cards will receive what was described as an airdrop on Dec. 26 containing highlights from the FIFA Club World Cup 2023 hosted in Saudi Arabia next year. The statement claims two highlights will come with tickets to the FIFA World Cup 2026 final and FIFA Club World Cup 2025 final, both to be held in the United States. You might also like: NFT sales decline, Solana surpasses Ethereum’s volume Building on the rapid sellout, Modex has revealed plans to launch a second set of non-fungible tokens (NFTs) on the OpenSea marketplace and Polygon (MATIC) network on Dec. 19. A total of 900 non-fungible tokens will be released, representing VIP experiences and physical items from the 2023 FIFA Club World Cup according to the press release. Details of exact items or “benefits” associated with each NFT will only be available during purchase. Among the offerings mentioned are tickets to prestigious FIFA ceremonies and events, autographed memorabilia from the tournament, and limited-edition collectibles like player-signed corner flags and referee kits. The FIFA initiative closely resembles the National Basketball Association’s NBA Top Shot NFT series, which were found to possibly be securities back in February. Read more: Flooring Protocol allegedly hacked for NFTs worth $1.5m Follow Us on Google News",
    "tags": [
      "#FIFA",
      "#NFT",
      "#Sports"
    ],
    "publishDate": "19/12/2023"
  },
  {
    "id": 34,
    "title": "Hong Kong mobile network provider launches NFT marketplace Hong Kong mobile network provider launches NFT marketplace",
    "absoluteURL": "https://crypto.news/hong-kong-mobile-network-provider-launches-nft-marketplace/",
    "fullContent": "China Mobile Hong Kong, a leading mobile communication brand in Hong Kong, is launching its own NFT marketplace, LinkNFT. It will be Hong Kong’s first telecom-operated NFT marketplace. This launch coincides with the breakthrough of their comprehensive smart living mobile application, MyLink, which has acquired over seven million users. LinkNFT will offer NFT minting services for businesses, facilitating digital asset creation, trade, and circulation through various scenarios such as SocialFi, DeFi, and GameFi. It will use a trio of cross-chain standards – web3 Center cross-chain service protocol, cross-chain adapter, and cross-chain smart contract – for seamless web3 interoperability. Hong Kong residents can easily access their digital assets, including Ethereum-based ones like Opensea, through MyLink’s exclusive digital wallet “LinKey.” You might also like: SEC is taking ‘new look’ at spot Bitcoin ETF applications China Mobile Hong Kong (CMHK) has collaborated with various sectors to release over 30 NFTs on LinkNFT, including 20 commemorative editions from the MyLink ArLink series and 15 NFTs associated with publishers and music platforms like Migu Music. The total number of NFT issuance is expected to exceed 500,000. MyLink’s Metaverse digital space has also been upgraded to a comprehensive 3D immersive experience, allowing Hong Kong citizens to create their digital homes and explore a virtual Hong Kong city with various facilities like shopping malls and exhibition halls. This upgrade enables citizens to convert their Meta IDs into NFTs, fostering a unique digital community within the web3 ecosystem. Mr. Tan Hui, Executive Director of MyLink, says the new venture will allow enterprises to offer novel consumer rights through various NFTs while users enjoy collectible and circulation value. Read more: Hong Kong mulls green bond sale using blockchain Follow Us on Google News",
    "tags": [
      "#China",
      "#Hong Kong",
      "#NFT"
    ],
    "publishDate": "16/12/2023"
  },
  {
    "id": 35,
    "title": "Trump releases new mug shot NFT as former President’s ongoing legal issues mount Trump releases new mug shot NFT as former President’s ongoing legal issues mount",
    "absoluteURL": "https://crypto.news/trump-releases-new-mug-shot-nft-as-former-presidents-ongoing-legal-issues-mount/",
    "fullContent": "Former President of the Donald Trump has unveiled a new NFT collection called the ‘Mugshot Edition,’ a play on the recent legal woes mounting against the leading Republican candidate. A new NFT collection by former President Donald Trump is taking the internet by storm. On Dec. 12, 2023, Trump took to Truth Social to announce the drop of new NFT featuring an infamous mug shot taken of the former President after he was booked in an Atlanta-area jail last August on charges of conspiring to overthrow Georgia’s election results. With reactions to the NFT going viral on X, crypto.news has compiled some of the best reactions to the former President’s latest foray into NFTs, which features 2,024 unique pieces of the suit he wore to get his mugshot taken in Georgia, available to buyers who purchase 47 NFTs priced at $99 each. “It was a great suit, believe me, a really good suit. It’s all cut up, and you’re gonna get a piece of it,” Trump said in a video on Truth Social. You might also like: Donald Trump is accused of using copyrighted images for his NFTs Many in cryptocurrency community greeted the news of the release with a mix of enthusiasm and skepticism. trump launching a THIRD nft collection pic.twitter.com/wCRPTyXcGl — 0xngmi (@0xngmi) December 12, 2023 Others said they were aping in. dropped 10 bands on the Trump NFT\u0027s see y\u0027all at Mar-a-lago 😎🫡 pic.twitter.com/Q1LV7arZXx — gorl (@Starcaster1) December 13, 2023 It is not the first NFT collection from the former U.S. President has dropped. In August, blockchain intelligence platform Arkham Intelligence discovered a crypto wallet linked to Trump, noting that the wallet then had a balance of $2,821,575, by current market valuations, the wallet appears to be in the green more than five fold. In August 2023, Trump reported investing between $250,000 and $500,000 in various cryptocurrencies. You might also like: Melania Trump releases NFT collection for foster children Follow Us on Google News",
    "tags": [
      "#Donald Trump",
      "#NFT"
    ],
    "publishDate": "13/12/2023"
  },
  {
    "id": 36,
    "title": "Ethereum gets the boot as Enjin migrates 200m NFTs to its own blockchain Ethereum gets the boot as Enjin migrates 200m NFTs to its own blockchain",
    "absoluteURL": "https://crypto.news/ethereum-gets-the-boot-as-enjin-migrates-200m-nfts-to-its-own-blockchain/",
    "fullContent": "Blockchain developer Enjin has transferred 200 million non-fungible tokens (NFTs) to its own blockchain in an effort to boost up the usage of its network. In a blog post on Dec. 11, 2023, the Singapore-based company said NFT holders can now claim their assets on the Enjin Blockchain using the updated version of the Enjin crypto wallet. As part of the migration campaign, users are also free of any transactional costs across the ecosystem for the next three months, the announcement says. You might also like: OpenSea on back-footing as OKX surpasses it in NFT trading volume Oscar Franklin Tan, Atlas chief financial officer, said this was one of the “most complex, unprecedented blockchain migrations,” as it involved migration of both fungible and non-fungible tokens from Ethereum, Polkadot and Enjin Blockchain. “Enjin’s NFT migration follows and completes its token migration. Strong support from migrating holders secures the new Enjin Blockchain and expands governance.” Oscar Franklin Tan The Enjin team emphasized the migration included assets from thousands of digital creators, including tech giant Microsoft. According to a previous report, Enjin transferred 118 million NFTs hosted on Ethereum, as well as over 100 million NFTs on JumpNet, a sidechain for Ethereum have been transferred to its mainnet called the Enjin Blockchain. Enjin Blockchain is a public, decentralized blockchain, which was developed by the Enjin team for creators looking for a cheaper way to host their NFTs on a distributed ledger. The network also has its own native token called Enjin Coin (ENJ), which is currently trading at $0.33, according to CoinGecko data. Read more: Enjin token soars amid new NFT marketplace expectations Follow Us on Google News",
    "tags": [
      "#Blockchain",
      "#Enjin",
      "#NFT"
    ],
    "publishDate": "12/12/2023"
  },
  {
    "id": 37,
    "title": "OpenSea on back-footing as OKX surpasses it in NFT trading volume OpenSea on back-footing as OKX surpasses it in NFT trading volume",
    "absoluteURL": "https://crypto.news/opensea-on-back-footing-as-okx-surpasses-it-in-nft-trading-volume/",
    "fullContent": "According to data from DappRadar, OKX NFT marketplace secured 32% dominance in the NFT sector, surpassing OpenSea in trading volume. In a blog post on Dec. 7, 202, DappRadar gathered top marketplaces for trading digital collectibles, which allocated the most liquidity in November 2023. According to the data, the Blur marketplace was ranked the top platform, controlling a 35% share of the NFT trading volume and generating $345 million in trades in November 2023. Top NFT trading platforms by volume | Source: DappRadar OKX NFT, a digital marketplace powered by the OKX crypto exchange, appeared to be the second-largest NFT platform over the past month, surpassing OpenSea in trading volume. As per DappRadar, OKX NFT secured a “substantial 32% dominance in the NFT sector,” overtaking OpenSea, which is currently holding a 10% market share in terms of trading volume. Yet, DappRadar Blockchain Analyst Sara Gherghelas notes that OpenSea remains the top platform in terms of user base with over 190,000 registered accounts as of November 2023. She also suggested OKX succeeded in its efforts thanks to its bet on unique offerings of Bitcoin Ordinals art pieces. You might also like: Binance lists ORDI, confuses it with Bitcoin Ordinals project However, it is yet to be seen if OKX could retain its title given that Bitcoin Core developers are planning to get rid of Inscriptions, essentially putting an end to Bitcoin Ordinals and BRC-20 tokens. As crypto.news reported, Bitcoin Core developer Luke Dashjr hopes to put an end to BRC-20 tokens and Bitcoin-based NFTs with a set of upgrades as these products appear to be spamming the network, leading to an excessive amount of data being stored on the blockchain. Bitcoin Ordinals are non-fungible tokens that enable the inscribing of data onto a satoshi, the smallest division of a Bitcoin. Since its launch in January 2023, the protocol has seen the inscription trend take off, leading to thousands being minted on the Bitcoin network. This has caused congestion and spikes in transaction fees, reaching a peak in April and May 2023. Read more: VC giant Tiger Global reportedly cut stakes in OpenSea and NFT collection BAYC Follow Us on Google News",
    "tags": [
      "#Bitcoin",
      "#Blur",
      "#NFT",
      "#OKX",
      "#OpenSea",
      "#Ordinals"
    ],
    "publishDate": "08/12/2023"
  },
  {
    "id": 38,
    "title": "Reebok taps Futureverse to expand web3 experience with AI Reebok taps Futureverse to expand web3 experience with AI",
    "absoluteURL": "https://crypto.news/reebok-taps-futureverse-to-expand-web3-experience-with-ai/",
    "fullContent": "American fitness brand Reebok has entered into a collaboration with web3 startup Futureverse. As per an X thread published by Futureverse on Dec. 7, 2023, Reebok is set to dive deep into the web3 with its new initiative dubbed “Reebok Impact.” While the details of the collaboration were not disclosed, Futureverse says the Reebok-focused venture will debut in 2024, featuring a “heart-bending digital shoe experience that will allow mass consumers to dive into artificial intelligence and digital wearables.” Thrilled to announce our exclusive partnership with @Reebok to leverage our AI and metaverse technology to revolutionize digital fashion. Together, we introduce @ReebokImpact. Coming 2024. pic.twitter.com/30Qk02aujk — Futureverse (@futureverse) December 7, 2023 You might also like: Adidas announces collaboration with NFT artist Fewocious In a commentary to WWD, Daniel W. Dienst, Executive Vice Chairman of Tactical Opportunities at Authentic Brands Group, Reebok’s parent company, said that with the new product, the both companies want to “redefine the intersection of fashion, technology and culture,” adding it will be a “pivotal moment in Reebok’s brand evolution.” Reebok CEO Todd Krinsky added that the partnership with Futureverse enables the firm to “transcend traditional boundaries of innovation to engage our consumers in the digital evolution of our products in ways that redefine the realm of possibility.” Although the announcement is marked as the first step in Reebok and Futureverse’s long-term partnership, it’s not the first efforts made by the Boston-headquartered fitness brand into the web3 space. In December 2021, Reebok collaborated with American rapper A$AP NAST to mint limited-edition non-fungible tokens (NFTs) on the RFOX marketplace. Read more: Reebok joins the Metaverse bandwagon after Nike and Adidas Follow Us on Google News",
    "tags": [
      "#NFT",
      "#Reebok",
      "#Web3"
    ],
    "publishDate": "08/12/2023"
  },
  {
    "id": 39,
    "title": "Heavy metal band Megadeth launches generative NFT collection Heavy metal band Megadeth launches generative NFT collection",
    "absoluteURL": "https://crypto.news/heavy-metal-band-megadeth-launches-generative-nft-collection/",
    "fullContent": "Heavy metal band Megadeth took to X on Dec. 5 to announce the introduction of its 5,000-piece generative collection featuring the band’s mascot, Vic Rattlehead. This initiative transforms beyond a traditional fan club, emerging as a community owned by the fans. Introducing @MegadethDigital. Our 5000-piece generative collection featuring Vic Rattlehead brought to life in a new way by our talented artist @TheHaddy. Live on December 22nd, you\u0027ll have the opportunity to unlock doors in the real and metaverse world alike, gaining access to… pic.twitter.com/Ed9YxqCTe6 — Megadeth (@Megadeth) December 5, 2023 As part of the announcement, the band shares that the collection, MegadethDigital, brought to life by artist TheHaddy, is set to go live on Dec. 22. The collection will offer participants access to exclusive merchandise and VIP experiences, including opportunities to acquire signed items and engage in one-on-one conversations with the band members. You might also like: Megadeth Debuts on Web3 With Its “Rattleheads” NFT Collection The band is hardly the first to the NFT game where metal bands are concerned. Avenged Sevenfold was also reported to share support for the digital asset class in May of this year. A resurgence of NFTs The timing of the release may also be suitable for another reason, coinciding with a recent research report by Binance that highlighted the NFT market witnessed a notable upswing in November, signaling a reversal from its year-long decline, achieving a sales volume of $0.91 billion. This surge indicates a remarkable 200% month-over-month increase, marking the highest growth in 2023. Read more: Binance Research: NFTs witnessed turnaround in November, reversing year long downward trend Follow Us on Google News",
    "tags": [
      "#Binance",
      "#Megadeth",
      "#NFT"
    ],
    "publishDate": "06/12/2023"
  },
  {
    "id": 40,
    "title": "Binance Research: NFTs witnessed turnaround in November, reversing year long downward trend Binance Research: NFTs witnessed turnaround in November, reversing year long downward trend",
    "absoluteURL": "https://crypto.news/binance-research-nfts-witnessed-turnaround-in-november-reversing-year-long-downward-trend/",
    "fullContent": "A new research report from Binance highlights that the NFT market experienced an upswing in November, marking a turnaround from its year-long downturn with a sales volume of $0.91 billion. These numbers highlight a 200% month-over-month increase, the most substantial growth seen in 2023 so far. Bitcoin NFTs dominate The research report shared with crypto.news on Dec. 4 points to indicators of this recovery, including Nansen’s NFT-500 Index and the Blue Chip 10 Index, showing reduced year-to-date declines at 49% and 43%, respectively, showcasing improvement from the previous month’s 58% and 50%. Binance also attributes the resurgence in NFT sales to the prominence of Bitcoin NFTs. The $SATS collection, featuring individual satoshis with unique identifiers, is among the standouts with 1,039% month-over-month growth in sales volume, surging to $93 million. You might also like: Vitalik Buterin NFT collection triggers surge in Ethereum gas fees This figure is said to outshine the sales volumes of other prominent NFT collections, including Bored Ape Yacht Club at $42 million and CryptoPunks at $29 million. A larger upward trajectory The report, which looks at several industry trends, also states that November witnessed a sustained upward trajectory in the crypto market, marked by an 11% month-on-month surge in total market capitalization. Additionally, the defi sector continued its expansion, maintaining the positive trend observed in October, and recorded a noteworthy 10% month-on-month increase in Total Value Locked (TVL) during November. In contrast to the beginning of the year, these numbers show that investor sentiment is likely to take a turn for the better. Read more: NFTs will remain a permanent fixture in society | Opinion Follow Us on Google News",
    "tags": [
      "#Binance Research",
      "#DeFi",
      "#NFT"
    ],
    "publishDate": "04/12/2023"
  },
  {
    "id": 41,
    "title": "VC giant Tiger Global reportedly cut stakes in OpenSea and NFT collection BAYC VC giant Tiger Global reportedly cut stakes in OpenSea and NFT collection BAYC",
    "absoluteURL": "https://crypto.news/vc-giant-tiger-global-reportedly-cut-stakes-in-opensea-and-nft-collection-bayc/",
    "fullContent": "Investment firm Tiger Global is said to have marked down the value of its stakes in Bored Ape Yacht Club and OpenSea. According to a report from Bloomberg, the New York-headquartered investment firm has slashed its stakes in Bored Ape Yacht Club (BAYC) and marketplace for digital collectibles OpenSea by 69% and 94% respectively. While the reason for the move was not clear, it was not the only reduction made by Tiger Global. As per the report, the VC firm also slashed its stake in an AI-powered email company Superhuman by 45% and cut its valuation for search engine website DuckDuckGo by 72%, according to people familiar with the matter. You might also like: Magic Eden releases cross-chain NFT and crypto wallet Bloomberg claims investors in Tiger Global’s Private Investment Partners 15 fund suffered an 18% paper loss at the end of September, suggesting the latest move was made in a bid to contain risks of further decline. As of press time, Tiger Global made no public statements on the matter. This is the second firm that has slashed its stakes in OpenSea this quarter as the whole market of non-fungible tokens remains tepid. In early November 2023, crypto.news reported that Coatue Management, a U.S.-based tech investment firm, also reduced the valuation of its investment in the NFT marketplace by 90%. According to multiple reports, Coatue slashed its stake from an initial $120 million to a mere $13 million. The BAYC collection is also facing hurdles as the current price floor of a digital monkey is staying at 28.6 ETH, a 77% decline from its all-time high in May 2022, according to data from NFT Price Floor. Read more: OpenSea users targeted in phishing scam disguised as official NFT offers Follow Us on Google News",
    "tags": [
      "#Bored Ape Yacht Club",
      "#NFT",
      "#OpenSea"
    ],
    "publishDate": "01/12/2023"
  },
  {
    "id": 42,
    "title": "Magic Eden releases cross-chain NFT and crypto wallet Magic Eden releases cross-chain NFT and crypto wallet",
    "absoluteURL": "https://crypto.news/magic-eden-releases-cross-chain-nft-and-crypto-wallet/",
    "fullContent": "Magic Eden has announced the launch of a multi-chain compatible crypto wallet browser extension, aiming to simplify user interaction across different blockchains. Magic Eden, a leading player in the NFT marketplace, is taking a significant step towards a more integrated and user-friendly crypto experience with its upcoming crypto wallet browser extension. This development, as announced by CEO and co-founder Jack Lu, is designed to support a multi-chain world for NFTs, addressing the current fragmentation and complexity in managing digital assets across different blockchains. Introducing Magic Eden Wallet, a wallet made for Magic Eden users and cross-chain collectors. Beta version is now live and only available to a small group of early testers! Want to give it a try? You can get on the waiting list by downloading the extension and entering your… pic.twitter.com/5DsS5qhdlQ — Magic Eden 🪄 (@MagicEden) November 27, 2023 Currently, users engaging with multiple blockchains face the inconvenience of using several wallets, creating a disjointed experience. Magic Eden’s solution, beginning with a Google Chrome extension and with plans for Safari and a mobile app that could be available by next year, aims to streamline this process. The wallet will support Bitcoin, Ethereum, Solana and Polygon, the four blockchains currently integrated with Magic Eden’s NFT marketplace. A notable aspect of this wallet is its self-custody feature, requiring users to manage their seed phrases independently. This choice aligns with the ethos of web3, emphasizing decentralized ownership and control. While this approach resonates with the principles of crypto and NFTs, it does raise questions about user convenience and accessibility, particularly for those less familiar with such security measures. You might also like: Magic Eden welcomes BRC-20 tokens to its multi-chain platform Lu’s awareness of the challenges in the current crypto wallet landscape, including the conflicts arising from multiple browser extensions, indicates a thoughtful approach to design. The collaboration with Exodus aims to mitigate such issues. Additionally, the integration of cross-chain swaps, the ability to purchase crypto with fiat currency via MoonPay and NFT-focused features, such as cross-chain portfolio tracking and Bitcoin Ordinals support, are significant advancements. While the wallet’s self-custodial nature may be seen as a barrier to some, Lu hints at the possibility of integrating more user-friendly features like email login in the future, suggesting a balance between security and ease of use. Read more: Yuga Labs, Magic Eden unveil Ethereum NFT marketplace Follow Us on Google News",
    "tags": [
      "#Magic Eden",
      "#NFT",
      "#wallet"
    ],
    "publishDate": "28/11/2023"
  },
  {
    "id": 43,
    "title": "Web3 edu-tech startup Open Campus raises $3.15m from Binance, EDU jumps 6% Web3 edu-tech startup Open Campus raises $3.15m from Binance, EDU jumps 6%",
    "absoluteURL": "https://crypto.news/web3-edu-tech-startup-open-campus-raises-3-15m-from-binance-edu-jumps-6/",
    "fullContent": "Crypto educational startup Open Campus has raised over $3 million from Binance Labs to double down on NFTs. Open Campus (EDU), a cryptocurrency-focused educational startup, has raised $3.15 million from Binance‘s venture arm Binance Labs. According to an announcement on Monday, Nov. 27, 2023, the funding is expected to help the startup onboard new users onto Web3 and “attract more native users to participate in education through the launch of novel Publisher NFTs.” After the news broke, the project’s native token jumped by more than 6%, reaching in a moment $0.65, according to CoinGecko. EDU price | Source: CoinGecko You might also like: New Binance CEO says company fundamentals remain strong despite $4.3b DoJ fine Yat Siu, who’s the co-founder of Animoca Brands and a council member of Open Campus, said the investment is in line with Open Campus’ mission to “decentralize education and find innovative ways to support educators.” “Digital property rights are coming to education, and that’s why we’re thrilled to have the involvement and support of Binance Labs, which we believe will boost our efforts to onboard educators and content creators worldwide to create and tokenize content via our protocol.” Yat Siu From its inception, Open Campus was supported by the exchange as early as April 2023, when the project first appeared on Binance Launchpad, a crowdfunding platform offered to the exchange’s users. According to the token sale description page, a total of more than 9 million Binance Coin (BNB) (currently worth of $2 billion) was committed for Open Campus from 120,000 users on Binance. Read more: DOJ doc details length of Binance founder Changpeng Zhao’s possible prison sentence Follow Us on Google News",
    "tags": [
      "#Binance",
      "#NFT",
      "#Startup"
    ],
    "publishDate": "27/11/2023"
  },
  {
    "id": 44,
    "title": "Billionaire Mark Cuban eyes blockchain use for real-estate innovation Billionaire Mark Cuban eyes blockchain use for real-estate innovation",
    "absoluteURL": "https://crypto.news/billionaire-mark-cuban-eyes-blockchain-use-for-real-estate-innovation/",
    "fullContent": "Tech entrepreneur and billionaire Mark Cuban expressed interest in a transformative crypto real estate project to integrate smart contracts and non-fungible tokens (NFTs) to facilitate construction and urban development. This development follows a proposal by Jason Calacanis, a serial entrepreneur, to build ten new cities across the US, each housing a million units. These cities are envisioned to redefine urban living with an emphasis on sustainability and affordability. Cuban’s vision for crypto-driven real estate Cuban took the conversation a step further. The billionaire investor’s proposal involves utilizing a blockchain-based smart contract that operates on a layer-2 scaling solution to ensure privacy and efficiency. So you are saying you will have written a smart contract on a ZK L2 which will check for a construction permit being issued , which in turn will create and send me an NFT that unlocks and delivers 250k in USDC when the oracle checks property and utility records and… https://t.co/KxmZ4RdlTH — Mark Cuban (@mcuban) November 26, 2023 According to Cuban, the smart contract is programmed to verify construction permits autonomously using an oracle, a mechanism that feeds external data into the blockchain. Upon successful verification of a permit, the contract then produces an NFT. This NFT represents a developer’s entitlement to receive $250,000 in USDC, a stablecoin, as detailed by Cuban. Cuban also proposes the use of a multi-signature wallet to enhance security and provide mutual protection for the parties involved in the transactions. You might also like: Deutsche-backed Taurus targets tokenized real estate market with Dubai office However, some have raised questions about the necessity of using a ZK-rollup, a complex blockchain solution, for this purpose. In response, Cuban highlighted the simplicity and security advantages of using a multi-signature wallet for managing project funds. Calacanis, on the other hand, recommended the adoption of a more conventional, trust-dependent approach for transferring funds. Cuban’s interest in this innovative blend of cryptocurrency and real-estate mirrors his broader advocacy for the practical and beneficial applications of cryptocurrency beyond mere investment opportunities. In an Oct. 2023 interview, he expressed concerns about the perception of cryptocurrencies, noting, “[m]any associate crypto primarily with speculation. However, that’s not the true essence of what cryptocurrencies represent.” “Crypto is really about creating new applications that make things better and easier. What crypto is missing is that one application that grandma really wants to use.” Mark Cuban Despite his passion for the industry, Cuban has encountered hurdles in his cryptocurrency endeavors. In Sept. 2023, he experienced a significant setback when he fell victim to a cryptocurrency scam, resulting in a loss of nearly $870,000. Cuban was taken by surprise, only becoming aware of the scam after noticing the absence of 5 Ethereum from his wallet, which was worth approximately $8,175 at that time. Read more: Elon Musk and Mark Cuban spoke out against SEC Follow Us on Google News",
    "tags": [
      "#Mark Cuban",
      "#NFT"
    ],
    "publishDate": "27/11/2023"
  },
  {
    "id": 45,
    "title": "Fraudster disguised as Forbes journalist targets BAYC holders Fraudster disguised as Forbes journalist targets BAYC holders",
    "absoluteURL": "https://crypto.news/fraudster-disguised-as-forbes-journalist-targets-bayc-holders/",
    "fullContent": "An attacker pretended to be a Forbes journalist during an interview and tried to steal non-fungible tokens (NFTs) from Bored Ape Yacht Club (BAYC) collectors. The attacker, posing as a Forbes journalist, approached the holder with a request to share his experience with the popular NFT collection BAYC. One of the collectors using the X handle @crumz10 said that he miraculously escaped the scam. 🚨🚨SCAM ALERT!!🚨🚨 I just spent the last 2hours on Zoom with \u0027@Forbes\u0027 it was pretty sophisticated and well thought out because I\u0027m usually on high alert but luckily I wasn\u0027t caught. Here\u0027s what they did. 🧵1/8 — Crumz 🇮🇪 (@crumz10) November 26, 2023 The user immediately noticed several red flags: the scammer did not have a premium subscription to Zoom and wanted to record the screen holder using a strange bot. The interview lasted two hours. At the end, the “journalist” suggested that the victim take a banana to take a photograph for the article. However, @crumz10 realized that in this way the attacker was trying to distract him, and did not leave the computer. Once the user turned off the camera and microphone, the scammer tried to find NFTs to steal. You might also like: Fake Elon Musk YouTube streams lead to $165k crypto scam Another user @3orovik also warned followers about the cunning fraud. He noted that during the interview, the scammer tried to gain access to the user’s computer and steal expensive tokens. Previously, SlowMist analysts shared research on a new wave of thefts. The cybercriminal similarly posed as a famous journalist, called Friend.tech users for an interview, and then tried to hack their accounts. The scammer conducted the interview via Telegram. After the conversation, he asked to fill out a special form, but it contained a phishing link. You might also like: BlackRock reaches police after fake XRP ETF application Follow Us on Google News",
    "tags": [
      "#NFT",
      "#SCAM"
    ],
    "publishDate": "27/11/2023"
  },
  {
    "id": 46,
    "title": "Crypto price-tracking website CoinGecko acquires NFT analytics firm Zash Crypto price-tracking website CoinGecko acquires NFT analytics firm Zash",
    "absoluteURL": "https://crypto.news/crypto-price-tracking-website-coingecko-acquires-nft-analytics-firm-zash/",
    "fullContent": "With the new addition, CoinGecko wants to expand its crypto data API offering and monitor wash trading on marketplaces. Crypto data aggregator CoinGecko is doubling down on the NFT market with the latest acquisition aimed at expanding its API offering data on digital collectibles. In a blog announcement on Wednesday, Nov. 22, CoinGecko said it has acquired Zash, an infrastructure company focused on non-fungible tokens, in a bid to offer more NFT-related metrics such as metadata, historical trades and lending data. The deal price was not disclosed. “We believe that NFTs will continue to evolve and unlock new use cases globally, creating value for companies and consumers.” CoinGecko Founder, Parit Patel CoinGecko plans to roll out new services by Q2, 2024. Users could get access to data across Ethereum, Polygon, BNB Chain (formerly Binance Smart Chain), Bitcoin Ordinals and Solana. In addition to metadata, users will also be able to gather NFT lending information across marketplaces such as Blend, X2Y2 and NFTfi. Among other features, Zash will also make it possible for customers to monitor wash trading. However, this feature will only be available on “major collections” minted on Ethereum, CoinGecko said. You might also like: From millions to pennies: the astonishing decline of iconic NFTs Wash trading has historically been a concern in the NFT market as many blamed this illegal practice of buying and selling assets at the same time as the main reason behind the 2022 NFT bubble. According to a blockchain forensic firm Chainalysis, more than 100 profitable wash traders collectively made nearly $9 million in profit from this activity. Yet, the firm noted that most NFT wash traders “have been unprofitable,” adding that more than 150 wash trades resulted in $416,984 in losses. As of press time, total sales on the market amount to $80.8 million, a far cry from its all-time high from August 2021, when the market generated over $2 billion in daily sales, according to CryptoSlam data. CoinGecko operates as a platform providing data and information on digital currencies, offering tools for users to assess and rank their cryptocurrency holdings quantitatively. Established in Singapore in 2014, the company was co-founded by TM Lee and Bobby Ong. Read more: Navigating the NFT market dip: a shift towards utility Follow Us on Google News",
    "tags": [
      "#CoinGecko",
      "#NFT"
    ],
    "publishDate": "22/11/2023"
  },
  {
    "id": 47,
    "title": "BLUR jumps 12% as Blur founder raises $20m for new L2 network BLUR jumps 12% as Blur founder raises $20m for new L2 network",
    "absoluteURL": "https://crypto.news/blur-jumps-12-as-blur-founder-raises-20m-for-new-l2-network/",
    "fullContent": "Additionally, Blur founder Tieshun Roquerre raised $40 million to contribute to the Blur ecosystem. Tieshun Roquerre, the founder of NFT marketplace Blur (also known as “Pacman”), is launching a new layer-2 network where users can reduce transaction costs for digital collectibles. In a thread posted to X on Nov. 21, Roquerre addressed high network fees, saying “hundreds of millions have been spent on gas trading NFTs.” Two of the biggest opportunities we see for NFTs are reducing transaction costs and institutional-grade NFT perps. Hundreds of millions have been spent on gas trading NFTs, and perp volume is 6x bigger than spot. These opportunities require an L2. — Pacman | Blur.io (@PacmanBlur) November 21, 2023 Moreover, Roquerre says “almost every” decentralized application, or DApp, on a blockchain has an issue when users lock up their funds in pools, which do not generate yield for them. “This means that Blur users are losing money through depreciation. As I dug deeper, I realized that almost every dapp on-chain has this issue.” Tieshun Roquerre In a bid to solve all these issues “at once,” the Blur founder decided to launch Blast, a new layer-2 network with native yield for DApps, where users could avoid asset depreciation as well as reduce transaction costs for non-fungible tokens. For the new venture, Roquerre raised $20 million in funding from Paradigm, Standard Crypto and others. You might also like: NFT giants are protesting Blur and OpenSea over royalty rates To earn yield, Blast “natively” participates in Ethereum (ETH) staking, automatically returning the staking yield to the network’s users and DApps. In addition to ETH, Blast also earns yield for stablecoins with USDB, the network’s native auto-rebasing stablecoin. Additionally, I have raised another $40m to contribute to the Blur ecosystem. The funds will be used to build L2 apps for NFTs and continue advancing NFTs on ETH L1 as well. — Pacman | Blur.io (@PacmanBlur) November 21, 2023 Beyond Blast, Roquerre announced he had raised another $40 million to contribute to the Blur ecosystem. The proceeds are expected to be used for building DApps atop Blast in order to “continue advancing” NFTs on Ethereum as well. Amid the news, Blur’s native token BLUR jumped 12%, surging to $34, according to CoinGecko data. Read more: Blur token skyrockets as NFT sales surpass the $10m mark Follow Us on Google News",
    "tags": [
      "#Blur",
      "#Layer 2",
      "#NFT"
    ],
    "publishDate": "21/11/2023"
  },
  {
    "id": 48,
    "title": "Disney and Dapper Labs to launch NFT mobile app Disney and Dapper Labs to launch NFT mobile app",
    "absoluteURL": "https://crypto.news/disney-and-dapper-labs-to-launch-nft-mobile-app/",
    "fullContent": "Disney is launching a new NFT mobile app developed in partnership with Dapper Labs, featuring unique, badge-inspired digital collectibles. Disney is collaborating with Dapper Labs, popular for developing the NBA Top Shot collection, to introduce a new NFT application called Disney Pinnacle. This app, designed for mobile platforms, is set to feature unique NFTs resembling badges, utilizing the Flow blockchain. Its initial release is scheduled for the Apple App Store, and users can join the waitlist on its official website. Disney is coming to Web3. Dapper Labs is partnering with the $159B entertainment conglomerate to bring Web3 IP to the masses. Do you think the Simpsons NFT episode timing was a coincidence? Disney acquired 21st Century Fox in 2019 which had the rights to the Simpsons. Here\u0027s… pic.twitter.com/IEbOGSXS2G — s4mmy.moca (@S4mmyEth) November 14, 2023 Disney Pinnacle had an exclusive early access release for selected users at 9:00 A.M. Following this, the app will become available for web browsers and the Google Play store at a later date, as shared by a Dapper representative with Coindesk. You might also like: OpenSea users targeted in phishing scam disguised as official NFT offers Dapper Labs has a notable track record in the NFT space. They pioneered CryptoKitties, one of the earliest NFT initiatives, which famously clogged up the Ethereum network. In the 2020-21 bull market, Dapper launched NBA Top Shot in collaboration with the National Basketball Association. This platform, centered around trading tokenized NBA highlights, emerged as a standout during the NFT boom. Capitalizing on this success, Dapper expanded its offerings to include digital collectibles from other sports leagues, like the NFL. Be the first to chase, collect and trade digital pins featuring characters you love. Only on Disney Pinnacle. 💫 Join the waitlist at https://t.co/VCeadWRHTU! 🌟 pic.twitter.com/GQa084CkW4 — DisneyPinnacle (@DisneyPinnacle) November 14, 2023 Disney Pinnacle is poised to offer a similar experience, allowing users to exchange digital “pins” featuring Disney’s intellectual properties. This means iconic characters like Baby Yoda, Woody, and Buzz from “Toy Story,” and Snow White could become digital collectibles. Read more: NFT market revives as major collections soar in sales and volume Follow Us on Google News",
    "tags": [
      "#Dapper Labs",
      "#Disney",
      "#NFT"
    ],
    "publishDate": "15/11/2023"
  },
  {
    "id": 49,
    "title": "OpenSea users targeted in phishing scam disguised as official NFT offers OpenSea users targeted in phishing scam disguised as official NFT offers",
    "absoluteURL": "https://crypto.news/opensea-users-targeted-in-phishing-scam-disguised-as-official-nft-offers/",
    "fullContent": "In a Nov. 14 post on X from WuBlockchain, it was confirmed that several community users had reported they received phishing emails from an “Opensea official.” As part of these emails, users were being offered NFTs. Plenty of phish in the sea Recently, a large number of community users have reported that they have recently received phishing emails disguised as Opensea official, with content such as NFT Offers. OpenSea has stated before that user emails and even developer API keys may be leaked because the supplier is… pic.twitter.com/koVH9o6OKG — Wu Blockchain (@WuBlockchain) November 14, 2023 OpenSea has stated before that user emails and even developer API keys may be leaked because the supplier is attacked. At the same time, OpenSea issued a post on Nov. 13 stating that “There’s no hack.” and going on to warn users not to click links they don’t trust. That said, X now contains thousands of tweets about the alleged hacking. You might also like: OpenSea CEO announces layoffs for half of workforce A large target There\u0027s no hack. DO NOT click links you don\u0027t trust. — OpenSea (@opensea) November 13, 2023 The news follows the announcement from OpenSea’s co-founder and CEO, Devin Finzer, announced job cuts on Nov. 3. According to Finzer’s post, the decision to implement these cuts stemmed from a comprehensive reassessment of OpenSea’s “operating culture, product, and tech from the ground up.” This strategic realignment is a pivotal step within the framework of “OpenSea 2.0” as the prominent digital collectible trading platform endeavors to fortify its position. However, the news has since been overshadowed with skepticism about the alleged phishing scam. Read more: OpenSea rolls out Pro version on Polygon, adds support for cross-chain swaps Follow Us on Google News",
    "tags": [
      "#NFT",
      "#OpenSea",
      "#Phishing"
    ],
    "publishDate": "14/11/2023"
  },
  {
    "id": 50,
    "title": "NFT market revives as major collections soar in sales and volume NFT market revives as major collections soar in sales and volume",
    "absoluteURL": "https://crypto.news/nft-market-revives-as-major-collections-soar-in-sales-and-volume/",
    "fullContent": "Major NFT collections see increased demand as sales and trading volume soar across several networks. As the crypto market rallied after a prolonged crypto winter, the non-fungible tokens (NFT) market also hints at a comeback — the trading volume of several major collections recording significant highs after months of steady decline. NFT markets are rallying again 🔥 Here\u0027s all the bullish news you need to know In 4 minutes or less 👇 pic.twitter.com/GuZM6X2zQu — Bankless (@BanklessHQ) November 12, 2023 According to the data from Coingecko, the floor prices of the top 15 NFT collections have significantly soared over the last few days, demonstrating increasing demand. Most notably, the floor price of the Bored Ape Yacht Club (BAYC) collection has increased over 70% in a month, from $24.8 in the first week of October to $30.90 on Nov. 13. BAYC’s 24-hour trading volume has also risen by 51% today, showcasing increased trading across marketplaces. TOP NFTs | Source: CoinGecko The 24-hour trading volume of Captainz, a popular collection from Memeland, soared by over 680% since yesterday. You might also like: CryptoPunks drive NFT surge with $1.1m sale Data from Dune Analytics show that NFT trading volume across major marketplaces in November recorded the highest figures since July. On Nov. 10, daily trading volume reached a four-month high, with Blur accounting for the lion’s share of the trades. NFT trading volume across major marketplaces | Source: Dune In terms of sales volume, CryptoPunks led the way with a 373% increase in weekly sales. BAYC also recorded a 42% increase in sales. Overall, weekly NFT sales increased by over 60% on Ethereum (ETH) and Solana (SOL) networks. Bitcoin’s BRC-20 collections also saw increased demand, with $SATS and $RATS making notable sales over the week. Blockchains by NFT sales volume | Source: CryptoSlam The rising sales and trading volumes suggest a positive Q4 for the NFT market, with increased demand across all major marketplaces. However, the non-fungible tokens market is still a mere shadow of its 2021 peak. If the positive sentiment continues to sustain over the new year, we might see the overall market revive to some extent. Read more: Blur token skyrockets as NFT sales surpass the $10m mark Follow Us on Google News",
    "tags": [
      "#Bored Ape NFT",
      "#Bored Ape Yacht Club",
      "#CryptoPunks",
      "#NFT"
    ],
    "publishDate": "14/11/2023"
  },
  {
    "id": 51,
    "title": "China announces criminal penalties for theft of digital assets including NFTs China announces criminal penalties for theft of digital assets including NFTs",
    "absoluteURL": "https://crypto.news/china-announces-criminal-penalties-for-theft-of-digital-assets-including-nfts/",
    "fullContent": "The Chinese government has officially declared that the theft of digital collections, including NFTs, will be legally treated as property theft, signifying a significant shift in the nation’s approach to digital asset regulation. On Nov. 10, the Chinese government issued a significant statement regarding the legal status of digital collections, including nonfungible tokens (NFTs), within its jurisdiction. This announcement marks a notable stance on digital property rights and cybercrime in a nation known for its stringent regulatory environment. The statement delineated three perspectives on categorizing the theft of digital collections. The first two views classify it either as data theft or digital property theft. However, it’s the third viewpoint, treating digital collections as both data and virtual property, that falls under “co-offending.” “The theft of digital collections violates the protection law and interests of the crime of illegally obtaining computer information system data.” This approach underscores the multi-faceted nature of digital asset theft, involving both intrusion into computer systems and the theft of virtual property. You might also like: Various crypto scams cost users over $32m in October Emphasizing the dual nature of such theft, the statement clarifies that stealing a digital collection involves illicitly accessing the system hosting it, thus constituting a violation of laws protecting computer system data and property rights. The Chinese government labels digital collections as “network virtual property,” asserting their recognition as property in a criminal law context. This classification is crucial, as it implies that digital collections can be the subject of property crimes. NFTs, a technology largely developed abroad, use blockchain to create unique, non-replicable digital assets with secure and permanent storage features. Despite China’s 2021 ban on most cryptocurrency-related activities, the recent developments hint at a nuanced approach towards digital assets like NFTs. Interestingly, there have been indicators of a growing interest in NFTs within China. For instance, Alibaba’s Xianyu removed restrictions on the search terms “nonfungible tokens” and “digital asset” on October 25. Furthermore, on October 6, the state-run China Daily announced plans to develop its own NFT platform, committing 2.813 million yuan, or $390,000, for its design and implementation. Read more: Philippine police release over 1,000 prisoners forced to perform crypto scams Follow Us on Google News",
    "tags": [
      "#China",
      "#NFT",
      "#Theft"
    ],
    "publishDate": "11/11/2023"
  },
  {
    "id": 52,
    "title": "NFT creators say UV lights at ApeFest event caused eye injuries NFT creators say UV lights at ApeFest event caused eye injuries",
    "absoluteURL": "https://crypto.news/nft-creators-say-uv-lights-at-apefest-event-caused-eye-injuries/",
    "fullContent": "Bored Ape Yacht Club (BAYC), creator of the popular Bored Ape nonfungible token (NFT) collection, announced Thursday that ultraviolet lights used during its ApeFest event in Hong Kong last week likely caused eye and skin injuries reported by attendees. BAYC said in a statement posted to Twitter that an investigation undertaken with event producer Jack Morton Worldwide concluded the UV lighting rigs were the “most likely cause” of the medical issues. Some attendees complained on social media of experiencing eye pain and discomfort during the Nov. 3-5 event. BAYC said it has been in contact with those affected. You might also like: Bitcoin Frogs outpaces Bored Apes as the most popular NFT The incident came during a rocky period for BAYC and the NFT market as a whole, which has plunged from historic highs reached during the pandemic. The collectible digital assets, which verify ownership through blockchain technology, surged along with cryptocurrencies like Bitcoin before crashing this year. Jack Morton Worldwide, an experiential marketing agency owned by Interpublic Group, did not immediately respond to a request for comment Thursday. BAYC thanked the community for its patience as the investigation was conducted and said it “committed to supporting the recovery of anyone affected.” Read more: Yuga Labs’ Bored Ape Yacht Club hits 30 ETH floor price Follow Us on Google News",
    "tags": [
      "#Bored Ape Yacht Club",
      "#DeFi",
      "#NFT"
    ],
    "publishDate": "10/11/2023"
  },
  {
    "id": 53,
    "title": "Coatue Management slashes stake in OpenSea by 90% Coatue Management slashes stake in OpenSea by 90%",
    "absoluteURL": "https://crypto.news/coatue-management-slashes-stake-in-opensea-by-90/",
    "fullContent": "Coatue Management, a US-based tech investment firm, has significantly reduced the valuation of its investment in the NFT marketplace OpenSea by 90%. According to reports on Nov. 7, Coatue has slashed its stake from an initial $120 million to a mere $13 million. This adjustment suggests that OpenSea’s valuation is now approximately $1.4 billion. Coatue has also revised the value of its investment in MoonPay, a web3 payment provider, reducing it by the same margin of 90%. In January 2022, OpenSea secured $300 million during a Series C funding round. The round was spearheaded by Paradigm and Coatue, catapulting the valuation of the NFT platform to $13.3 billion at that time. You might also like: OpenSea rolls out Pro version on Polygon, adds support for cross-chain swaps NFTs, which are unique crypto assets, enable owners to authenticate their ownership of various items, whether tangible or digital. The NFT sector, however, has not been immune to the prolonged bear market that has affected the wider crypto industry. As a result, OpenSea announced on Nov. 3 a significant downsizing of its workforce by 50% as part of a strategic move to pivot towards OpenSea 2.0. Devin Fizner, the CEO of OpenSea, said that the revamped platform will enhance its technological framework, focusing on improved performance and quality. Fizner believes a leaner team structure will enable the platform to maintain agility and responsiveness. State of NFT market Despite some indications of recovery in the broader cryptocurrency market, the NFT segment has been sluggish in bouncing back. Recent data indicates a stark decline in NFT transactions, with weekly sales plummeting from around 176,000 at the beginning of the year to approximately 23,000 and the total value of weekly sales falling from $118 million to $62 million. However, there is a glimmer of hope as the NFT market saw its first increase in over a year, with a $99 million rise in October, as reported by DappRadar on Nov. 3. This uptick may signal a slow but steady resurgence in the NFT sector. Read more: NFTs surge following SEC’s failure to appeal Grayscale ETF Follow Us on Google News",
    "tags": [
      "#MoonPay",
      "#NFT",
      "#OpenSea"
    ],
    "publishDate": "08/11/2023"
  },
  {
    "id": 54,
    "title": "Magic Eden enhances Polygon integration with latest feature rollout Magic Eden enhances Polygon integration with latest feature rollout",
    "absoluteURL": "https://crypto.news/magic-eden-enhances-polygon-integration-with-latest-feature-rollout/",
    "fullContent": "Magic Eden has introduced new features to enhance its support for the Polygon network, including an aggregation tool and royalty enforcement for its marketplace. Magic Eden, a notable NFT marketplace, is expanding its services for the Polygon (MATIC) network by introducing a set of innovative features aimed at enhancing user experience. Among these new additions is a sophisticated aggregation tool designed to consolidate NFT listings from various marketplaces, streamlining the process of browsing and purchasing digital assets. https://twitter.com/MEonPolygon/status/1721935721932509523 Magic Eden has also enforced royalty payments on its Polygon-based marketplace. This development ensures that creators continue to receive their due share from secondary sales, a principle that is sometimes contested in the realm of digital assets. You might also like: Yuga Labs, Magic Eden unveil Ethereum NFT marketplace Additionally, Magic Eden is opening up its technological infrastructure to the wider community by making its Polygon API public. This initiative will allow other projects to seamlessly integrate marketplace functionalities, fostering a more interconnected ecosystem. Co-founder and CEO of Magic Eden Jack Lu expressed enthusiasm about the platform’s ongoing ventures with Polygon. Lu anticipates that the introduction of these new tools will attract a more diverse range of collectors, artists, and game developers to the platform, further driving the growth of the Polygon network. Magic Eden, which began as a dedicated marketplace for Solana (SOL)-based digital assets, extended its reach to include Polygon, a Layer 2 Ethereum scaling solution, in late 2022. The platform quickly escalated its support by facilitating the minting and trading of Polygon NFTs, particularly catering to the burgeoning sector of web3 gaming assets. This strategic expansion not only diversifies Magic Eden’s offerings but also strengthens its position in the competitive landscape of NFT marketplaces. Read more: Magic Eden adds support for Solana-powered compressed NFTs Follow Us on Google News",
    "tags": [
      "#Magic Eden",
      "#NFT",
      "#Polygon"
    ],
    "publishDate": "08/11/2023"
  },
  {
    "id": 55,
    "title": "CryptoPunks drive NFT surge with $1.1m sale CryptoPunks drive NFT surge with $1.1m sale",
    "absoluteURL": "https://crypto.news/cryptopunks-drive-nft-surge-with-1-1m-sale/",
    "fullContent": "A CryptoPunks NFT recently sold for 600 Ethereum (ETH), worth $1.14 million, representing the largest single NFT sale over the past seven days and the second-largest last month. The sale, involving CryptoPunk #7458, occurred on Nov. 6 at Larva Labs. Interestingly, the recipient address is relatively new, with the NFT purchase representing its second transaction. The address had received 360 ETH from a Coinbase address two hours before buying the NFT. NFT data aggregator resource CryptoSlam confirms that the recent transfer represents the largest single NFT transaction over the last week. In addition, the transaction is also the second largest in the past month, only behind a Cryptoadz collectible, which sold for 1,055 WETH, worth $1.655 million at the time of the sale. You might also like: Blur token skyrockets as NFT sales surpass the $10m mark CryptoPunks dominate NFT sales volume Notably, the recent sale has compounded the cumulative sales volume of the CryptoPunks collection, bringing the total volume to a whopping $4 million over 29 transactions in the last 24 hours. The collection has witnessed a 1,929% increase in its sales volume. Remarkably, the CryptoPunks collection has dominated the NFT scene over the past day, with up to seven of the top ten sales within this timeframe attributed to the collection. This dominance extends to the top 35 sales, as the CryptoPunks account for 29 sales. Stats confirm that the market observed the sale of 18 unique CryptoPunks NFTs yesterday alone, marking the largest intraday sale since March. The recent situation has triggered speculation of renewed interest in NFTs following a period of sustained apathy among market participants. **Punks making moves** It isn\u0027t just @GordonGoner buying punks today. There have been 18 unique punks traded on the Larva Labs site. That\u0027s the most in a single day since March. pic.twitter.com/MzCHy562Cs — NFTstats.eth (@punk9059) November 6, 2023 Further data from DappRadar suggests that the CryptoPunks market commands a larger sales volume than NFT marketplace OpenSea, which has recorded a volume of $2.92 million over the last 24 hours. The CryptoPunks collection only sits below Blur, with a massive $9.61 million sales volume. Top NFT sales volume – Nov. 7 | Source: DappRadar Notably, the recent increased interest in CryptoPunks and the NFT scene coincides with a recent Simpsons episode, “Wild Barts Can’t be Token,” which featured a parody of the NFT scene. Simpsons just made a crypto \u0026 NFT episode pic.twitter.com/pgsKgu3KB7 — borovik.eth (@3orovik) November 6, 2023 In addition, last week, Avant Arte, a prominent art marketplace, partnered with Yuga Labs, the firm behind CryptoPunks. Through the partnership, Avant Arte launched a campaign to give CryptoPunks holders a 48-hour opportunity to receive physical versions of their NFTs. Read more: Coinbase to stop supporting Bitcoin SV by 2024 Follow Us on Google News",
    "tags": [
      "#CryptoPunks",
      "#Larva Labs",
      "#NFT"
    ],
    "publishDate": "07/11/2023"
  },
  {
    "id": 56,
    "title": "Bluzelle expands into Creator Economy, aims to empower artists Bluzelle expands into Creator Economy, aims to empower artists",
    "absoluteURL": "https://crypto.news/bluzelle-expands-into-creator-economy-aims-to-empower-artists/",
    "fullContent": "Bluzelle, a layer-1 blockchain platform, has announced its vision to empower innovators in the broader Creator Economy. In an exclusive press release shared with crypto.news, Bluzelle said the Creator Economy will be a diverse market comprising content creators, such as artists, musicians, gamers, social media influencers, and even those leveraging artificial intelligence (AI). Bluzelle aims to provide fitting solutions to safeguard and authenticate their creations. The platform estimates the Creator Economy will be a $480 billion industry by 2027. You might also like: OpenSea rolls out Pro version on Polygon, adds support for cross-chain swaps Of note, Bluzelle’s ecosystem products will play a pivotal role in this expansion. R2, their decentralized storage layer, will secure content. At the same time, Capella will facilitate the creation, minting, tokenization, and trading of content as non-fungible tokens (NFTs). Through the Inter-Blockchain Communication (IBC) protocol native to Cosmos, Bluzelle plans to transform the content landscape into a dynamic financial marketplace. In this setup, content could become a source of inspiration and a financial asset. Commenting, Pavel Bains, the CEO of Bluzelle said: “We are thrilled to unveil a new chapter in the Bluzelle journey, one that combines both our past and our future; while also pushing the boundaries of blockchain technology. Bluzelle’s mission is to catalyze the Creator Economy, offering technology, trust, and creativity to foster innovation within web3 space.” Central to this ecosystem will be BLZ, the Bluzelle native token. The coin will be the foundation for securing content, minting, and trading NFTs. Eventually, Bluzelle plans to incorporate SocialFi, a concept that combines social media and decentralized finance (defi), providing extra revenue streams for creators. Bluzelle has also revealed that BLZ holders will be free to stake, gain early access to in-game NFT drops, and even participate in governance. Additionally, they can mint their content as unique NFTs to trade within the broader Bluzelle ecosystem. Read more: Marathon Digital harnesses landfill methane for Bitcoin mining pilot in Utah Disclosure: This content is provided by a third party. crypto.news does not endorse any product mentioned on this page. Users must do their own research before taking any actions related to the company. Follow Us on Google News",
    "tags": [
      "#bluzelle",
      "#DeFi",
      "#IBC",
      "#NFT"
    ],
    "publishDate": "03/11/2023"
  },
  {
    "id": 57,
    "title": "OpenSea rolls out Pro version on Polygon, adds support for cross-chain swaps OpenSea rolls out Pro version on Polygon, adds support for cross-chain swaps",
    "absoluteURL": "https://crypto.news/opensea-rolls-out-pro-version-on-polygon-adds-support-for-cross-chain-swaps/",
    "fullContent": "OpenSea, the digital marketplace for non-fungible tokens (NFTs), has expanded its multi-chain presence after releasing the Pro version to the Polygon sidechain. 1/ OpenSea Pro is now live on @0xPolygon! 🟣 Wen Multichain? Now. OpenSea Pro just became the go-to destination to buy, sell, and list NFTs across marketplaces AND blockchains! Find your favorite collections on Ethereum and Polygon 👉 https://t.co/oYtdhiw69x pic.twitter.com/OYPbwNf7EJ — OpenSea Pro (@openseapro) November 2, 2023 Taking to X on Nov. 2, OpenSea said users can now buy and sell NFTs on different marketplaces and blockchain networks. Moreover, OpenSea has launched a cross-chain bridge feature with Socket, a web3 infrastructure for social interactions on-chain. This feature allows users to send tokens to other chains and swap them “in a single flow.” You might also like: Ex-OpenSea exec accused of pump \u0026 dump, $60m rug pull OpenSea supports various ledgers, offering cross-blockchain compatibility across Ethereum, Polygon, BNB Chain (formerly Binance Smart Chain), Base, and more. Supported networks on OpenSea | Source: OpenSea With the latest upgrade, OpenSea appears keen on serving experienced and sophisticated NFT traders across multiple networks. Key NFT creators like Yuga Labs recently reconsidered their listings on Blur and OpenSea, challenging recent royalty cutbacks. As reported earlier, Blur and OpenSea have significantly reduced the royalty percentages creators receive from secondary market transactions as they aim to boost transaction volumes in the declining NFT market. Despite declining royalties, many NFT collections are expanding into different markets, such as gaming or physical collectibles. For example, Pudgy Penguins have diversified into merchandising, boosting its sales to $7 million, which is a stark contrast to the mere $300,000 earned from NFT royalties alone. Read more: NFT giants are protesting Blur and OpenSea over royalty rates Follow Us on Google News",
    "tags": [
      "#NFT",
      "#OpenSea"
    ],
    "publishDate": "03/11/2023"
  },
  {
    "id": 58,
    "title": "Elon Musk’s take on NFTs sparks support for Bitcoin Ordinals Elon Musk’s take on NFTs sparks support for Bitcoin Ordinals",
    "absoluteURL": "https://crypto.news/elon-musks-take-on-nfts-sparks-support-for-bitcoin-ordinals/",
    "fullContent": "While deriding nonfungible tokens on a podcast, Tesla’s CEO, Elon Musk, inadvertently turned the spotlight onto Bitcoin Ordinals, the Bitcoin network’s version of NFTs. In an interview released on Oct. 31 on The Joe Rogan Experience, Elon Musk remarked, “The funny thing is the NFT is not even on the blockchain — it’s just a URL to the JPEG.” Musk said NFT projects should at least encode the JPEG on-chain: “You should at least encode the JPEG in the blockchain. If the company housing the image goes out of business, you don’t have the image anymore.” Elon Musk on The Joe Rogan Experience Crypto community reacts to Elon Musk’s NFT views The critique by Musk inadvertently drew attention to the concept of Bitcoin Ordinals, a form of NFTs on the Bitcoin (BTC) blockchain. Bitcoin Ordinals began following the Taproot soft fork in November 2021 and were introduced by developer Casey Rodarmor in January. The Bitcoin community has highlighted that Ordinals inscribe data directly onto the Bitcoin blockchain, addressing the very concern Musk raised about the permanence of digital assets. You might also like: Nearly 95% of NFTs are now worthless, report says Cryptocurrency analyst Will Clemente commended Musk’s remarks, highlighting the existence of over 38 million Ordinals inscriptions that are permanently recorded on Bitcoin’s blockchain. .@elonmusk you just laid out the case for Bitcoin ordinals – image/text inscriptions directly on the most secure open source monetary network on the planet. There are currently 38 million of these inscriptions on the Bitcoin blockchain. pic.twitter.com/WASj1qpkz8 — Will Clemente (@WClementeIII) November 1, 2023 Rohun “Frank” Vora, known for creating NFT projects DeGods and y00ts, praised the Bitcoin Ordinals for offering a sophisticated solution to a widespread critique of NFTs. This is why Ordinals will continue to grow. It\u0027s the most elegant solution to one of the most universal criticisms of NFTs. https://t.co/feVYFbv7eL — DeGod #2505 (@frankdegods) November 1, 2023 Billy Markus, the co-creator of Dogecoin, also weighed in, supporting Musk’s views on the need for on-chain asset storage. Markus, alongside Musk, who is a vocal supporter of Dogecoin, acknowledged the advantages of Ordinals over traditional NFTs. A well-known figure in the Ordinals community, who goes by the pseudonym Leonidas, took the discussion further by inscribing the video clip featuring Musk onto the Bitcoin blockchain, only emphasizing the broader community response in favor of the fully on-chain Ordinals. I just inscribed the video of @elonmusk saying that NFTs are \"not even on the blockchain\" into the Bitcoin blockchain! Engage so that this shows up in Elon\u0027s timeline and he learns about how Bitcoin NFTs (Ordinals) are stored fully on-chain forever. → https://t.co/hHRr3AYtxj pic.twitter.com/qAdhS7GXCZ — Leonidas (@LeonidasNFT) November 1, 2023 However, Musk’s comments do not apply universally across the board. Several projects on Ethereum, the leading blockchain for NFTs, have their artwork stored on-chain. Notable examples include CryptoPunks and Moonbirds, as well as the generative art platform Art Blocks, which keeps the artists’ algorithms on the blockchain, allowing the artwork to be replicated. The discussion also sheds light on a common misunderstanding about NFTs. An NFT is not the artwork itself but a token that signifies ownership of a digital or physical asset. Depending on the project, the associated asset may be stored on a decentralized blockchain, making it immutable and resistant to censorship, or it may be off-chain. In September, Metagood, the creators of OnChainMonkeys, revealed plans to transition their NFT collection from the Ethereum blockchain to Bitcoin. While the firm’s CEO, Danny Yang, did not specifically address the issue with JPEG files, he suggested that NFTs will likely be more successful on the Bitcoin network, attributing this to its superior security infrastructure. “The Bitcoin Ordinal protocol is better designed for decentralization and security than the Ethereum NFT protocol. High-value NFTs will win on Bitcoin.” Despite the potential of Bitcoin Ordinals and the arguments for on-chain storage, Ethereum continues to dominate the NFT market. Data from CoinGecko as of June indicates that Ethereum (ETH) accounts for 84% of all NFT trading volumes, with Bitcoin and ImmutableX holding 11% and 2.5% market shares, respectively. Read more: NFTs surge following SEC’s failure to appeal Grayscale ETF Follow Us on Google News",
    "tags": [
      "#Elon Musk",
      "#NFT",
      "#Ordinals"
    ],
    "publishDate": "02/11/2023"
  },
  {
    "id": 59,
    "title": "JPEG’d warns of phishing attack months after Curve hack JPEG’d warns of phishing attack months after Curve hack",
    "absoluteURL": "https://crypto.news/jpegd-warns-of-phishing-attack-months-after-curve-hack/",
    "fullContent": "NFT protocol JPEG’d alerted community members to malicious actors targeting holders of its token as phishing scammers continue to target crypto and DeFi operators. The P2P non-fungible token (NFT) lending platform JPEG’d posted a notice on X following numerous complaints from users citing phishing campaigns and a booby trap revocation tool. These services are typically employed by web3 users to clear out access previously given to decentralized applications. Bad actors launched a number of malicious platforms mimicking genuine services per the update from JPEG’d. The goal is to secure transaction approval before draining NFTs and digital assets in the wallet. It has come to our attention that scammers are targeting $JPEG holders claiming false approvals on phishing contracts and linking to a malicious revocation tool. The current name they go under is \"Trojansec\". Please do not interact with them or any contract that you are unsure… — JPEG\u0027d (@JPEGd_69) October 30, 2023 You might also like: Crypto whale losses over $24m in phishing scam Several phishing efforts have been directed toward cryptocurrency participants and decentralized finance users. As crypto.news reported, hard wallet maker Trezor became the target of a new phishing campaign. Social media accounts tied to rapper Nelly were also compromised. Viral SocialFi app Friend.Tech reported suffered Google search manipulation attacks and investors lost $4.5 million in USDT to a phishing scam. JPEG’d’s call for vigilance comes months after hackers attacked on-chain stable swap exchange Curve Finance, stealing nearly $100 million from multiple protocols and liquidity providers. Some of the funds were recovered by white hat hackers and a collaborative DeFi helpline tagged SEAL 911 was formed. Read more: Justin Sun, other crypto investors buy CRV token in attempt to help Curve Finance Follow Us on Google News",
    "tags": [
      "#DeFi",
      "#NFT",
      "#SCAM",
      "#Web3"
    ],
    "publishDate": "31/10/2023"
  },
  {
    "id": 60,
    "title": "Phantom unveils new camera NFT feature Phantom unveils new camera NFT feature",
    "absoluteURL": "https://crypto.news/phantom-unveils-new-camera-nft-feature/",
    "fullContent": "Phantom’s Camera Mint feature introduces a tool for creating NFTs directly on mobile devices, presenting both opportunities and challenges in the evolving landscape of digital collectibles. Phantom’s recent introduction of the Camera Mint feature enables mobile users to create NFTs with ease. While the tool democratizes access to blockchain technology, it also introduces a series of challenges and considerations that users must make. Don’t just collect NFTs… CREATE them. With Camera Mint on Phantom mobile, instantly turn photos and videos into @solana NFTs you can save forever. pic.twitter.com/4Ei0LpdKUI — Phantom (@phantom) October 30, 2023 One of the feature’s main selling points is its user-friendliness, designed to attract a wide audience to the world of NFTs. Users can quickly transform personal moments into digital assets, a process that once required a more comprehensive understanding of blockchain technology. However, this ease of access has potential drawbacks, including potentially leading to blockchain bloat, as every minted NFT requires storage on the Solana (SOL) blockchain. This raises questions about the long-term sustainability, particularly when considering the environmental impact of blockchain networks. You might also like: Solana Labs unveils incubator for web3 startups eyeing its network Phantom’s approach of turning personal experiences into tradable assets also introduces a sentimental value to NFTs. On the other hand, this personalization aspect could potentially blur the lines between emotional value and market value, leading users to misconstrue the worth of their digital assets. The volatile nature of the NFT market also means that assets can fluctuate in value significantly, a reality that might not be apparent to all users, especially those new to the space. The platform’s reward system, designed to incentivize user interaction with the Camera Mint, risks encouraging a quantity-over-quality approach to content creation. While this gamification strategy may drive user engagement, Phantom must implement measures that ensure the integrity and quality of content on their platform. While the feature enhances user experience through functionalities like the integrated display of minted NFTs in the ‘collectibles’ tab, the platform could benefit from incorporating additional educational resources and tools. Providing users with comprehensive information on NFTs, blockchain technology, and the potential risks associated with digital assets would eventually contribute to a more informed user base. Read more: Solana gaining momentum according to Nansen report Follow Us on Google News",
    "tags": [
      "#NFT",
      "#Phantom",
      "#Photography"
    ],
    "publishDate": "30/10/2023"
  },
  {
    "id": 61,
    "title": "Insomnia Labs partners with web3 firms for brand loyalty shift Insomnia Labs partners with web3 firms for brand loyalty shift",
    "absoluteURL": "https://crypto.news/insomnia-labs-partners-with-web3-firms-for-brand-loyalty-shift/",
    "fullContent": "Insomnia Labs has partnered with several companies to incorporate web3 elements into brand loyalty. New York-based technology firm Insomnia Labs on Oct. 18 announced a partnership with several web3 companies, including Co:Create, Smart Token Labs, Cookie3, and Crossmint, to launch a brand loyalty initiative dubbed Loyalty+. In a statement shared with crypto.news, Insomnia Labs described the new initiative as leveraging an array of web3 technologies, such as blockchain, non-fungible tokens (NFTs), and artificial intelligence, to transform traditional loyalty systems. The platform offers a unified online portal where customers can view and redeem points from various loyalty schemes. In addition, it provides personalized experiences through on-chain and off-chain data insights, ensuring unique user engagements. According to Insomnia’s statement, the Loyalty+ ecosystem will utilize a specialized API from Co:Create to integrate gamification elements. Moreover, Smart Token Labs will ensure the creation of user identities and the transition from traditional web platforms to the web3 ecosystem. You might also like: Lido community member suggests sunsetting Polygon staking Analytics provider, Cookie3, will maximize customer engagement with tailored user journeys, and Crossmint will ensure interoperability in both traditional and digital finance realms by offering an NFT checkout solution. Insomnia Labs’ CEO, Billy Huang, highlighted the initiative’s mission: “Loyalty+ isn’t just a product; it’s a paradigm shift in how loyalty is perceived and executed in the modern digital era.” Billy Huang, CEO, Insomnia Labs Underpinning Loyalty+ is blockchain technology and platform interoperability, which replaces the traditional silos associated with multiple loyalty programs, opening avenues for cross-brand promotions and marketing campaigns. Since its inception in 2021, Insomnia Labs has partnered with brands like L’Oréal’s NYX Professional Makeup, Under Armour, Coca-Cola, and web3 entities such as OpenSea, Web3 Ventures, and Polygon. Some analysts think such collaborations may reflect the growing interest in merging traditional and web3 aspects for a more enriched customer experience. Read more: Superdao shuts down, will return investor funds Follow Us on Google News",
    "tags": [
      "#Loyalty Rewards",
      "#NFT",
      "#Web3"
    ],
    "publishDate": "20/10/2023"
  },
  {
    "id": 62,
    "title": "Korean telecom giant launches digital currency for its metaverse Korean telecom giant launches digital currency for its metaverse",
    "absoluteURL": "https://crypto.news/korean-telecom-giant-launches-digital-currency-for-its-metaverse/",
    "fullContent": "To boost users’ activity, SK Telecom has launched a digital currency for virtual purchases in its metaverse dubbed Ifland. One of the largest telecommunication companies in South Korea is taking another step towards the adoption of metaverse technologies. SK Telecom, a Korean telecom provider with over 30 million customers, announced in a press release on Monday, Oct. 16, 2023, the launch of an economic system to its metaverse platform Ifland, with a new virtual currency named “Stone.” Virtual meetup in ifland | Source: SK Telecom You might also like: Korean IT firm, NHN, to develop games on Sui network According to the Seoul-headquartered company, the digital currency can be used to purchase virtual items with “high collectible values” and to sponsor hosts of events or meetups. With the launch of Stones, SK Telecom wants to bring in more users as influencers can now generate profit by receiving donations from subscribers. “Going forward, together with creators, we will grow ifland into a metaverse platform that provides a rich variety of high-quality content to users.” Yang Maeng-seog, Vice President and Head of Metaverse CO at SK Telecom At the same time, Ifland also offers the so-called “free currency” known as “Points,” which can be earned by attending events or completing virtual missions. In addition to Stones, SK Telecom launched virtual items linked to non-fungible tokens (NFTs) through TopPort, an NFT marketplace powered by SK Telecom. The items can be used for avatar customizations (e.g., special costumes, hair accessories) or other in-metaverse activities. SK Telecom is known in South Korea for its passion for web3-related investments. In July 2022, the telecommunication giant joined forces with other blockchain companies to build a digital wallet that stores cryptocurrencies, NFTs, and digital credentials. In late 2021, SK Telecom’s investment arm, SK Square, acquired a 35% stake (for nearly $75 million) in Korbit, a South Korean cryptocurrency exchange. Read more: South Korea’s crypto market soars to $21.1 billion in H1 Follow Us on Google News",
    "tags": [
      "#Metaverse",
      "#NFT",
      "#SK Telecom",
      "#South Korea"
    ],
    "publishDate": "16/10/2023"
  },
  {
    "id": 63,
    "title": "Inspect expands Chrome extension to simplify crypto insights Inspect expands Chrome extension to simplify crypto insights",
    "absoluteURL": "https://crypto.news/inspect-expands-chrome-extension-to-simplify-crypto-insights/",
    "fullContent": "Inspect is one of the top non-fungible token (NFT) players and aims to expand its presence in the decentralized finance (defi) sector. To achieve this, the company plans to expand its Google extension, which already has over 35,000 weekly active users. The extension integrates real-time analytics and insights into X, allowing users to explore crypto assets, NFTs, and defi projects directly from their X feed. It detects all crypto data on the X timeline using artificial intelligence (AI) and machine learning, providing users with insights in a single click. You might also like: UK parliament calls for NFT copyright protection rights The Inspect extension is now the top-ranked extension in the Google Chrome Store when searching for “crypto.” It offers real-time price data covering over 20,000 crypto projects, catering to a diverse range of traders and investors. Users can explore tokens and blockchain companies extensively without leaving X, offering access to project details and trending news articles. The extension’s primary goal is to streamline research, providing investors with actionable signals from tracking smart money moves and sparing them from the time-consuming process of sifting through irrelevant or misleading articles. Users can download the Inspect extension to streamline their crypto project tracking and stay updated. Read more: Google AI Lead: “Don’t take trading advice from ChatGPT” | Interview Disclosure: This content is provided by a third party. crypto.news does not endorse any product mentioned on this page. Users must do their own research before taking any actions related to the company. Follow Us on Google News",
    "tags": [
      "#AI",
      "#DeFi",
      "#Google",
      "#NFT",
      "#Twitter"
    ],
    "publishDate": "12/10/2023"
  },
  {
    "id": 64,
    "title": "UK parliament calls for NFT copyright protection rights UK parliament calls for NFT copyright protection rights",
    "absoluteURL": "https://crypto.news/uk-parliament-calls-for-nft-copyright-protection-rights/",
    "fullContent": "A cross-party committee of the UK Parliament has called on the government to protect the rights of artists and consumers in the NFT market. The committee members also raised concerns about fan tokens in sports, which are a type of digital token that give fans special access and rewards from their favorite teams. The committee of MPs from different political parties released a 500-page report on Oct. 10 after looking into how blockchain and NFTs affect art and culture. The report praised NFTs for creating new opportunities for artists, such as reaching new audiences, encouraging creativity, and proving ownership and originality. However, the report also pointed out the severe problems and dangers that NFTs create for both makers and buyers, such as stealing intellectual property, cheating, harming the environment, and breaking the law. You might also like: FCA intervenes Binance UK and its partner Members of the committee asked the government to work with NFT platforms to stop the common problem of copying original works without asking the creators or owners. The committee said that the current law needs to be better to handle the large and complicated cases of copying and that it is too complex and expensive for artists to take action by themselves. The government body suggested that the government make a code of conduct for online platforms in the UK, including NFT platforms, to ensure that they respect makers’ rights and stop selling copied and fake material. The group also warned about the growing number of fan tokens in sports, which are given by clubs or leagues to offer fans different benefits, such as voting rights, discounts, or exclusive content. The committee said that fan tokens are dangerous for fans who invest in them, who may lose money because of changes in price or dishonest behavior, and for clubs, who may damage their reputation or face legal problems. The leader of the committee, Dame Caroline Dinenage MP, said that the government must ensure everyone in the crypto world is working to protect buyers’ and makers’ rights adequately. She noted that traditional rules still need to keep up with the fast and changing new crypto world and that quick action is needed to deal with the gaps and risks in this new area. You might also like: UK authorities propose swift action against crypto rule violators Follow Us on Google News",
    "tags": [
      "#NFT",
      "#Regulation",
      "#United Kingdom"
    ],
    "publishDate": "11/10/2023"
  },
  {
    "id": 65,
    "title": "Ordswap developers issue alert after losing domain Ordswap developers issue alert after losing domain",
    "absoluteURL": "https://crypto.news/ordswap-losing-domain/",
    "fullContent": "The team behind the project called on users to avoid any contacts with Ordswap’s domain after losing control over it. One of the first non-fungible token (NFT) marketplaces built on the Bitcoin (BTC) network Ordswap has seemingly suffered an incident as its developers urge users not to interact with the website. In an X post on Tuesday, Oct. 10, the project alarmed users to avoid any interactions with Ordswap’s front-end, adding the team is “not currently in control of domain.” While the nature of the incident remains unclear, the Ordswap team has uploaded a tool for MetaMask owners so they could recover their private keys. Source for metamask users to obtain key is now available below. You are able to import(hex) to Unisat. https://t.co/oETb7h7sA0 https://t.co/NGaaLiNNwW — Ordswap (@ordswap) October 10, 2023 You might also like: Over 225,000 bitcoin transactions are unconfirmed as Ordinals bloat mempool Although the scale of the incident is yet to be clarified, users say the authorization button on Orswap’s website was compromised, targeting victims’ crypto wallets. As of press time, Ordswap’s website redirects users to RelayX, another NFT marketplace. Launched in February 2023, Ordswap is a decentralized trading platform, where users can buy, trade or generate Bitcoin Ordinals, a class of digital assets closely related to NFTs, which are inscribed onto satoshis, the smallest denomination of BTC. Read more: Over 225,000 bitcoin transactions are unconfirmed as Ordinals bloat mempool Follow Us on Google News",
    "tags": [
      "#Bitcoin",
      "#hack",
      "#NFT",
      "#Ordinals"
    ],
    "publishDate": "10/10/2023"
  },
  {
    "id": 66,
    "title": "NFT platform will launch for Chinese government-owned newspaper NFT platform will launch for Chinese government-owned newspaper",
    "absoluteURL": "https://crypto.news/nft-platform-will-launch-for-chinese-government-owned-newspaper/",
    "fullContent": "China Daily, affiliated with the Publicity Department of the Chinese Communist Party, has announced plans to develop its own metaverse and NFT platform. China Daily, a prominent English-language newspaper under the ownership of the Publicity Department of the Chinese Communist Party, has expressed its intention to venture into the world of non-fungible tokens (NFTs) and metaverse. Revealed in a recent disclosure, the publication is earmarking 2.813 million Yuan (equivalent to $390,000) for a competent third-party contractor that can bring its envisioned NFT platform to life, keeping in tune with their budgetary constraints. While many might assume a preference for domestic expertise, China Daily welcomes both domestic and international blockchain specialists. The stipulation for the chosen blockchain firm’s mainnet is that it must possess the prowess to manage 10,000 transactions each second. Prospective contractors will race against time, with an October 17 deadline to submit their applications. Once onboard, a three-month timeframe awaits them to manifest the platform. China Daily’s NFT Platform aspires to amplify the reach and resonance of Chinese civilization, according to the publication. You might also like: China’s first national NFT marketplace set to launch next week The platform will harness a confluence of cutting-edge technologies – from the realms of virtual reality, augmented reality and mixed reality to the transformative capabilities of blockchain, NFTs, big data, and cloud computing. The platform blueprint mandates support for a broad spectrum of functionalities – from uploading, showcasing, and managing diverse digital collections to embedding pricing, bidding, and limited-time features. Moreover, the envisaged infrastructure will facilitate transactions in multiple currencies. Expanding the platform’s reach, digital collections may also find a home on leading international NFT platforms such as OpenSea, Rarible, and SuperRare. While China clamped down on crypto transactions back in 2021, blockchain enterprises continue to exist, albeit under the vigilant eyes of the country’s law enforcement agencies. Read more: Nearly 95% of NFTs are now worthless, report says Follow Us on Google News",
    "tags": [
      "#China",
      "#Metaverse",
      "#NFT"
    ],
    "publishDate": "10/10/2023"
  },
  {
    "id": 67,
    "title": "Warner Music’s key web3 supporter departs after nearly 10 years Warner Music’s key web3 supporter departs after nearly 10 years",
    "absoluteURL": "https://crypto.news/warner-musics-key-web3-supporter-departs-after-nearly-10-years/",
    "fullContent": "Warner Music Group’s chief digital officer, Oana Ruxandra, says she now wants to further explore her “entrepreneurial spirit.” Oana Ruxandra, chief digital officer and key web3 advocate at Warner Music Group (WMG) is leaving the label, saying she has decided “it’s time for a change.” According to an internal memo obtained by Billboard, Ruxandra took the decision to leave the firm after she discussed her role with CEO Robert Kyncl. While the nature of these discussions remains undisclosed, Ruxandra said she now wants to explore “even further my entrepreneurial spirit.” “Robert and I have been discussing my role for a while now, and I’ve decided it’s time for a change, one where I explore even further my entrepreneurial spirit.” Oana Ruxandra You might also like: Warner Media Sports Division Launches NFT Golf Game Reboot Although it’s unclear who will replace Ruxandra, she noted that the WMG CEO “has plans for my successor and you’ll be hearing from him about that soon.” Ruxandra leaves the firm three years after she became the top-level executive at WMG. In this role, Ruxandra formed a music accelerator program alongside Polygon Labs to power the “next generation of innovation at the intersection of web3 and music.” She was also a vocal supporter of non-fungible tokens (NFTs). For example, she helped OpenSea, an NFT marketplace, to enter into a collaboration with WMG in an effort to “build and extend their fan communities in web3.” Ruxandra first joined WMG in the early 2010s as business development, but four years later moved to Universal Music Group. She returned to WMG in 2018 as the firm’s top executive, leading Warner Music’s push into web3, NFTs and gaming. Read more: Warner Music and Polygon collaborate to launch music NFTs Follow Us on Google News",
    "tags": [
      "#NFT",
      "#Warner Music"
    ],
    "publishDate": "05/10/2023"
  },
  {
    "id": 68,
    "title": "Paris museum to mint Van Gogh’s NFTs on Tezos Paris museum to mint Van Gogh’s NFTs on Tezos",
    "absoluteURL": "https://crypto.news/paris-museum-to-mint-van-goghs-nfts-on-tezos/",
    "fullContent": "The Musée d’Orsay in Paris, which houses the world’s largest collection of Impressionist and Post-Impressionist artworks, is minting non-fungible tokens (NFTs) dedicated to Vincent Van Gogh’s final months. From Oct. 4, these NFTs will be available for purchase in partnership with the Tezos. There will be two types of NFTs, with 2,300 minted for each class on Tezos. One NFT will provide an augmented reality experience of Van Gogh’s final palette, while the other will be an original digital artwork created by French artist KERU, inspired by Van Gogh’s style. You might also like: British Museum embraces digital collectibles with The Sandbox partnership NFT holders will have the opportunity to win prizes like lifetime museum passes and invitations to museum events. These NFTs are digital souvenirs affiliated with the upcoming “Van Gogh in Auvers-sur-Oise: The Final Months” exhibition on Oct. 3. Starting in 2024, the museum intends to invite digital artists who work with blockchain to design collections inspired by items from their permanent collections. This initiative aligns with the museum’s aim to engage younger and new audiences by utilizing emerging technologies such as NFTs and blockchain integration. Read more: Racy Beeple SBF artwork becomes his first to enter museum permanent collection Follow Us on Google News",
    "tags": [
      "#art",
      "#Museum",
      "#NFT",
      "#Tezos"
    ],
    "publishDate": "29/09/2023"
  },
  {
    "id": 69,
    "title": "Snook launches on Arbitrum, to distribute USDC rewards Snook launches on Arbitrum, to distribute USDC rewards",
    "absoluteURL": "https://crypto.news/snook-launches-on-arbitrum-to-distribute-usdc-rewards/",
    "fullContent": "Snook, a multiplayer game, is launching on Arbitrum, an Ethereum layer-2. The move is aimed at expanding its player base and introducing USDC, a stablecoin, to complement its native token, SNK. Snook deploys on Arbitrum, enhance gaming experience Snook is a fast-paced blockchain game focused on rewarding gamers based on their skill and effort to thrive in a kill-or-be-killed environment. The player’s ability to perform directly decides the value of their non-fungible token (NFT) character that can be sold in the secondary market. You might also like: US SEC may approve Ethereum futures ETFs next week The platform aims to enhance gaming experience by ensuring that each player’s in-game character is an NFT with immutable records of their skills and achievements. If a player’s NFT survives, they can continue participating in games, enhancing their traits and continuously increasing their value. The launch on Arbitrum allows the NFT-based game to extend its features to more players, allowing them to invest their time and effort in boosting their experience and the value of their NFT. This approach ensures that those who dedicate the most reap the rewards, earning crypto prizes with every successful gameplay. USDC rewards The game also wants players to use Circle’s stablecoin, USDC, and the native token on the Snook project, SNK. The move could increase Snook’s appeal, expanding their user base. To begin the transition to USDC, Snook’s treasury smart contract will now accumulate USDC instead of SNK, assisting in diversifying its assets and strengthening the in-game economy for gamers and decentralized finance (defi) enthusiasts on Arbitrum. In this engagement, gamers receive rewards in USDC alongside SNK. USDC rewards can be used to unlock Special Skins, upgrade, and set themselves as a formidable force in the Snook ecosystem. A member of the Snook development team said this shift presents an opportunity for players to play and use USDC in a skill-based game as part of their proof-of-concept. By offering Snook on Arbitrum, they plan on gathering valuable feedback from the community to determine if stablecoin assets are more appealing to users than SNK. Their game design allows Snook to position itself in a gaming market that is projected by Fortune Business Insight to skyrocket from $35.61 billion to a staggering $85.3 billion by 2030. To improve its position, Snook was added to Vulcan Forged, a platform with over 12,000 users and a trading volume exceeding $224 million. Read more: Uniswap Foundation requests $62M to bolster development and hedge against volatility Disclosure: This content is provided by a third party. crypto.news does not endorse any product mentioned on this page. Users must do their own research before taking any actions related to the company. Follow Us on Google News",
    "tags": [
      "#Arbitrum",
      "#Ethereum",
      "#Gaming",
      "#NFT",
      "#USD Coin"
    ],
    "publishDate": "28/09/2023"
  },
  {
    "id": 70,
    "title": "Yuga Labs security engineer briefly detained at a US airport Yuga Labs security engineer briefly detained at a US airport",
    "absoluteURL": "https://crypto.news/yuga-labs-security-engineer-briefly-detained-at-a-us-airport/",
    "fullContent": "Sam Curry, a security engineer at Yuga Labs,in a now-deleted X thread, said he was detained at a U.S. airport because he had earlier attempted to investigate a crypto scam. According to reports, he was detained by U.S. federal agents on Sept. 15 after returning from a trip to Japan. Curry was questioned by Internal Revenue Service’s Criminal Investigation (IRS-CI) unit and the Department of Homeland Security (DHS) agents about a “high-profile phishing campaign.” Thinking it was random, the engineer gave his unlocked phone for agents to access OpenSea logs. You might also like: OpenSea ex-manager retracts bail request amid ongoing appeal U.S. agents later served him with a grand jury subpoena to testify in New York as part of an ongoing investigation into wire fraud and money laundering. However, the subpoena was canceled when agents realized Curry wasn’t involved in the case. “I’m sharing this because I think it’s something people should be aware of if they’re doing similar work. It was widely shared that the private key was leaked and my background as a security researcher wasn’t enough to dissuade using immigrations and a grand jury to intimidate me.” Sam Curry In a now-deleted X post, the security researcher said he helped investigate a crypto phishing website that had stolen “millions of dollars.” He noticed that in the JavaScript of the website, the scammer had “accidentally published their Ethereum private key.” An archived version of the now-deleted post from Sam Curry on X | Source: CryptoPotato When Curry finally found the key, the scammers had already moved the stolen cryptocurrency to a different address. Read more: Chase UK blocks crypto payments for customers, citing fraud and scam rise Follow Us on Google News",
    "tags": [
      "#hack",
      "#NFT",
      "#OpenSea",
      "#United States",
      "#Yuga Labs"
    ],
    "publishDate": "28/09/2023"
  },
  {
    "id": 71,
    "title": "Rollbit to sunset degen exchange one month after launch Rollbit to sunset degen exchange one month after launch",
    "absoluteURL": "https://crypto.news/rollbit-to-sunset-degen-exchange-one-month-after-launch/",
    "fullContent": "The crypto casino Rollbit has decided to wind down its degen exchange due to “uncertainty and low adoption” a little over a month after its launch on Aug. 17 with pilot tokens like RLB and UNIBOT. Degen exchange users cannot no longer buy assets on the platform, although token sales and withdrawals remain possible according to the team. The mononymous Razer, Rollbit’s co-founder, noted that futures trading will continue and the company sees volume in this market. Of course! This update will allow us to spend even more time working on Futures, where we see great adoption and volume. — Razer (@Razer_Rollbit) September 22, 2023 Rollbit also decommissioned its Rollbot platform primarily focused on the casino’s non-fungible token (NFT) offerings. However, the company’s NFT collections are unaffected by this move. It’s important to note that these are independent changes that we’re making to better position and safeguard our business. There’s no changes to our core product, Rollbit.com, $RLB, or our NFT collections. Rollbit announcement on X You might also like: New-Age Crypto Casino Rollbit Launches Cryptocurrency Trading Razer announced Rollbit’s degen exchange on Aug. 17 with five pilot tokens including the casino’s own token RLB, OPNX’s OX coin, Telegram bot UNIBOT, and BITCOIN (not to be confused with crypto’s leading token). “Buying and selling tokens shouldn’t be complicated”, Razer said at the time, adding that Rollbit’s exchange aimed to become “the crypto platform for everything” by banking on an automated market maker system and increasing trending token liquidity. It’s likely that declining interest in speculative tokens and altcoins resulted in debilitated user activity on Rollbit’s degen exchange. However, it’s unclear what specific regulatory U-turn occurred in a month to prompt a rethink from Rollbit. The platform which launched in February 2020 is one of the largest crypto casinos in the market at press time. One of Rollbit’s rivals, Stake, suffered a cyber attack reportedly launched by North Korea’s Lazarus. Lazarus reportedly stole $41 million in digital assets from Stake before bridging the funds to other networks and launching other exploits like the CoinEx hack. Read more: North Korean hackers actively launder Stake’s $3.6m Follow Us on Google News",
    "tags": [
      "#NFT",
      "#Rollbit Coin"
    ],
    "publishDate": "23/09/2023"
  },
  {
    "id": 72,
    "title": "Nearly 95% of NFTs are now worthless, report says Nearly 95% of NFTs are now worthless, report says",
    "absoluteURL": "https://crypto.news/nearly-95-of-nfts-are-now-worthless-report-says/",
    "fullContent": "Almost 70,000 collections of NFTs now have no market value, dappGambl estimated in a recent report. The non-fungible tokens (NFT) market is going through hard times, as 69,795 out of 73,257 digital collections have a market cap of 0 Ethereum (ETH). According to a report by dappGambl, only 20% of the identified collections have full ownership. It means nearly 80% of all NFT collections “have remained unsold.” “This situation is telling of a significant imbalance between the creation of new non-fungible tokens (NFTs) and the actual demand for these digital assets in the current market landscape.” dappGambl The report doesn’t specify which NFT collections have been overviewed but says NFT Scan provided the data. The firm believes that many NFT collections face difficulties with adoption due to the lack of clear use cases, compelling narratives, or genuine artistic value. You might also like: SEC charges ‘Stoner Cats’ NFT creators for selling unregistered securities As per dappGambl’s estimations, around 195,699 NFT collections have no apparent owners, while the energy required to mint these digital tokens is comparable to the carbon footprint of 4061 passengers flying from England to New Zealand. The chart of NFT collections grouped by their floor price | Source: dappGambl DappGambl also found that slightly more than 40% of the top NFTs have a floor price between $5 and $100, while 18% of digital collectibles have no price. Only less than 1% of NFTs have a price tag of over $6,000, the report pointed out. Analysts at dappGambl say the data show that the NFT market is now mainly controlled by “speculative and hopeful pricing strategies that are far removed from the actual trading history of these assets.” Current state of NFT market The market has seen better days as many NFT-related startups have faced difficulties recently. For example, Glass Protocol, a video platform startup, has recently suspended its development, citing a lack of “sustainable demand for video NFTs.” Another NFT startup Voice, initially planned as a decentralized social media network, also stopped offering its services amid regulatory roadblocks. https://twitter.com/DoveyWan/status/1704055311621882301?s\u003d20 Dovey Wan, the founder of Primitive Ventures, said in a recent X post that the market crisis has also hit crypto unicorns. He hinted that OpenSea is now seeking fresh capital at a $1.2 billion valuation marketplace, down 90% from the $13 billion it had in early 2022. Read more: Magic Eden adds support for Solana-powered compressed NFTs Follow Us on Google News",
    "tags": [
      "#Bear Market",
      "#Ethereum",
      "#NFT"
    ],
    "publishDate": "21/09/2023"
  },
  {
    "id": 73,
    "title": "Ukraine includes crypto exchange and blockchain auditor in top IT firms list Ukraine includes crypto exchange and blockchain auditor in top IT firms list",
    "absoluteURL": "https://crypto.news/ukraine-includes-crypto-exchange-and-blockchain-auditor-in-top-it-firms-list/",
    "fullContent": "Ukraine’s Ministry of Digital Transformation hopes the list will expand the Ukrainian IT ecosystem internationally. The Ministry of Digital Transformation of Ukraine and ІТ Ukraine Association released a list of Ukrainian top IT companies to boost local products globally. Among 96 startups and product companies on the list, the ministry also included four crypto-and-blockchain-related Ukrainian companies: Kuna, a crypto banking B2B platform (previously operated as a crypto exchange) founded by Mykhailo Chobanian in 2014; Hacken, a blockchain security auditor founded by Dmytro Budorin in 2017; Lawyerd, a blockchain-based platform for brand protection founded by Igor Hludov and Igor Makushinsky in 2020; V-Art, a blockchain-based licensing platform with support for non-fungible tokens (NFTs) founded by Anastasiia Gliebova, Anton Velychko, Oleksandr Velychko, Olga Simson, and Roman Minin in 2020. You might also like: Ukraine probes local crypto exchanges for tax dodging Although Ukraine’s deputy prime minister Mykhailo Fedorov admitted that the country is now “betting on developing defense tech solutions,” he also added Ukraine has become “the best test ground for all the newest technologies.” “Ukraine is proud to be a homeland for hundreds well-known IT companies and startups, which managed to develop \u0026 scale even in war time conditions, during blackouts and missile attacks.” Mykhailo Fedorov Meanwhile, the Ukrainian crypto market is struggling to survive as the National Bank of Ukraine (NBU) has allegedly adopted an unspoken ban on all banking operations related to crypto. In April 2022, Ukraine’s central bank banned the purchase of cryptocurrency using Ukrainian hryvnia, the national currency of Ukraine, invoking martial law. In March 2023, Kuna CEO Mykhailo Chobanian told UBR.ua in an interview that the NBU actually “killed the crypto market” to crack down on money laundering schemes and illegal online casinos in Ukraine. Read more: Ukraine declares intention to adopt Europe’s MiCA regulations Follow Us on Google News",
    "tags": [
      "#Blockchain",
      "#NFT",
      "#Startup",
      "#Ukraine"
    ],
    "publishDate": "20/09/2023"
  },
  {
    "id": 74,
    "title": "Honda to launch NFTs at Japanese Formula 1 Honda to launch NFTs at Japanese Formula 1",
    "absoluteURL": "https://crypto.news/honda-to-launch-nfts-at-japanese-formula-1/",
    "fullContent": "In celebration of its Formula 1 legacy, Honda Motor Co plans to distribute special edition NFTs to fans during upcoming races in Japan. According to a recent Animoca Brands announcement, the Formula 1 Honda \u0026 Red Bull Welcome Event in Tokyo on Sept. 20, Honda will distribute limited-edition NFTs to all attendees. Fans must enter a lottery to purchase event tickets to be eligible for the exclusive digital collectibles. Honda partnered with Animoca Brands Japan, Gryfyn, and GET Protocol to launch Honda KEY NFTs at the Japanese Grand Prix from Sept. 21-24. Fans who visit the Honda booth at the Suzuka Circuit can redeem the NFTs and other rewards. The Honda KEY will unlock special access and perks at future Honda events and collaborations. These tokens are digital keys or passes that provide holders VIP experiences, exclusive content, and other benefits. Gryfyn, a subsidiary of Animoca Brands focused on connecting brands to fan communities, will host the Honda KEY NFTs in its digital wallet. A crypto wallet lets users securely store digital assets like NFTs and cryptocurrencies. Gryfyn’s wallet will allow fans to access their Honda NFT rewards conveniently. You might also like: Formula One team, Red Bull Racing Honda, partners with Tezos to create NFT platform GET Protocol, which recently helped the Dutch Grand Prix launch ticket-linked NFTs, will assist Honda with the NFT gifting. GET Protocol mints NFTs representing event tickets, combating scalping and fake tickets. The NFT tickets create collectible memorabilia for attendees. As Honda’s Formula 1 chapter ends, the company embraces web3 technology to honor its motorsport legacy and create lasting connections with fans. Japan\u0027s Honda Motor said it is quitting Formula 1 to focus on developing zero-emission technology https://t.co/h8vHAz8DfF pic.twitter.com/cIHxdnWOAe — Reuters (@Reuters) October 2, 2020 The limited-edition NFTs will serve as digital memorabilia for those who participated in the memorable Japanese events. Web3 refers to the next evolution of internet technology built on blockchains and decentralized applications. NFTs and crypto wallets are examples of web3 innovation. Honda’s partnership builds on the relationship between Formula 1 team Red Bull Racing and the Tezos blockchain. As reported in 2021, Tezos was named the official blockchain for the Red Bull Racing Honda team to build an NFT platform for fan engagement. Red Bull cited Tezos’ energy efficiency and carbon neutrality as key factors in the decision, aligning with the racing team’s environmental goals. Blockchains like Tezos use an energy-efficient consensus mechanism called proof-of-stake that does not require intensive computing power or specialized hardware for block generation. Read more: Crypto casino seals $100m sponsorship for Formula 1 team Follow Us on Google News",
    "tags": [
      "#Formula 1",
      "#Honda",
      "#Japan",
      "#NFT"
    ],
    "publishDate": "19/09/2023"
  },
  {
    "id": 75,
    "title": "Block.one-backed social NFT platform Voice to cease operations Block.one-backed social NFT platform Voice to cease operations",
    "absoluteURL": "https://crypto.news/block-one-backed-social-nft-platform-voice-to-cease-operations/",
    "fullContent": "Voice has decided to wind down its business just two years after pivoting from a social network to an NFT platform. Voice was initially planned as a decentralized social media network but later “upgraded” into a non-fungible token (NFT) platform for creators. Now, it is winding down its services amid regulatory roadblocks. Today, we are sad to announce that we will be winding down operations at Voice over the coming months. — Voice (@VoiceHQ) September 13, 2023 In an X (formerly Twitter) thread, Voice said it will be “winding down operations” over the coming months, citing the ongoing uncertainty in the crypto and NFT market. The startup didn’t elaborate on the decision. Still, it believes in the “tremendous potential web3 holds to empower creators.” “At this point, we feel that it is in the best interest of Voice and its community to use the resources we have left to optimize our wind-down process for you.” Voice In the next few weeks, Voice will announce a service to bridge NFTs from its platform to self-custody wallets with support for public networks such as Ethereum, Polygon, or EOS. You might also like: SEC charges ‘Stoner Cats’ NFT creators for selling unregistered securities Bumpy road for Voice Voice was first teased in 2019 when Block.one, the company behind EOS, purchased the Voice.com domain name from MicroStrategy for a whopping $30 million in cash. Besides that investment, Block.one also put an additional $150 million toward the project costs. Originally, Voice was meant to be a decentralized social networking platform designed to revolutionize the social media ecosystem with blockchain technology. However, in January 2021, Block.one co-founder Dan Larimer parted ways with the company to focus more on creating “free market, voluntary solutions for securing life, liberty, property and justice for all.” In 2022, Voice CEO Salah Zalatimo wrote in a now-deleted blog post that the company would “upgrade” to a social platform “where users can create digital arts across all formats,” including NFTs. Since then, however, the platform failed to become a competitor to other NFT marketplaces such as OpenSea or Rarible. Read more: EOS Foundation suing Block.one for $1 billion commitment breach Follow Us on Google News",
    "tags": [
      "#Block.one",
      "#EOS",
      "#NFT",
      "#Voice"
    ],
    "publishDate": "14/09/2023"
  },
  {
    "id": 76,
    "title": "SEC charges ‘Stoner Cats’ NFT creators for selling unregistered securities SEC charges ‘Stoner Cats’ NFT creators for selling unregistered securities",
    "absoluteURL": "https://crypto.news/sec-charges-stoner-cats-nft-creators-for-selling-unregistered-securities/",
    "fullContent": "The Securities and Exchange Commission (SEC) now claims actress Mila Kunis’ “Stoner Cats” raised $8 million from selling unregistered securities in more than one US state. In a press release on Sep. 13, the SEC said Stoner Cats 2 LLC (SC2) sold 10,000 non-fungible tokens (NFTs) in 35 minutes and raised over $8 million in the process. The project failed to register these offerings which qualify as investment contracts, the SEC said citing the Howey test. The regulator further explained that “Stoner Cats” led investors to expect returns from secondary sales, suggesting that a successful animated series could increase the value of the NFTs. This points to how “Stoner Cats” was marketed. “Stoner Cats” creators agreed to a cease-and-desist order without admitting or denying fault. The PFP project will also pay $1 million in civil penalties within 14 days. Launched in July 2021, “Stoner Cats” debuted as an NFT project featuring a web series animated by Mila Kunis’ studio Orchard Farm Productions. Kunis voiced a character in the cartoon show alongside husband Ashton Kutcher and Ethereum co-founder Vitalik Buterin. Read more: Pop Star Katy Perry Collaborates With Theta Network to Launch NFTs In terms of marketing and sales approach, both of which were significant aspects in the SEC’s charges, “Stoner Cats” initiated its launch in a manner resembling Initial coin offerings (ICOs) from 2017. It’s worth noting that several other NFT projects adopted a similar approach. They sold NFTs while committing to fund their development roadmaps through these fundraisers. The recent settlement involving “Stoner Cats” could potentially foreshadow legal actions against other NFT projects. Gurbir S. Grewal, Director of the SEC’s Division of Enforcement, also hinted at the possibility of forthcoming lawsuits targeting similar projects. Regardless of whether your offering involves beavers, chinchillas, or animal-based NFTs, under the federal securities laws, it’s the economic reality of the offering – not the labels you put on it or the underlying objects – that guides the determination of what’s an investment contract and therefore a security. Gurbir S. Grewal, Director of the SEC’s Division of Enforcement In August 2023, the SEC charged Impact Theory, LLC with offering illegal securities in the form of NFTs. NFT proponents might argue that the two cases highlight uncertainty regarding how existing securities laws apply to blockchain-based digital collectibles. You might also like: OpenSea former exec imprisoned for NFT insider trading Follow Us on Google News",
    "tags": [
      "#NFT",
      "#Regulation",
      "#SEC"
    ],
    "publishDate": "14/09/2023"
  },
  {
    "id": 77,
    "title": "Milady developer steals $1m in fees, takes over X accounts Milady developer steals $1m in fees, takes over X accounts",
    "absoluteURL": "https://crypto.news/milady-developer-steals-1m-in-fees-takes-over-x-accounts/",
    "fullContent": "Charlotte Fang, creator of the NFT project Milady Maker, has disclosed a $1 million embezzlement by a developer linked to the Bonkler project. The creator of the non-fungible token (NFT) project Milady Maker, Charlotte Fang, revealed that a developer embezzled $1 million in generated fees, stating that the rogue actor and other individuals involved will face the full wrath of the law. https://twitter.com/CharlotteFang77/status/1701245168039452947?t\u003diQT4x4k58gjLL82sOTY4lQ\u0026s\u003d19 Tweeting about the incident on Sept. 11, Fang said that the developer worked on the Bonkler project. She stated that the theft affected fees generated by Remilia — the decentralized autonomous organization (DAO) responsible for the Milady Maker project — from Bonkler. Fang also assured that Remilia’s reserves and users’ assets were safe from the attack. You might also like: Elon Musk’s tweet sends milady coin’s price soaring over 3000% In addition to the theft, the developer also seized codebases and connived with other individuals to attempt to take control of the platform’s social media accounts. They succeeded in taking control of X accounts MiladyMaker and Remilioniare while locking out RemiliaCorp. The creator asked users to treat the accounts as “compromised” and provided new X official handles. Fang said the perpetrators have been identified, stating they have also been terminated from Remilia Corporation. She also added that the Remilia team will take legal action against the individuals and demand a full refund of all stolen property. “For such viciousness, I can give no quarter—the individuals involved have been terminated from Remilia Corporation, and will now be dealt with through the heavy hand of the law.” Milady’s Charlotte Fang on X Read more: NFT theft decreased 20% in July: report Follow Us on Google News",
    "tags": [
      "#NFT",
      "#Security",
      "#Twitter"
    ],
    "publishDate": "13/09/2023"
  },
  {
    "id": 78,
    "title": "Sony to build a blockchain for web3 infrastructure with Startale Labs Sony to build a blockchain for web3 infrastructure with Startale Labs",
    "absoluteURL": "https://crypto.news/sony-to-build-a-blockchain-for-web3-infrastructure-with-startale-labs/",
    "fullContent": "Sony and Startale Labs are entering into a joint venture agreement to develop a blockchain that could become the backbone of global web3 infrastructure. The joint venture company will be established under the name “Sony Network Communications Labs Pte. Ltd.” Collaborating more deeply According to the press release shared with crypto.news, the companies believe in the potential of web3 and plan to “create killer web3 use cases to drive” its adoption. This announcement comes after the capital partnership Startale Labs and Sony Network Communications established in June and will be, as Sota Watanabe, the CEO of Startale Labs highlights, a deeper collaboration. You might also like: Web3 adoption would be impossible without intuitive UX and convenience | Opinion As a part of this new endeavor, both firms will share their respective assets and knowledge to co-develop leading blockchains and their ecosystem while simultaneously discerning web3 trends and driving them globally. “By combining Sony Network Communications’ experience in communication, IoT, AI, and solution services with Startale Labs’ insights and technical prowess in web3, we aspire to create a global infrastructure that underpins the web3 era, driving innovation across existing industries,” Jun Watanabe, president and representative director of Sony Network Communications said. Leveraging the industry’s best This announcement is not Sony’s first dip into web3 waters. In February 2023, the Japanese powerhouse also entered a partnership with Astar, a Japanese blockchain, as part of a web3 incubation program and Theta, the blockchain-enabled streaming platform that continues to be a long-standing partner of the company, as evidenced by their 3D NFT release in 2022. Read more: The rise of blockchain gaming in Asia has just begun | Opinion Follow Us on Google News",
    "tags": [
      "#NFT",
      "#Sony",
      "#Web3"
    ],
    "publishDate": "13/09/2023"
  },
  {
    "id": 79,
    "title": "Coinbase expands offerings with web3 wallet for institutional clients Coinbase expands offerings with web3 wallet for institutional clients",
    "absoluteURL": "https://crypto.news/coinbase-expands-offerings-with-web3-wallet-for-institutional-clients/",
    "fullContent": "Coinbase has introduced a web3 wallet through its Coinbase Prime division, aiming to provide institutional clients with secure access to crypto, NFTs, and defi applications. Coinbase, the biggest US-based crypto exchange, diversified its offerings on Tuesday with a web3 wallet designed for institutional clients. Introduced through its Coinbase Prime division, the wallet plans to provide an entry point for professional organizations into non-fungible tokens (NFTs) and the broader landscape of decentralized finance (defi). https://twitter.com/CoinbaseInsto/status/1701622249017532898?s\u003d20 The wallet allows institutional clients to access and manage a variety of digital assets, including cryptocurrencies, NFTs, and decentralized applications (dapps). While retail consumers have been active in these decentralized ecosystems for some time, institutions are only now starting to engage more broadly with them. Kevin Johnson, the vice president of institutional sales and trading at Coinbase, stated that the wallet was developed in response to increased interest from corporations in safely participating in on-chain activities, such as NFT drops and decentralized autonomous organizations (DAOs). You might also like: Coinbase Global to launch lending platform for institutional investors According to Coinbase, the platform also enables institutions to store tokens from supported blockchain networks securely. It gives clients self-custody access to their funds, allowing direct interactions with dapps and smart contracts. Johnson noted that the wallet is designed to integrate with existing Coinbase Prime accounts to maintain uniform safety measures. https://twitter.com/CoinbaseInsto/status/1701622254444941438?s\u003d20 An additional feature is the ability to implement multi-user setups with different permissions and configurations. This is particularly relevant for institutional clients who require multiple team members to manage digital assets. While this offers a layer of internal control over who can access and make decisions related to the stored assets, it’s essential to note that the effectiveness of such features would still be subject to the institution’s own governance protocols. Read more: Coinbase Collaborates with BlackRock to Offer Crypto Services to Institutional Clients Follow Us on Google News",
    "tags": [
      "#Coinbase",
      "#DeFi",
      "#NFT",
      "#Web3"
    ],
    "publishDate": "13/09/2023"
  },
  {
    "id": 80,
    "title": "Europol slams DeFi over high criminal activity Europol slams DeFi over high criminal activity",
    "absoluteURL": "https://crypto.news/europol-slams-defi-over-high-criminal-activity/",
    "fullContent": "International crime-fighting agency Europol has praised blockchain’s security, but also highlighted high criminal activity in decentralized finance. Europol, the EU law enforcement organization, has published its first European Financial and Economic Crime Threat Assessment. It describes an in-depth assessment of the threats posed by cybercriminals at the European level. Besides financial crimes in traditional finance, Europol also addressed in the document the illicit use of cryptocurrencies. Although the agency praised blockchain for its independence and security, Europol criticized decentralized finance (DeFi). The agency believes the lack of crypto regulation “leaves openings for economic crime since criminals hold illicit assets on DeFi platforms.” “The use of cryptocurrencies for criminal schemes is also increasing in line with their overall adoption rate.” Europol You might also like: DeFi group urges UPSTO to protect crypto from patent trolls However, Europol pointed out that the illicit use of crypto still represents “less than one percent of the overall transaction volume.” In addition to DeFi, the agency addressed wide-scale scams involving non-fungible tokens (NFTs). Europol says NFTs pose a “significant risk of money laundering due to their instant trading feature across borders.” DeFi TVL. Source: DeFiLlama Although DeFi has become hot for hackers and scammers, on-chain data indicates a steady decline in the total value locked among all DeFi protocols. According to DeFiLlama data, DeFi’s TVL is set at $37.3 billion as of press time, which is near levels last seen in February 2021. In July, the U.S. Senate proposed a strict bill for DeFi regulation that the crypto community criticized. Shortly after the proposal, the Blockchain Association slammed the new bill, calling it incompatible with the industry as it pressures the DeFi protocols to collect user data. Read more: Europol, US and Germany make €46m ChipMixer bust Follow Us on Google News",
    "tags": [
      "#DeFi",
      "#Europol",
      "#NFT"
    ],
    "publishDate": "12/09/2023"
  }
]