[
  {
    "id": 1,
    "title": "OKX NFT Marketplace Sets New Standard in Daily Trading Volumes, Surpassing Blur and OpenSea",
    "absoluteURL": "https://www.todaynftnews.com/okx-nft-marketplace-sets-new-standard-in-daily-trading-volumes-surpassing-blur-and-opensea/",
    "fullContent": "SNEAK PEEK OKX NFT Marketplace, a subsidiary of the crypto exchange OKX, reached a monumental $50 million in trading volume within just 24 hours. This significant achievement eclipsed the combined trading volumes of competitors Blur, Magic Eden, and OpenSea, which totaled around $24 million. The surge in OKX NFT Marketplace’s trading activity follows its recent integration of Bitcoin Ordinals trading, marking a strategic and successful move. The digital trading realm witnessed a significant shift as OKX NFT Marketplace, a renowned crypto exchange OKX subsidiary, soared to new heights in daily trading volumes. On December 18, this bustling marketplace registered an impressive $50 million in trades within 24 hours. This feat notably eclipsed the combined efforts of its closest competitors, Blur, Magic Eden, and OpenSea, who collectively achieved around $24 million in the same timeframe. This remarkable surge in trading volume at OKX NFT Marketplace comes after its recent integration of Bitcoin Ordinals trading. This strategic move has catalyzed a spike in activity, aligning with broader market trends that saw a remarkable week for Bitcoin network sales. According to data from NFT tracker CryptoSlam, the Bitcoin network alone amassed a staggering $367 million in sales volume over the past week, outpacing the combined weekly books of Ethereum and Solana, which stood at $91 million. Guess which #Bitcoin NFT collections are in the gallery 🎨👇   ________________ ╱| ______________ ╱| | |🟧🟧🐸🟧🟧|  | | |🟧🐀🟧🗺️🟧|  | | |🦧🟧👨‍🦲🟧🪨|  | |╱ ￣ ￣￣💃￣ ￣ |╱ ￣￣🚶￣￣👫￣ — OKX (@okx) December 18, 2023 The dominance of OKX NFT Marketplace on December 18 is a testament to its growing influence in the NFT sector. While the trading volume slightly dipped to $35 million later today, the platform’s performance remains a clear indicator of its emerging leadership. Moreover, the broader NFT market is also witnessing a resurgence. November saw the collective volume of the NFT space approaching the $1 billion mark. Notably, the average value of NFT transactions in this period shot up by 114%, escalating from $126 to $270. This trend highlights growing confidence among traders, signalling a willingness to engage in higher-value exchanges compared to previous months. OKX NFT Marketplace’s achievement is more than a mere numerical triumph. It underscores a shift in trader preference and market dynamics within the NFT space. As the marketplace continues to innovate and adapt, its impact on the digital trading landscape is poised to expand, marking a new era of NFT trading that aligns with evolving consumer behaviours and market trends.",
    "tags": [
      "#NFT Marketplace",
      "#OKX Exchange",
      "#OpenSea"
    ],
    "publishDate": "19/12/2023"
  },
  {
    "id": 2,
    "title": "BetFury Launches Exclusive NFT Lootboxes",
    "absoluteURL": "https://www.todaynftnews.com/betfury-launches-exclusive-nft-lootboxes/",
    "fullContent": "SNEAK PEEK BetFury has introduced NFT Lootboxes, marking its entry into the NFT ecosystem. Players have a chance to win rare NFTs and other rewarding prizes. NFT Lootboxes on BetFury offer over a 90% chance of winning a profitable prize, distinguishing them in the crypto space. BetFury has rolled out its latest offering, NFT Lootboxes, marking the platform’s entry into the NFT ecosystem. These Lootboxes promise a chance to win rare NFTs and a slew of other lucrative rewards. For a mere few dollars, players have the opportunity to become the first fortunate winners of coveted art masterpieces. Lootboxes, a popular feature in the gaming world, have made their way into the crypto industry. BetFury has taken this concept and elevated it by incorporating high-quality NFTs as the main rewards. What sets these NFT Lootboxes apart is their impressive over 90% chance of winning a profitable prize, making them a simple yet rewarding addition to the platform. Rewards Inside the Lootboxes BetFury’s NFT Lootboxes offer a variety of rewards, each with a different probability of dropping NFTs. Besides the chance to win NFTs, players can also get rewards such as BTC, ETH, USDT, BNB, TRX, free spins for various games, free bets for sports betting, and the platform’s native token, BFG. While standard NFT Lootboxes guarantee prizes, the premium ones may have a sector without a reward, but even this occurs with only a 1% probability. The chances of leaving empty-handed are minimal, and users can explore the Lootboxes through a demo spin before diving into real-money gameplay. Epic Win: Realizing Profits A recent success story on BetFury involves a user winning Bored Ape Yacht Club #5663. Despite a slim 0.77% chance of success, the $1,657 spin resulted in an NFT worth an impressive $76,545. This triumph showcases that NFT Lootboxes can indeed deliver substantial profits, enabling users to achieve remarkable success. The allure of NFT Lootboxes lies in the opportunity to obtain some of the rarest NFTs on the market, presenting an exclusive chance to acquire valuable items for just a few dollars. BetFury’s Lootboxes feature blue-chip collections, including Wrapped Cryptopunks, Bored Ape Yacht Club, Azuki Originals, Mutant Ape Yacht Club, Pudgy Penguins, DeGods, and many more. BetFury offers a range of NFT Loot Boxes catering to different budgets and preferences, allowing users interested in rare NFTs and other luxury rewards to choose options that suit their preferences. BetFury stands as an ecosystem of crypto products designed for entertainment and additional income. With its native BFG token, listed on major crypto exchanges, BetFury offers over 8,000 slots and original games, 80+ sports options, and lucrative bonuses, making it a comprehensive platform for crypto enthusiasts seeking both entertainment and financial gains.",
    "tags": [
      "#Blockchain",
      "#NFT market"
    ],
    "publishDate": "19/12/2023"
  },
  {
    "id": 3,
    "title": "Blockchain Networks Face Unprecedented Surge in Transaction Fees Amidst EVM Inscription Boom",
    "absoluteURL": "https://www.todaynftnews.com/blockchain-networks-face-unprecedented-surge-in-transaction-fees-amidst-evm-inscription-boom/",
    "fullContent": "SNEAK PEEK The Ethereum Virtual Machine (EVM) ecosystem witnessed a significant rise in transaction fees, driven by growing interest in EVM inscriptions. Gas fees reached record highs, with Dune Analytics reporting costs of $8.3 million on December 16, predominantly in Avalanche and Arbitrum One networks. Arbitrum One faced a 78-minute outage, illustrating the strain of increased inscription activity on blockchain infrastructures. The digital landscape of blockchain technology recently experienced a seismic shift, particularly in the Ethereum Virtual Machine (EVM) ecosystem, where a significant uptick in transaction fees was observed. This phenomenon, largely driven by the rapidly growing interest in EVM inscriptions, marked a notable milestone in blockchain activity over the past weekend. The rise in EVM chain activities led to a record-breaking increase in gas fees, with figures reaching a new zenith. According to the latest insights from Dune Analytics, the cost of inscriptions escalated to a staggering $8.3 million on December 16. Among the networks, Avalanche witnessed the heftiest gas expenses, accounting for more than $5.6 million that day. Not far behind, Arbitrum One recorded around $2.1 million in gas fees due to inscription activities. This trend transcended the Ethereum ecosystem, impacting the Bitcoin network as well. The surge in Bitcoin inscriptions led to a significant demand for block space, resulting in an extensive queue of almost 280,000 unconfirmed transactions. The heightened activity pushed Bitcoin transaction fees to a peak of $37, presenting a challenge for smaller, peer-to-peer transactions on the network. Top 10 Ordinal PFP Collections Ranked by Market Cap: RANK COLLECTION MCAP 1 Bitcoin Frogs $182.2M 2 OMB $79.3M 3 OCM Genesis $38.1M 4 Bitcoin Punks $29.4M 5… — Leonidas (@LeonidasNFT) December 17, 2023 The heightened inscription activity has been challenging. For instance, the Arbitrum One network grappled with a 78-minute outage on December 15, highlighting the stress these activities can place on blockchain infrastructures. Amid these developments, EVM inscriptions are gaining traction, similar to the Ordinals on the Bitcoin network. These inscriptions involve embedding unique information within transaction call data to create distinct, on-chain, nonfungible tokens (NFTs). The interest in this area is palpable, evidenced by the Bitcoin Frogs Ordinals collection’s market capitalization soaring to $182 million. Industry veterans, including Bitcoin pioneer Adam Back, view these developments as a vital push towards innovation in blockchain technologies, especially in layer-2 solutions. This sentiment is mirrored within the blockchain community, with enthusiasts and developers exploring new applications and capabilities of these platforms. The recent events in the blockchain sector underscore a pivotal evolution, with EVM inscriptions at the forefront. This movement highlights the escalating fascination with NFTs and digital collectibles and emphasizes the necessity for scalable and robust network solutions to cater to the increasing demand. As blockchain technology evolves, it paves the way for the next chapter of digital innovation and exploration.",
    "tags": [
      "#Blockchain",
      "#NFT market"
    ],
    "publishDate": "18/12/2023"
  },
  {
    "id": 4,
    "title": "Millions of Dollars in NFTs Stolen from Trader, Stolen Apes Returned After Bounty Payment",
    "absoluteURL": "https://www.todaynftnews.com/millions-of-dollars-in-nfts-stolen-from-trader-stolen-apes-returned-after-bounty-payment/",
    "fullContent": "SNEAK PEEK Hackers who infiltrated NFT Trader and stole valuable digital assets, including Bored Ape and Mutant Ape Yacht Club NFTs, were swiftly countered The incident demonstrated the strong unity and proactive approach within the NFT community. The breach exposed weaknesses in NFT trading platforms, leading to calls for enhanced security Hackers proactive approach within the NFT community In a striking turn of events, the NFT community witnessed a remarkable recovery of stolen digital assets. Recently, hackers infiltrated NFT Trader, a prominent peer-to-peer trading platform, pilfering a significant collection of nonfungible tokens (NFTs). Among the spoils were 37 Bored Ape Yacht Club (BAYC), 13 Mutant Ape Yacht Club (MAYC) tokens, and other valuable NFTs like VeeFriends and World of Women. Nearly $3 million theft left the digital art world in shock. Congratulations to the @BoringSecDAO in getting back those Apes. 🦍 Well done. ✅🎉🙌🏻 @BoredApeYC pic.twitter.com/brVGQ58Sg2 — realniceguy.eth ❄️🍌 (@realniceguy_SRH) December 17, 2023 However, the story took an unexpected twist. Boring Security, a Web3 security project, orchestrated a swift and effective response. They collaborated with Greg Solano, co-founder of Yuga Labs – the creator of BAYC and MAYC. Together, they strategised a resolution that involved a bounty payment. Their efforts bore fruit, and within 24 hours, all stolen NFTs were recovered. In exchange for the digital assets, the hackers received a 120 Ether (ETH) bounty, valued at approximately $267,000. This operation’s success hinged on the swift action and collaborative spirit within the NFT community. The gesture by Solano to finance the bounty and the proactive approach by Boring Security underscored resilience and unity in the face of adversity. It vividly demonstrated the community’s determination to uphold Security and integrity in the burgeoning NFT space. Meanwhile, the incident exposed vulnerabilities in NFT trading platforms, prompting urgent calls for enhanced security measures. Users were advised to revoke permissions granted to two specific old contracts, identified as potential gateways for similar attacks. This precaution was crucial in preventing further unauthorized NFT transfers. The NFT Trader team, aided by a developer known as Foobar, addressed the breach promptly. Their efforts highlighted the ongoing challenges and the need for continual vigilance in the dynamic world of digital asset trading. As the NFT market evolves, this incident serves as a stark reminder of the importance of robust security measures and the power of community collaboration in safeguarding valuable digital assets.",
    "tags": [
      "#BAYC",
      "#Hacking",
      "#MAYC",
      "#NFT Trader"
    ],
    "publishDate": "18/12/2023"
  },
  {
    "id": 5,
    "title": "Sotheby’s Auction of Bitcoin NFTs Surpasses Expectations, Fetches $450,000",
    "absoluteURL": "https://www.todaynftnews.com/sothebys-auction-of-bitcoin-nfts-surpasses-expectations-fetches-450000/",
    "fullContent": "SNEAK PEEK Sotheby’s recently hosted its inaugural auction of NFTs on the Bitcoin blockchain, marking a significant milestone in the worlds of art and cryptocurrency. The auction featured “BitcoinShrooms,” a collection of pixelated images, which collectively garnered an impressive $450,000, far exceeding initial estimates. A standout piece in the collection, resembling a character from the Super Mario series, was sold for an astonishing $240,000. In a historic moment for the world of art and cryptocurrency, Sotheby’s recently held its first-ever auction of NFTs on the Bitcoin blockchain, featuring a collection of pixelated images known as “BitcoinShrooms.” The results were nothing short of astonishing, as the three images on offer collectively garnered a staggering $450,000, surpassing estimates by a factor of five. The auction concluded on Wednesday and featured a trio of digital artworks, with one standout piece resembling a mushroom character from the iconic Super Mario franchise fetching an astounding $240,000. Another image, a pixelated avocado titled “BIP39 SEED,” originally expected to sell for $20,000 to $30,000, stunned observers by selling for $101,600. This auction was even more remarkable because over two-thirds of the bidders were new to the Sotheby’s platform, indicating a growing interest in NFTs on Bitcoin. This surge in popularity harkens back to the frenzy that engulfed digital-asset markets a couple of years ago when NFTs and digital artwork first started commanding eye-popping prices. Notably, one NFT by artist Beeple fetched an astonishing $69 million at Christie’s auction house. However, many of those NFT collections were built on the Ethereum blockchain, making Sotheby’s Bitcoin NFT auction a unique event. The “BitcoinShrooms” collection is credited to the pseudonymous artist Shroomtoshi and is part of the Ordinals inscriptions, a technology Casey Rodarmor developed atop the Bitcoin blockchain late last year. These inscriptions have gained popularity, causing congestion and increased fees on the Bitcoin network. The success of this auction raises an interesting debate within the Bitcoin community about whether to filter out transactions related to NFT-like inscriptions. Some argue that these inscriptions need to align with the original vision of Bitcoin as a peer-to-peer payment network. However, the perceived value of these digital images as high art could shift the balance in favour of profit interests. Sotheby’s groundbreaking auction of NFTs on the Bitcoin blockchain has demonstrated the mainstream appeal of these digital collectibles. With new bidders flocking to the platform and record-breaking sales, the intersection of art and cryptocurrency is evolving in exciting and unexpected ways.",
    "tags": [
      "#Bitcoin",
      "#Blockchain",
      "#NFT market"
    ],
    "publishDate": "16/12/2023"
  },
  {
    "id": 6,
    "title": "Polygon Joins Forces with The Sandbox for Lower Fee NFT Trading",
    "absoluteURL": "https://www.todaynftnews.com/polygon-joins-forces-with-the-sandbox-for-lower-fee-nft-trading/",
    "fullContent": "SNEAK PEEK The Sandbox has launched its NFT marketplace on the Polygon network, making it more accessible and cost-effective for users. Users can now mint digital assets using CATALYSTs on this new platform, democratizing the NFT creation process. The introduction of a secondary market allows for the resale of ASSETs, broadening trading and monetization opportunities. The Sandbox, a prominent player in the world of NFTs and virtual metaverse creation, has taken a significant stride towards enhancing accessibility and reducing costs for creators and users. The latest development sees the launch of The Sandbox Marketplace on Polygon, a move that promises to reshape the NFT landscape. One of the most notable features of this launch is the ability for anyone to mint their digital assets (ASSETs) on the Polygon marketplace using CATALYSTs. This democratizes the NFT creation process, making it accessible to a broader audience. Notably, Polygon’s network significantly reduces transaction fees, addressing a long-standing concern in the NFT space. Furthermore, The Sandbox introduces a secondary market, allowing NFT owners to resell ASSETs that they didn’t originally create on the platform. This opens up new avenues for trading and monetizing digital collectibles. For those already holding CATALYSTs, minting on the Polygon marketplace becomes readily accessible. But what if you don’t have CATALYSTs yet? The Sandbox plans to distribute CATALYSTs to ecosystem contributors, including LAND owners, as part of their commitment to expanding opportunities for creators. Existing ASSET holders need not worry about the fate of their assets. Minted assets on the Ethereum chain will remain usable and can be bridged to the Polygon layer in the future. Non-minted assets, like equipment, will be migrated to align with the new structure, ensuring a smooth transition for users. Gas fees have long been a concern for NFT enthusiasts, but The Sandbox addresses this by significantly reducing fees on the Polygon marketplace. Additionally, they cover a portion of Polygon transaction fees for users across their ecosystem, enhancing affordability. The user interface of the marketplace has undergone a revamp, with improved asset upload flows, asset moderation, and an enhanced user experience. This ensures a seamless and efficient trading experience for users. To buy your first NFT on Polygon via The Sandbox Marketplace, you need to log in, connect your wallet to the Polygon network, browse the marketplace, select your desired NFT, and complete the purchase. The process is streamlined, making it accessible to both newcomers and seasoned collectors. As The Sandbox expands its metaverse and NFT offerings, creators are encouraged to participate in VoxEdit contests and contribute to the vibrant community. The launch of the new marketplace also comes with a captivating collection from 30 talented artists, adding to the diversity of available ASSETs. The Sandbox’s move to launch its marketplace on Polygon opens up exciting opportunities for creators and collectors alike. With reduced fees, improved user experience, and a commitment to accessibility, it marks a significant step forward in the ever-evolving world of NFTs.",
    "tags": [
      "#NFT market",
      "#Polygon",
      "#The Sandbox"
    ],
    "publishDate": "15/12/2023"
  },
  {
    "id": 7,
    "title": "Casio Unveils Virtual G-Shock Watches as Ethereum NFTs with Exclusive Perks",
    "absoluteURL": "https://www.todaynftnews.com/casio-unveils-virtual-g-shock-watches-as-ethereum-nfts-with-exclusive-perks/",
    "fullContent": "SNEAK PEEK Casio, a Japanese electronics giant, ventures into the NFT space with a limited-edition collection of digital art featuring their iconic G-Shock brand. The NFT offering includes 2,000 art pieces showcasing futuristic “Virtual G-Shock” designs, priced at 0.1 ETH each. The company hints at potential collaborations with NFT holders for co-creating new digital Casio products. Japanese electronics giant Casio has made a bold move into the world of NFTs, offering a limited-edition collection of digital art collectibles featuring their iconic G-Shock brand of watches. This marks Casio’s second venture into the NFT space, following the successful debut of free G-Shock Creator Pass NFTs on the Ethereum scaling network Polygon back in September. The latest offering consists of 2,000 NFT art pieces, showcasing two futuristic and imaginative “Virtual G-Shock” designs. These designs push the boundaries of what’s possible with traditional physical materials and offer collectors a unique digital experience. Priced at 0.1 ETH each, roughly equivalent to $230 at the time of writing, the 1,000 editions of each Virtual G-Shock design promise more than just digital art. Owners of these Ethereum NFTs will enjoy a range of exclusive benefits, including behind-the-scenes access to Casio. They will have the opportunity to tour the G-Shock Endurance Test Laboratory in Tokyo, where they can witness the rigorous durability testing that has made the G-Shock brand legendary. Additionally, NFT collectors will participate in roundtable discussions with Casio’s designers, gaining insight into the creative process behind the virtual G-Shock models. They will also receive exclusive design materials associated with these digital watches and will be given the first right to purchase the next wave of Virtual G-Shock NFTs. Casio has even hinted at potential future collaborations with NFT holders to co-create new digital Casio products, demonstrating their commitment to digital and physical innovation. Oh Takahashi, Casio’s Senior General Manager of Timepieces, expressed the company’s dedication to deepening its engagement with the G-Shock community, stating, “These special incentives for collectors show our passion for innovation in both the digital and physical realms. We aim to deepen our engagement with the G-Shock community, bringing them into the heart of our innovation process.” With this move, Casio has joined the ranks of companies exploring the NFT space, offering enthusiasts not unique digital art but also exclusive experiences and opportunities, making it an exciting development for collectors and fans of the iconic G-Shock brand.",
    "tags": [
      "#Blockchain",
      "#Ethereum",
      "#NFT market"
    ],
    "publishDate": "15/12/2023"
  },
  {
    "id": 8,
    "title": "Web3 Chess Game Developer Discontinues Play-to-Earn Feature Amidst Rampant Cheating",
    "absoluteURL": "https://www.todaynftnews.com/web3-chess-game-developer-discontinues-play-to-earn-feature-amidst-rampant-cheating/",
    "fullContent": "SNEAK PEEK Immortal Game, a popular blockchain chess game, has announced the closure of its play-to-earn and NFT features. The decision was driven by widespread cheating, undermining the game’s integrity and player experience. This move has significantly impacted the play-to-earn gaming community and NFT market. Developers of the popular blockchain chess game Immortal Game have announced a significant decision that is sending shockwaves through the world of play-to-earn (P2E) gaming and nonfungible tokens (NFTs). In a surprising move, the creators have decided to shut down the P2E and NFT features of the Game due to a growing problem of rampant cheating. This move, announced on December 13, has left the gaming community in awe as Immortal Game was initially hailed as a pioneering platform aiming to provide players with a legitimate opportunity to earn income through chess. However, their noble intentions have backfired, leading to an influx of unfair practices and cheating within the Game. The root of the problem is the large sums of cash rewards offered with no entry barriers, which inadvertently encouraged players to exploit the system. In their announcement, immortal Game’s developers noted that this situation degraded the experience for genuine players who sought a fair and secure environment to enjoy online chess. Starting immediately, the marketplace for Immortal Game NFTs will be discontinued, and players will no longer be able to use the native P2E Checkmate token (CMT) within the Game. While NFTs will continue on the blockchain, users will no longer receive CMT rewards for participating in tournaments or daily challenges. Instead, fiat currency rewards may be introduced as an alternative. In a further adjustment, users will no longer see their ETH and CMT balances displayed on the platform, although these tokens will remain in their wallets. Those using custodial wallets must connect a personal wallet to facilitate asset transfers. Before its discontinuation, Immortal Game NFTs had amassed a lifetime trading volume of $885,600, while the CMT token boasted a fully diluted market capitalization of $360,075. These NFTs were minted on the Immutable blockchain, adding to the gaming landscape. This decision by Immortal Game’s developers marks a turning point in the P2E and NFT gaming industry, as it highlights the challenges and pitfalls associated with offering substantial financial incentives to players. It remains to be seen whether other projects in the space will follow suit or find innovative solutions to combat cheating while maintaining the allure of play-to-earn gaming.",
    "tags": [
      "#Blockchain",
      "#NFT market",
      "#Web3"
    ],
    "publishDate": "14/12/2023"
  },
  {
    "id": 9,
    "title": "NFT Division of Line Messenger Secures $140 Million Funding for Web3 Services",
    "absoluteURL": "https://www.todaynftnews.com/nft-division-of-line-messenger-secures-140-million-funding-for-web3-services/",
    "fullContent": "SNEAK PEEK Line Next, the NFT arm of Line, secures $140 million in funding for its global NFT marketplace, DOSI. Funding led by Crescendo Equity Partners, backed by Peter Thiel, showcases strong support for Line Next’s Web3 initiatives. DOSI integrates with Line’s existing Japan-based NFT marketplace, offering a comprehensive mobile app for worldwide NFT trading. Line Next, the NFT arm of the popular messaging app Line, has secured $140 million in funding as it gears up to launch a global NFT marketplace, DOSI, in January 2024. The funding round was led by Crescendo Equity Partners, a private equity firm backed by Peter Thiel. Line Next, dedicated to exploring Web3 initiatives, is poised to make waves in the NFT ecosystem with this substantial backing. DOSI, Line Next’s forthcoming global NFT marketplace, is set to integrate with Line’s existing Japan-based NFT marketplace, known as Line NFT. This integration will offer users an extensive and seamless NFT trading experience, all accessible through a mobile app that will be available worldwide. However, the ambitions of Line Next extend beyond just the NFT marketplace. Part of the $140 million fund will be allocated to the development of new Web3-focused services. Among these is a social app that enables users to interact with AI-generated characters, adding a unique twist to the social media landscape. Additionally, Web3 games will be part of Line Next’s repertoire, aiming to harness the power of blockchain technology for gaming enthusiasts. One notable aspect of Line’s NFT marketplace is its choice of blockchain technology. It will be built on the Finschia public blockchain, solidifying Line Next and Crescendo’s role as governance members of the Finschia Foundation. This strategic move positions Line Next to leverage the benefits of blockchain technology effectively. Shane Mac, co-founder of XMTP, emphasized the significance of Web3 messaging in a recent podcast, highlighting its potential to offer users greater control over their online interactions. Web3 messaging, he explained, represents a shift toward a new form of identity, where individuals have their wealth and personalities tied to wallet addresses. This innovative approach enhances security and trust in online communication. Line Next’s successful funding round and its upcoming NFT marketplace launch mark a significant development in the Web3 landscape. With a focus on AI-powered social apps and Web3 games, Line Next is poised to make waves in the NFT ecosystem and beyond. Utilizing blockchain technology further underscores the commitment to innovative solutions for the digital age.",
    "tags": [
      "#LINE App",
      "#NFT market",
      "#Web3"
    ],
    "publishDate": "13/12/2023"
  },
  {
    "id": 10,
    "title": "FIFA Set to Debut NFT Collection Ahead of 2023 Club World Cup",
    "absoluteURL": "https://www.todaynftnews.com/fifa-set-to-debut-nft-collection-ahead-of-2023-club-world-cup/",
    "fullContent": "SNEAK PEEK FIFA partners with Modex for its first NFT collection, set to launch on December 15. 100 exclusive NFTs offer a unique opportunity to secure tickets to the FIFA World Cup 2026 final. 900 digital collectibles on Polygon and OpenSea showcase memorable moments from the Club World Cup. FIFA, the international governing body for soccer, has announced its foray into the world of nonfungible tokens (NFTs), with an exclusive collection set to premiere just ahead of the 2023 Club World Cup in Saudi Arabia. In collaboration with blockchain firm Modex, FIFA’s inaugural NFT collection promises to offer fans an exciting opportunity. The collection, scheduled to launch on December 15, will consist of 100 NFTs, each of which grants the lucky owner a chance to secure tickets to the FIFA World Cup 2026 final—an enticing prospect for soccer enthusiasts worldwide. Additionally, 900 digital collectibles will be issued on the Polygon network and OpenSea this month. These NFTs will feature memorable moments from the tournament and digital renditions of coveted memorabilia. The FIFA Club World Cup, commencing on December 12 in Jeddah, Saudi Arabia, will bring together seven of the world’s finest football teams, including champions from FIFA’s six confederations. Fans eager to acquire these NFTs can do so via FIFA’s dedicated platform, FIFA+ Collect, launched in September 2022 and operates on the Algorand blockchain. Digital collectibles have rapidly gained popularity among sports enthusiasts, offering novel ways for fans to engage with their favorite players, teams, and the beautiful game. Francesco Abbate, CEO of Modex, expressed his enthusiasm, stating, “Digital collectibles increase how fans can interact with their favorite players, teams, and the game they love, and we’re honored to support FIFA in realizing this goal.” Since its inception, FIFA+ Collect has hosted 11 NFT drops, minting 909,255 digital collectibles held by 16,448 individuals. Notably, these NFTs have generated a trading volume of $2.4 million across primary and secondary NFT markets. FIFA+ Collect Info clarifies that the mint volume may include packs obtained through challenges rather than those purchased with USDC. This move by FIFA into the NFT space underscores the growing influence of blockchain technology in sports, offering fans unique opportunities to own digital pieces of soccer history while fostering a deeper connection with the sport they love. As the 2023 Club World Cup unfolds, the NFT world eagerly awaits the launch of this exclusive collection, setting a new precedent for the intersection of sports and blockchain technology.",
    "tags": [
      "#FIFA",
      "#NFT market"
    ],
    "publishDate": "13/12/2023"
  },
  {
    "id": 11,
    "title": "Former U.S. President Donald Trump Unveils NFT Collection with a ‘MugShot’ Theme",
    "absoluteURL": "https://www.todaynftnews.com/former-u-s-president-donald-trump-unveils-nft-collection-with-a-mugshot-theme/",
    "fullContent": "SNEAK PEEK Former President Trump announces his third NFT drop titled “MugShot,” depicting his historic arrest in 2023. Digital trading cards are available for $99; buyers of 47 or more cards can own Trump’s actual suit and dine with him at Mar-a-Lago. NFTs accessible through credit card or wETH, transferable on December 31, 2024; buyers must provide KYC information. Former U.S. President Donald Trump has announced his third nonfungible token (NFT) drop, titled “MugShot,” which revolves around his ongoing legal troubles. These unique digital trading cards are available for $99 each, with an intriguing incentive for buyers who acquire 47 or more cards: the chance to own a piece of President Trump’s actual suit from his infamous mugshot and enjoy dinner at Mar-a-Lago with the former president himself. What sets this NFT collection apart is its connection to a significant historical moment. On August 24, 2023, Donald Trump was formally arrested in Fulton County, Georgia, marking the first-ever mugshot of a United States President. In the arresting photo, Trump sports a furrowed brow and a determined gaze, symbolizing his unwavering spirit with the caption, “he’ll never surrender.” This NFT drop is accessible through credit card payments or Wrapped Ether (wETH), but there’s a catch. These digital assets will be transferable on December 31, 2024. Additionally, buyers must provide Know Your Customer (KYC) information, even if they opt to use cryptocurrency for their purchase. The “MugShot” NFT collection follows Trump’s two successful NFT launches. Notably, the former First Lady Melania Trump has also ventured into the NFT space with her collection. Trump decided to release this NFT collection as he seeks a non-consecutive second term in the 2024 U.S. presidential election. Currently facing 91 felony charges on allegations of business fraud and efforts to overturn the 2020 U.S. presidential election, it’s important to note that the U.S. Constitution does not automatically disqualify suspects or convicted individuals from running for federal office. Enforcing the 14th Amendment, which bars condemned insurrectionists from holding public office, would require congressional action. In the world of NFTs, where art and history intersect with digital innovation, President Trump’s “MugShot” drop adds another layer of intrigue and controversy, reflecting the ongoing narrative of his legal battles and political ambitions. This collection will draw attention and scrutiny as NFTs captivate the digital art world.",
    "tags": [
      "#Donald Trump NFT",
      "#NFT market"
    ],
    "publishDate": "13/12/2023"
  },
  {
    "id": 12,
    "title": "Yuga Labs Co-Founder Addresses Speculations About Their Return During Ongoing Health Hiatus",
    "absoluteURL": "https://www.todaynftnews.com/yuga-labs-co-founder-addresses-speculations-about-their-return-during-ongoing-health-hiatus/",
    "fullContent": "SNEAK PEEK Yuga Labs co-founder Wylie Aronow postpones return due to ongoing health recovery, prioritizing long-term well-being. Aronow, aka Gordon Goner, maintains a board role and strategic advisory position despite a congestive heart failure diagnosis. Despite health challenges, Aronow actively observes Yuga Labs’ operations, identifying key issues and suggesting changes. NFT entrepreneur Wylie Aronow, co-founder of Yuga Labs, has officially addressed rumors about his potential return to the NFT firm. Despite making steady progress in his health recovery, Aronow has firmly stated that he is not yet ready to return, emphasizing the importance of ensuring his long-term well-being. Aronow, who also goes by the name Gordon Goner, had taken a leave of absence from Yuga Labs in late January due to a congestive heart failure diagnosis. At that time, he clarified that he would continue to serve as a board member and strategic adviser to the company. In his recent statement, Aronow revealed the unpredictable nature of his health journey, describing days when he feels ready to dive back into work and others when he feels the need for immediate medical attention. While he has been away, Aronow has been watching Yuga Labs’ operations, responsible for popular NFT projects like Bored Ape Yacht Club (BAYC) and CryptoPunks. He has identified key issues hindering the company’s progress and has suggested necessary changes during board meetings. Despite his absence, Aronow expressed confidence in the current leadership of Yuga Labs, especially as the company faces a critical year in 2024. He believes the team is well-prepared to meet the challenges and impress the community. Before stepping back, Aronow acknowledged that he had pushed himself to the limits, working long hours nearly every day. He admitted that he should have heeded the advice of those around him and sought a better work-life balance. Yuga Labs has not stood still during Aronow’s absence, appointing Daniel Alegre, the former president and chief operating officer of Activision Blizzard, as its new CEO about a month before Aronow’s leave. In February 2021, Aronow co-founded Yuga Labs alongside Greg Solano, Zeshan Ali, and Kerem Atalay. The company’s portfolio includes notable NFTs such as CryptoPunks, BAYC, MeeBits, and Othersidemeta. Aronow’s commitment to his health and support to Yuga Labs from the sidelines highlight the resilience and determination of the entrepreneur and the NFT industry in navigating challenges and uncertainties.",
    "tags": [
      "#Blockchain",
      "#NFT market",
      "#Yuga Labs"
    ],
    "publishDate": "12/12/2023"
  },
  {
    "id": 13,
    "title": "South Korea Exempts NFTs and CBDCs from Cryptocurrency Interest Mandate",
    "absoluteURL": "https://www.todaynftnews.com/south-korea-exempts-nfts-and-cbdcs-from-cryptocurrency-interest-mandate/",
    "fullContent": "SNEAK PEEK Starting July 2024, South Korea’s FSC will enable investors to earn interest on digital asset deposits in exchanges. The directive excludes nonfungible tokens and central bank digital currencies from earning interest. Exchanges must segregate user deposits, entrust them to banks, and store 80% of coins in cold wallets. South Korea’s Financial Services Commission (FSC) has issued a new directive that will impact digital asset investors and exchanges in the country. According to the FSC’s notice, starting from July 2024, investors who deposit their digital assets into exchanges will be entitled to receive interest on their deposits. This move is part of South Korea’s efforts to regulate the crypto space more comprehensively. However, there are exceptions to this new rule. Nonfungible tokens (NFTs) and central bank digital currencies (CBDCs) have been excluded from the mandate. The FSC’s decision to exclude NFTs and CBDCs reflects the unique nature of these digital assets, which may not fit the criteria for interest-bearing deposits. Interestingly, the FSC has left room for potential exceptions to this exclusion. If certain NFTs are categorized as payment methods and are issued in significant quantities, they may be reclassified as virtual assets and become eligible for interest when deposited into exchanges. This shows the regulator’s flexibility in adapting to the evolving landscape of digital assets. In addition to addressing interest on deposits, the FSC has also laid out guidelines for the safe handling of user deposits by virtual asset operators. Exchanges are now required to segregate user deposits from their own assets and entrust them to a bank. Furthermore, a substantial portion, specifically 80%, of the coins must be stored in a secure cold wallet, enhancing security measures. The FSC’s directive also covers preparations for potential hacks or computer incidents. Virtual asset service providers are mandated to either acquire insurance or accumulate reserves to mitigate the impact of such incidents. Additionally, the new law prohibits exchanges from blocking deposits or withdrawals unless it is deemed absolutely necessary and authorized by the courts or financial regulators. South Korea has been actively solidifying its regulatory framework for the cryptocurrency industry. Earlier in December, financial regulators called on users to report unlicensed crypto exchanges operating within the country. This initiative was led by the Digital Asset Exchange Association and the Financial Intelligence Unit of South Korea. As South Korea continues to adapt to the ever-evolving landscape of digital assets, these regulatory changes aim to strike a balance between investor protection and industry growth. The FSC’s decision to exclude NFTs and CBDCs, while allowing for potential exceptions, highlights the need for flexible and nuanced regulation in the world of cryptocurrencies.",
    "tags": [
      "#NFT market",
      "#South Korea"
    ],
    "publishDate": "11/12/2023"
  },
  {
    "id": 14,
    "title": "NFT Trading Surges Close to $1 Billion as Bullish Momentum Grips Crypto Markets",
    "absoluteURL": "https://www.todaynftnews.com/nft-trading-surges-close-to-1-billion-as-bullish-momentum-grips-crypto-markets/",
    "fullContent": "SNEAK PEEK The trading volume of Non-Fungible Tokens (NFTs) is approaching a significant milestone, nearing $1 billion in total value. A substantial 125% increase in NFT trading activity occurred in November. The average transaction value of NFTs has significantly risen, indicating a growing market interest and value. In a compelling turn of events, the nonfungible token (NFT) market has experienced a robust surge in trading volume, approaching the $1 billion mark in November. DappRadar, a decentralized app tracking platform, released data revealing that NFT trading has embraced the bullish wave, marking the second consecutive month of upward momentum. The report from DappRadar indicates a remarkable 125% increase in NFT trading volume in November, signaling a significant shift in user behavior compared to previous downtrends in NFT activity. Notably, this surge comes amid a broader positive trend in the cryptocurrency markets. Executives within the Web3 space are optimistic about the continuation of this trend. Jonathan Perkins, the co-founder of SuperRare, conveyed to Cointelegraph on November 14 that the worst of the bear market appears to be behind us, suggesting a favorable outlook for the NFT sector in the coming months. In addition to the surge in trading volume, the average value of NFT transactions experienced an impressive 114% increase, climbing from $126 to $270 throughout November. This indicates a growing confidence and willingness among participants to engage in higher-value transactions within the NFT space. DappRadar’s report also sheds light on the increased daily unique active wallets (UAW) in blockchain gaming, witnessing a 14% rise. The decentralized applications industry saw blockchain gaming with a 34% market dominance, reinforcing its status as a fundamental pillar in the decentralized ecosystem. Despite a seemingly bearish mood throughout the year, blockchain gaming projects have managed to secure a substantial $2.3 billion in investments from the beginning of 2023 up to October. This resilience is particularly evident in the third quarter of 2023, where blockchain gaming secured an impressive $600 million in investments, even amidst lower cryptocurrency market prices than previous peaks. In conclusion, the NFT market’s remarkable resurgence and the resilience of blockchain gaming investments paint a picture of a dynamic and evolving landscape within the cryptocurrency space. As the crypto markets turn bullish, these trends may signal a broader shift in user sentiment and behavior, marking a positive outlook for the industry in the months ahead.",
    "tags": [
      "#Blockchain",
      "#NFT market"
    ],
    "publishDate": "11/12/2023"
  },
  {
    "id": 15,
    "title": "Animoca Brands Secures Additional $11.88 Million for Mocaverse in Second Funding Tranche",
    "absoluteURL": "https://www.todaynftnews.com/animoca-brands-secures-additional-11-88-million-for-mocaverse-in-second-funding-tranche/",
    "fullContent": "SNEAK PEEK Animoca Brands Corporation Limited successfully raised $11.88 million in a second funding tranche for Mocaverse. Key participants in this funding round included Block1, OKX Ventures, Foresight Ventures, Polygon Ventures, Dapper Labs, among others. The funding was achieved by issuing new ordinary shares priced at A$4.50 each, and investors received free-attaching utility token warrants on a 1:1 dollar basis. Animoca Brands Corporation Limited has announced the successful completion of a second funding tranche for Mocaverse, raising $11.88 million. This comes after an initial investment of $20 million in September 2023. We are pleased to announce that we have raised an additional US$11.88 million for @MocaverseNFT to build the digital identity and point system for #Web3 #gaming, culture, and entertainment.🎉 Full details: https://t.co/g4GXNp1NEB pic.twitter.com/yCt5wfmPET — Animoca Brands (@animocabrands) December 8, 2023 Prominent participants in this funding round included Block1, OKX Ventures, Foresight Ventures, Polygon Ventures, Dapper Labs, and others. The funding was raised by issuing new ordinary shares at a price per share of A$4.50. Notably, investors in each round were granted free-attaching utility token warrants on a 1:1 dollar basis. Mocaverse is focused on establishing itself as the empowerment layer for Web3 culture and entertainment. It aims to facilitate seamless onboarding and sustained growth for Web3 projects through its loyalty system, the Web3 Frequent Player Program, powered by Mocaverse loyalty points known as “Realm Points.” Mocaverse is set to serve as an interoperable meta-experience layer for Web3 identity, social interactions, and growth. Users can create their digital identity, build a reputation, and earn and spend Realm Points within the Mocaverse ecosystem. This ecosystem is supported by Animoca Brands’ extensive portfolio of over 400 companies and a partner network with more than 700 million addressable users. The recently introduced Moca ID will play a pivotal role as a digital passport, allowing users to earn Realm Points through engagement within the Mocaverse ecosystem. These points can then be redeemed for exclusive real-life benefits and rewards offered by Mocaverse and Animoca Brands. The Web3 Frequent Player Program is envisioned as a permissionless and interoperable loyalty system, with plans for progressive decentralization to enable third-party adoption and integration of Moca ID. This approach aims to enhance accessibility and foster growth within the broader Web3 ecosystem. Animoca Brands is raising funds through Simple Agreements for Future Equity (SAFEs) with sophisticated investors, totaling $11.88 million at a share price of A$4.50. The SAFEs will automatically convert to ordinary shares after six months, with the number of new shares determined by the AUD: USD exchange rate at settlement. Currently, Animoca Brands has 1,910,074,127 outstanding fully paid ordinary shares. This additional funding for Mocaverse marks a significant step in advancing the vision of Web3 culture and entertainment empowerment. Mocaverse’s innovative approach and the support from prominent investors underscore its potential to reshape the Web3 landscape.",
    "tags": [
      "#Animoca Brands",
      "#OKX Exchange",
      "#Web3"
    ],
    "publishDate": "08/12/2023"
  },
  {
    "id": 16,
    "title": "Reebok Enters the Realm of Digital Fashion and Gaming, Enhanced by AI, Following Nike’s Lead",
    "absoluteURL": "https://www.todaynftnews.com/reebok-enters-the-realm-of-digital-fashion-and-gaming-enhanced-by-ai-following-nikes-lead/",
    "fullContent": "SNEAK PEEK Reebok, a sportswear brand owned by Adidas, is entering the digital fashion and gaming sphere by partnering with crypto tech startup Futureverse. This collaboration is focused on integrating AI and blockchain technologies into Reebok’s products, reminiscent of Nike’s earlier ventures in digital fashion. The partnership aims to bring Reebok’s styles into the digital world as wearable NFTs and to create immersive virtual gaming experiences. Reebok, a prominent sportswear brand, is making significant strides into digital fashion and gaming, reminiscent of Nike’s earlier ventures. Owned by Adidas, Reebok has formed a unique partnership with the crypto tech startup Futureverse, marking a significant step towards integrating AI and blockchain technologies into their products. Thrilled to announce our exclusive partnership with @Reebok to leverage our AI and metaverse technology to revolutionize digital fashion. Together, we introduce @ReebokImpact. Coming 2024. pic.twitter.com/30Qk02aujk — Futureverse (@futureverse) December 7, 2023 This collaboration aims to revolutionize digital fashion and extend Reebok’s brand into virtual spaces. The plan includes the development of AI-enhanced and blockchain-supported games and digital experiences. This initiative brings Reebok’s styles into the digital world as wearable NFTs and emphasizes creating immersive virtual gaming experiences. A critical project in this partnership is “Reebok Impact,” which is slated for launch next year. This initiative is described as a “mind and heart-bending digital shoe experience” that integrates AI technology with on-chain digital wearables. The goal is to illustrate that life’s essence is not just about the sneakers one wears but about one’s experiences while wearing them. Reebok CEO Todd Krinsky highlighted the importance of participating in the world purposefully, and this partnership with Futureverse is seen as a step towards redefining the limits of innovation and consumer engagement in the digital evolution of products. Futureverse, which secured $54 million in Series A funding in July, aims to create an “open metaverse” where digital assets like NFTs can move freely across multiple platforms. The company is expanding its ecosystem by acquiring other crypto firms, games, and metaverse experiences, although this collaboration with Reebok marks its first foray into digital footwear. In comparison, Nike acquired RTFKT, an NFT sneaker studio, in December 2021, leading the footwear industry into the virtual domain. Since then, Nike has built a robust NFT community and released exclusive physical sneaker collections with digital counterparts. Following this trend, brands like Adidas, Dior, and Puma have launched similar “phygital” products. While Reebok has not announced any plans for physical sneakers linked to digital tokens yet, it has revealed a limited-edition sneaker drop in collaboration with Gary Vaynerchuk’s NFT brand VeeFriends. This special edition will initially be available to VeeFriends token holders before being released globally. Reebok’s partnership with Futureverse represents a significant move into the digital realm, blending AI and blockchain technology to create unique gaming and digital fashion experiences, potentially reshaping how consumers interact with the brand in virtual spaces.",
    "tags": [
      "#Blockchain",
      "#NFT market"
    ],
    "publishDate": "08/12/2023"
  },
  {
    "id": 17,
    "title": "Megadeth Leaps into NFT Realm with Exclusive Fan Experiences",
    "absoluteURL": "https://www.todaynftnews.com/megadeth-leaps-into-nft-realm-with-exclusive-fan-experiences/",
    "fullContent": "SNEAK PEEK Megadeth’s NFTs redefine music fan engagement, bridging real and virtual realms for a groundbreaking experience. Exclusive content and one-on-one interactions make Megadeth’s NFTs more than collectibles, enhancing fan connections. The heavy metal genre’s embrace of NFTs, exemplified by Avenged Sevenfold, signals a growing trend in the music industry. Thrash metal pioneer Megadeth has made a significant entry into the world of NFTs. On December 5, they announced a unique collection that merges digital and physical realms. This initiative marks a new era for fan interaction in the music industry. The band, fronted by Dave Mustaine, has millions of loyal followers. Their excitement is palpable, signaling a significant shift in how fans engage with music icons. The collection, named MegadethDigital, features 5,000 generative pieces. It stars Vic Rattlehead, the band’s digital mascot, in a fresh artistic vision. The initiative, set to go live on December 22, transcends typical fan club boundaries. Hence, it promises a community-owned experience, blending the real and the virtual worlds. Introducing @MegadethDigital. Our 5000-piece generative collection featuring Vic Rattlehead brought to life in a new way by our talented artist @TheHaddy. Live on December 22nd, you\u0027ll have the opportunity to unlock doors in the real and metaverse world alike, gaining access to… pic.twitter.com/Ed9YxqCTe6 — Megadeth (@Megadeth) December 5, 2023 Moreover, these NFTs are not mere collectibles. They serve as keys to exclusive content and experiences. Holders can access special merchandise and VIP events. Additionally, they offer chances for one-on-one interactions with band members. This approach adds a tangible, personal touch to digital assets. Megadeth’s foray into NFTs mirrors a growing trend in the heavy metal genre. Notably, Avenged Sevenfold’s Deathbats Club has also embraced Web3 technology. They pioneered NFT ticketing for their concerts, receiving a warm welcome from fans. Consequently, this movement signifies a broader acceptance of NFTs in the music industry. Shoutout to @DeathbatsClub for leading the way in NFT utility and a seamless purchasing of tickets. I know a lot of happy fans out there right now who are glad they bought in! #A7X3rdLeg #A7X #DBC 💀🦇🔥 pic.twitter.com/wYDemKrMTW — Nate (@BestBagleinTown) November 29, 2023 Significantly, Megadeth’s move is more than a nod to current trends. It is a strategic embrace of technology for deeper fan engagement. Their NFTs act as a bridge, connecting the virtual and physical fan experiences. This innovative approach could set a new standard for artist-fan interactions. However, the initiative’s success hinges on the fans’ reception and participation. Early responses suggest a positive outlook. Fans are eager to explore this new dimension of their favorite band. The combination of heavy metal and NFTs is a winning formula. Megadeth’s NFT venture reflects the evolving landscape of music and technology. It not only offers exclusive experiences but also empowers fans. As this trend grows, it could revolutionize how artists and fans connect. MegadethDigital is not just a collection; it’s a pioneering step into a future where music, art, and technology converge seamlessly.",
    "tags": [
      "#NFT market"
    ],
    "publishDate": "07/12/2023"
  },
  {
    "id": 18,
    "title": "Ethereum NFT Developers Rush to Safeguard Projects Against Thirdweb Security Flaw",
    "absoluteURL": "https://www.todaynftnews.com/ethereum-nft-developers-rush-to-safeguard-projects-against-thirdweb-security-flaw/",
    "fullContent": "SNEAK PEEK Thirdweb, a provider of crypto development tools, has disclosed a significant vulnerability in their smart contracts, impacting the Ethereum NFT community. The issue affects pre-built contracts from Thirdweb, particularly concerning Ethereum’s ERC-721, ERC-1155, and ERC-20 standards. OpenZeppelin, another smart contract library, confirmed that the vulnerability does not originate from their code but is helping to address the issue. In the dynamic world of Ethereum NFTs, a recent revelation about a vulnerability in Thirdweb’s smart contracts has sent ripples through the community. Thirdweb, known for its crypto development tools, disclosed a significant issue in a widely used open-source library for Web3 smart contracts. This discovery has prompted a swift response from Ethereum NFT marketplaces and creators, underscoring the urgency of securing digital assets. The vulnerability, which remains undisclosed to prevent exploitation, affects pre-built contracts provided by Thirdweb and potentially others. Smart contracts are the backbone of decentralized apps and NFT collections, making this a critical concern for stakeholders. OpenZeppelin, another prominent player in smart contract libraries, clarified that the problem does not originate from its repository. Despite this, the company has committed to leading the community in identifying affected parties and offering mitigation strategies. IMPORTANT On November 20th, 2023 6pm PST, we became aware of a security vulnerability in a commonly used open-source library in the web3 industry. This impacts a variety of smart contracts across the web3 ecosystem, including some of thirdweb’s pre-built smart contracts.… — thirdweb (@thirdweb) December 5, 2023 In a proactive measure, Thirdweb advises projects to lock down their current smart contracts and transition to new ones, ensuring the safety of their collections. The firm has also pledged to support affected parties financially by covering the network fees for this migration. This recommendation comes after Thirdweb implemented a fix to its smart contract templates on November 22, ensuring that contracts deployed after this date are secure. The exploit impacts NFT smart contracts adhering to Ethereum’s ERC-721 and ERC-1155 standards and ERC-20 standard fungible tokens. Thirdweb’s blog post provides a detailed list of affected contract types and a tool for identifying compromised contracts. Several major industry players have weighed in on the situation. OpenSea and Rarible, leading NFT marketplaces, are exploring ways to assist collection owners with contract migrations. Coinbase revealed that some collections on its NFT platform are affected, while Manifold, a smart contract startup, confirmed its contracts are safe. Base, an Ethereum layer-2 network, acknowledged the impact on some project contracts but assured the network’s security. Ethereum profile picture project Cool Cats and Animoca Brands’ Mocaverse gaming platform are moving to new contracts to safeguard their NFT collections. In response to the challenge, Thirdweb has doubled its bug bounty payments to $50,000 and committed to a more stringent auditing process in the future. This incident highlights the ongoing challenges in the rapidly evolving field of NFTs and the importance of robust security measures to protect digital assets in the decentralized space.",
    "tags": [
      "#Ethereum",
      "#NFT market"
    ],
    "publishDate": "06/12/2023"
  },
  {
    "id": 19,
    "title": "Tiger Global \u0026 Coatue Management Cut NFT Investments Amid Market Volatility",
    "absoluteURL": "https://www.todaynftnews.com/tiger-global-coatue-management-cut-nft-investments-amid-market-volatility/",
    "fullContent": "SNEAK PEEK Tiger Global’s NFT portfolio slashes reflect crypto market caution amid volatility. Coatue Management marks down OpenSea investment by 90%, echoing NFT market reevaluation. The evolving NFT space prompts major investors to recalibrate, shaping crypto’s future stability. In a significant move, Tiger Global, a prominent investment firm, has drastically reduced its investments in notable non-fungible token (NFT) projects. These investments include the Bored Ape Yacht Club (BAYC) collection and the NFT marketplace OpenSea. Bloomberg’s recent report reveals that Tiger Global slashed its BAYC stakes by 69% and OpenSea holdings by 94%. Moreover, the firm has also cut valuations for several other portfolio companies. Tiger Global’s decision reflects a cautious approach towards the volatile crypto market. The firm has been diversifying its investments in the crypto realm, focusing on NFTs and blockchain security and privacy-focused initiatives. In 2021, it co-led a $24 million funding round for blockchain security company CertiK, emphasizing its commitment to enhancing decentralized finance (DeFi) security. Furthermore, in 2022, Tiger Global participated in a Series B investment for Aleo, a zero-knowledge applications platform, which successfully raised $200 million. This round saw leading investors like Kora Management LP and SoftBank Vision Fund 2. Additionally, the firm invested in Polygon, a layer-2 network, showcasing its broad interest in crypto. However, Tiger Global is not alone in this cautious stance. Coatue Management, another major player and co-lead investor in OpenSea, recently marked down its investment in the NFT marketplace by 90%. This reduction brought OpenSea’s valuation down to $1.4 billion, a significant decrease from its previous valuation. These markdowns by Tiger Global and Coatue Management signal a broader trend of reevaluation within the NFT market. Investors are becoming more circumspect, primarily due to fluctuating market values. Consequently, this shift could lead to more conservative investment strategies in the NFT and broader crypto sectors. Besides these adjustments, these investment giants’ moves underscore the NFT space’s evolving nature. Hence, as the market matures, further recalibrations in investments are likely. These developments may pave the way for more stable and sustainable growth in the crypto and NFT sectors in the long run.",
    "tags": [
      "#NFT market"
    ],
    "publishDate": "02/12/2023"
  },
  {
    "id": 20,
    "title": "Notable NFT Collector Expands His Digital Art Portfolio Adam Weitsman’s Bold NFT Move with Gold Mega Koda",
    "absoluteURL": "https://www.todaynftnews.com/notable-nft-collector-expands-his-digital-art-portfolio-adam-weitsmans-bold-nft-move-with-gold-mega-koda/",
    "fullContent": "SNEAK PEEK Adam Weitsman’s acquisition of Gold Mega Koda #9969 signals his deep commitment to NFTs and Web3 gaming. Weitsman’s involvement in high-value NFT transactions, like the 100 ETH purchase, showcases his dedication to digital collectibles. Animoca Brands’ role in this sale and the involvement of APPRECIATION emphasizes the significance of this NFT transaction in the digital art world. In a significant development within the NFT industry, Adam Weitsman acquired Gold Mega Koda #9969, as shared in a recent announcement. This move marks another important step in Weitsman’s journey within the digital art space. Weitsman, renowned for his business acumen, notably heads Upstate Shredding. He is also a respected figure in the entrepreneurial and philanthropic spheres. His latest acquisition from Animoca Brands speaks volumes. It demonstrates his unwavering commitment to the digital realm, particularly Web3 gaming. Weitsman, a staunch supporter of the Yuga Labs ecosystem, continues to showcase his belief in its potential. Consequently, his investment in NFTs and digital art has been consistent and impactful. Welcome to the family! Thank you @animocabrands for your trust 🙏🏼 pic.twitter.com/t1L1boankc — Adam Weitsman (@AdamWeitsman) November 29, 2023 The purchase, made for a handsome sum of 100 ETH, is not just a financial transaction. It signifies a deeper involvement in the ever-evolving world of digital collectibles. This year has seen Weitsman make several noteworthy acquisitions. Among them, the rare Mega Koda #9951 stands out. Additionally, his purchase of the Dookie Dash Golden Key, later transforming into the Legendary HV-MTL #1, made headlines with its $1.6 million price tag. The Gold Mega Koda #9969 is unique in its design and features. It boasts Gold-Melted Eyes, a Regal Head, and a 24k Thoracic Core. Furthermore, it is equipped with an Everlights Wand, making it a coveted item among collectors. Weitsman’s gratitude to Animoca Brands for this transaction highlights the mutual respect in this partnership. Congratulations on the new #NFT acquisition @AdamWeitsman! 🤝 https://t.co/8XjsXRbmKM — Animoca Brands (@animocabrands) November 30, 2023 Animoca Brands, a prominent player in the NFT market, facilitated this sale. Their reputation for handling high-profile transactions remains unblemished. Moreover, the involvement of APPRECIATION, led by Steven Papas, in brokering this deal adds another layer of prestige. This advisory firm specializes in digital art and collectible acquisitions, further legitimizing the significance of this transaction. Weitsman’s latest acquisition is more than just an addition to his collection. It represents his belief in the potential of NFTs and Web3 gaming. This move solidifies his position as a key player in the digital landscape. Hence, it also underscores the growing importance of NFTs in the broader context of digital art and collectibles.",
    "tags": [
      "#Animoca Brands",
      "#NFT market",
      "#Web3"
    ],
    "publishDate": "01/12/2023"
  },
  {
    "id": 21,
    "title": "RARI Chain Revolutionizes NFT Royalties on Arbitrum",
    "absoluteURL": "https://www.todaynftnews.com/rari-chain-revolutionizes-nft-royalties-on-arbitrum/",
    "fullContent": "SNEAK PEEK RARI Chain’s creator-centric approach guarantees fair royalties, reshaping NFT economics. Rarible’s stance on creator rights led to a 637% trading volume surge within 24 hours. The partnership with Arbitrum, LayerZero, and WalletConnect strengthens RARI Chain’s commitment to ensuring fair compensation. The RARI Foundation recently unveiled an Ethereum Virtual Machine (EVM)-compatible blockchain named RARI Chain. This chain uniquely embeds royalties into its nodes. Consequently, it offers an NFT infrastructure solution built on Arbitrum. Moreover, this innovation ensures that creators receive the royalties due to them, solidifying their success in the digital realm. Significantly, the introduction of the RARI Chain follows Rarible’s impressive trading volume surge. This uptick occurred after Rarible’s firm stance on maintaining creator royalties in August. They excluded marketplaces like OpenSea and Blur.io from their data aggregation for not supporting these royalties. This move reflects Rarible’s dedication to creator rights and has led to a 637% increase in trading volume within 24 hours, as reported by DappRadar. 1/ Following @rarible\u0027s decision to maintain creator royalties, and remove both @opensea and @blur_io from their aggregation data, Rarible\u0027s trading volume is up 637% in the past 24h. Do you think Rarible is right? 🤔 View @rarible on DappRadar 👇https://t.co/9hh0AQa7Nj pic.twitter.com/cg1dPChYar — DappRadar (@DappRadar) August 23, 2023 Moreover, the RARI Chain is not just another blockchain solution. It represents a pivotal shift in how creators’ earnings are protected in the Web3 ecosystem. Alex Salnikov, co-founder of Rarible, emphasizes the need for a “creator-centric ecosystem.” He asserts that embedding royalties at the node level isn’t just a promise but a guarantee of creator earnings. This approach ensures a sustainable economy for digital creators. Additionally, the RARI Foundation’s partnership with key players like Arbitrum, LayerZero, and WalletConnect substantially supports the new chain. From the Arbitrum Foundation, Nina Rong highlights the importance of fair compensation for creators. She points out that enforcing royalties at the node level advances this goal. Imagine a lighting-fast chain where royalties are always guaranteed, with low and predictable costs, and Ethereum-grade security. Introducing RARI Chain: the chain that always puts creators first👇 pic.twitter.com/EELDilSXrI — RARI Foundation (@rarifoundation) November 30, 2023 However, this is about more than just technology. It’s about reshaping the digital landscape to favor creators. The RARI Chain stands as a testament to the potential of blockchain technology in protecting the interests of digital artists and creators. It marks a significant stride in preventing the disintermediation of creators from the burgeoning growth of Web3. The RARI Foundation’s latest initiative with RARI Chain brings a new era in NFT trading and creator compensation. By embedding royalties into the blockchain nodes, they ensure creators are fairly rewarded. Hence, this development is a technological advancement and a cultural shift towards a more equitable digital economy.",
    "tags": [
      "#Blockchain",
      "#NFT market",
      "#Rarible"
    ],
    "publishDate": "01/12/2023"
  },
  {
    "id": 22,
    "title": "Recent Studies Reveal Personal Experiences as Key Drivers in NFT Market Movements",
    "absoluteURL": "https://www.todaynftnews.com/recent-studies-reveal-personal-experiences-as-key-drivers-in-nft-market-movements/",
    "fullContent": "SNEAK PEEK New research studies offer fresh insights into the NFT market, emphasizing the roles of personal experiences, luck, scarcity, and optimism. Guneet Kaur Nagpal and Luc Renneboog’s study on CryptoPunks reveals Ethereum investors’ tendencies towards higher-cost activities and gains. The research indicates that Ethereum’s market performance influences asset sale decisions more than NFT prices. In a fascinating twist in understanding the nonfungible token (NFT) market, new research studies have revealed that personal experiences, luck, scarcity, and consumer optimism play crucial roles in market dynamics. This insight emerges from a trio of studies conducted by academicians from several prestigious institutions, offering a fresh perspective on the factors influencing the NFT landscape. At the forefront of these studies, researchers Guneet Kaur Nagpal from Western University and Luc Renneboog from Tilburg University explored the market dynamics of CryptoPunks, a leading NFT asset collection. Their study, “On Nonfungible Tokens, Blockchain Hypes, and the Creation of Scarcity,” highlighted that Ethereum (ETH) investors were more inclined to engage in higher-cost market activities and experienced significant gains. Interestingly, the study noted that ETH’s market performance did not directly influence NFT prices but impacted decisions on asset sales. Meanwhile, Chuyi Sun of the University of North Carolina at Chapel Hill delved into how personal experiences shape market behavior in the NFT domain. In the study “Personal Experience Effects across Markets: Evidence from NFT and Cryptocurrency Investing,” Sun analyzed data from approximately one million wallets. The findings revealed that investors receiving more valuable NFTs in initial offerings were likelier to engage in subsequent NFT purchases and gravitate towards speculative cryptocurrencies. Contrastingly, a study from the Rennes School of Business, “The Impact of Experience, Overconfidence and Optimism on Future Cryptocurrency Ownership,” conducted by Akanksha Jalan and Roman Matkovskyy, brought to light an intriguing aspect of investor behavior. Contrary to expectations, negative past experiences and investor optimism positively influenced future engagements in cryptocurrencies and NFTs. This trend suggests a unique resilience among investors, attributing losses to external factors like market volatility rather than personal decision-making. These studies offer a nuanced understanding of the NFT market, moving beyond conventional economic models. They underscore the importance of personal experiences and psychological factors in driving market trends. This research paves the way for a deeper exploration of the human elements behind the burgeoning world of NFTs, suggesting that market movements are as much about individual stories and perceptions as they are about economic indicators. The recent findings challenge traditional market theories, highlighting the complex interplay of personal experiences, luck, scarcity, and optimism in shaping the future of NFTs. This new knowledge enriches our understanding of the NFT market and opens doors for more human-centric approaches to studying digital asset economies.",
    "tags": [
      "#Blockchain",
      "#NFT market"
    ],
    "publishDate": "30/11/2023"
  },
  {
    "id": 23,
    "title": "Bioniq Ushers in a New Era in Bitcoin NFT Trading with ICP Integration",
    "absoluteURL": "https://www.todaynftnews.com/bioniq-ushers-in-a-new-era-in-bitcoin-nft-trading-with-icp-integration/",
    "fullContent": "SNEAK PEEK Bioniq emerges as a key player in cryptocurrency with a Bitcoin NFT marketplace The platform uses Internet Computer Protocol to reduce network congestion and fees. Bioniq offers contract auctions and a cross-chain wallet bridging Bitcoin and ICP. Bioniq has emerged as a pivotal player in the dynamic world of cryptocurrency, launching an innovative Bitcoin nonfungible token (NFT) marketplace. This platform stands out for its strategic use of the Internet Computer Protocol (ICP), significantly reducing the network congestion and high fees often associated with Bitcoin Ordinals inscriptions. Developed in the wake of the creation of Bitcoin Ordinals in early 2023, Bioniq is set to revolutionize the way Bitcoin-based NFTs are traded. Leveraging the ICP’s native Bitcoin integration, Bioniq has crafted a seamless marketplace featuring innovative contract auctions and a comprehensive cross-chain wallet bridging Bitcoin and ICP. Bob Bodily, CEO and co-founder of Bioniq emphasized the platform’s quick response to the immense potential of Ordinals, starting its development as early as February 2023. The platform’s innovation doesn’t stop there. Bioniq introduces an intelligent wallet, enabling users to manage their private keys through Web3Auth. This feature brings the convenience of logging in via standard Web2 Google accounts while retaining noncustodial control over wallets and assets. Furthermore, Bioniq capitalizes on the advantages of partially signed Bitcoin transactions (PSBTs) integrated within the ICP’s Bitcoin network. This integration allows for smart contract capabilities directly on Bitcoin, bypassing the need for centralized cross-chain bridges. Backed by influential names like Polychain Capital, Bioniq takes a unique approach by treating Internet Computers as a Bitcoin layer-2 network. This strategy harnesses the ICP’s efficiencies in time and cost through a token-wrapping process. Users can transfer their Bitcoin and Ordinals assets into Bioniq’s wallet, opting to wrap their assets for safekeeping while generating equivalent NFTs on the ICP network. This process enables trading on the ICP network, free from the usual gas or transaction fees and immune to the Bitcoin network’s speed limitations. Bioniq’s launch addresses the market capitalization growth of BRC-20 tokens and tackles the issue of Bitcoin network congestion. The platform’s unique approach offers a more reliable and efficient trading experience, even in high Bitcoin fee environments. Looking ahead, Bioniq plans to expand its offerings, including a launchpad for new collections, a crypto borrowing feature using Ordinals assets as collateral, and a platform for collection offers targeting specific projects. This holistic approach marks a significant step forward in the crypto marketplace, bringing efficiency and innovation to the forefront.",
    "tags": [
      "#Bitcoin",
      "#NFT market"
    ],
    "publishDate": "30/11/2023"
  },
  {
    "id": 24,
    "title": "Solana’s Mad Lads NFTs Eclipse Bored Ape Yacht Club Sales",
    "absoluteURL": "https://www.todaynftnews.com/solanas-mad-lads-nfts-eclipse-bored-ape-yacht-club-sales/",
    "fullContent": "SNEAK PEEK Mad Lads, a Solana-based NFT, reaches a new floor price of 123 SOL or over $7,100. In November, the collection’s value more than tripled, indicating rapid growth. Mad Lads outperformed other NFTs with over $1.39 million in 24-hour sales. The digital asset space is witnessing a remarkable surge in the value and popularity of Mad Lads, a Solana-based profile picture (PFP) NFT collection. Outperforming many leading NFT projects, Mad Lads has reached new heights in its floor price and sales volume. As noted by Solana Floor data, Mad Lads’ entry price has recently experienced a significant increase. The collection’s floor price now stands at 123 SOL, equating to over $7,100. This marks a substantial rise, with the price more than tripling in November alone. On November 13, Decrypt reported the collection’s floor value at nearly $4,500 worth of SOL, highlighting a robust growth trajectory. Regarding sales, Mad Lads is making waves in the secondary markets. Over the past 24 hours, sales have exceeded $1.39 million, according to CryptoSlam data. This volume surpasses other notable NFT projects, including the Fortune Founder’s Pass from Army of Fortune and the renowned Bored Ape Yacht Club on Ethereum. The latter registered approximately $881,000 in sales, while Solana’s Tensorians followed closely with about $810,000. Several elements contribute to the increasing demand and value of Mad Lads. The Solana token has seen significant appreciation, rising from around $21 to a current value of $58, even touching $65 recently. This price increase has impacted the broader Solana NFT market, with sales topping $62 million in November, a steep rise from October’s $28 million. Mad Lads distinguishes itself with unique attributes. Developed by startup Coral, the collection integrates with the Backpack app and its executable NFTs (xNFTs) standard, providing a range of experiences around tokenized assets. Coral’s upcoming crypto exchange, licensed in Dubai and led by former FTX general counsel Can Sun, has also added to the project’s appeal. Mad Lads NFT holders were given priority access to exchange signups and received PYTH tokens during the recent Pyth Network airdrop on Solana. These factors, combined with the project’s innovative approach and exclusive holder benefits, fuel the increasing demand for Mad Lads NFTs. Mad Lads’ success is not just a triumph for the project itself but also signifies a pivotal moment in the NFT sector, especially for Solana-based projects. Its performance against Ethereum’s Bored Ape Yacht Club, a long-time leader in the NFT market, suggests a shift in investor interest toward Solana’s ecosystem. This shift could lead to increased competition and innovation within the NFT space as projects strive to offer unique benefits and experiences to their communities. As the NFT market continues to evolve, the success of collections like Mad Lads will likely inspire new developments and trends within this dynamic and ever-changing industry.",
    "tags": [
      "#Bored Ape Yacht Club",
      "#NFT market",
      "#Solana"
    ],
    "publishDate": "29/11/2023"
  },
  {
    "id": 25,
    "title": "Bored Ape Yacht Club Member Almost Falls for a Phony Forbes Scheme While Seeking a Banana",
    "absoluteURL": "https://www.todaynftnews.com/bored-ape-yacht-club-member-almost-falls-for-a-phony-forbes-scheme-while-seeking-a-banana/",
    "fullContent": "SNEAK PEEK A Bored Ape Yacht Club member named Crumz narrowly escaped a sophisticated scam disguised as an interview opportunity with Forbes. The scammer impersonated Forbes editor Robert LaFanco and contacted Crumz directly by message. Red flags included a non-premium Zoom account and a request to use a separate screen recording bot. In a recent turn of events, the Bored Ape Yacht Club (BAYC) community has witnessed an alarming scam attempt. A member of this prestigious NFT group, known as Crumz, narrowly escaped a well-orchestrated scheme. The scam, posing as an opportunity for an interview with Forbes, targeted Crumz through a direct message from an impersonator of Robert LaFanco, a real Forbes editor. Crumz faced several red flags during the interview, including the interviewer’s non-premium Zoom account and a request to use a separate recorder bot for screen recording. Despite these signs, Crumz initially complied with the requests. The scammer asked Crumz to fetch a banana, supposedly to add a personal touch related to his BAYC NFT. However, Crumz later realized that this request was a ploy to distract him and gain control of his computer remotely. 🚨🚨SCAM ALERT!!🚨🚨 I just spent the last 2hours on Zoom with \u0027@Forbes\u0027 it was pretty sophisticated and well thought out because I\u0027m usually on high alert but luckily I wasn\u0027t caught. Here\u0027s what they did. 🧵1/8 — Crumz 🇮🇪 (@crumz10) November 26, 2023 Upon refusing to leave his computer, Crumz observed the scammers attempting to take over his screen. He acted quickly to prevent any potential theft of his valuable digital assets. This incident highlights the growing sophistication of scams within the NFT community. Similar scams have been reported, involving fake journalists luring NFT owners into compromising their security for a supposed media feature. This case serves as a warning to the NFT community, particularly high-value asset holders like BAYC members. The incident underscores the importance of vigilance and skepticism when dealing with unsolicited offers, especially those involving access to personal or digital assets. The BAYC community and broader NFT holders are now more aware of these tactics, thanks to the sharing of this experience by Crumz and others who have encountered similar situations. As the NFT market thrives, collectors must stay informed and cautious. This incident not only reflects the vulnerabilities within the digital asset space but also the resilience of its members in the face of evolving cyber threats.",
    "tags": [
      "#Bored Ape Yacht Club",
      "#NFT market"
    ],
    "publishDate": "28/11/2023"
  },
  {
    "id": 26,
    "title": "Pudgy Penguins Unveil Limited Edition Walmart ‘Influencer Package’ for Cyber Monday",
    "absoluteURL": "https://www.todaynftnews.com/pudgy-penguins-unveil-limited-edition-walmart-influencer-package-for-cyber-monday/",
    "fullContent": "SNEAK PEEK Pudgy Penguins, an Ethereum-based NFT giant, is launching an exclusive ‘Influencer Box’ through Walmart on Cyber Monday. Priced at $25 on Walmart.com, this bundle offers significant savings compared to the regular price of individual items. Pudgy Penguins has a strategic partnership with Walmart, distributing their toy line across over 2,000 U.S. stores. Ethereum-based NFT giant Pudgy Penguins marks a distinctive entry into the retail arena this Cyber Monday with an exclusive offering through Walmart. The unique ‘Influencer Box,’ a blend of physical and digital collectibles, demonstrates the brand’s innovative approach in a fluctuating market. It aimed at mainstream consumers; this box includes a variety of engaging items: a 12-inch plush toy, an action figure, a clip-on plush, an igloo toy, and a certificate for a complimentary NFT on the zkSync Era, redeemable on the Pudgy World gaming platform. With a promotional price of $25, exclusively available on Walmart.com, this bundle represents significant savings from its regular combined item value. Each 12-inch plush toy, part of this collection, is usually priced between $20 and $25. Pudgy Penguins’ strategic partnership with Walmart has already seen their toy line distributed across over 2,000 stores in the United States, according to Brittany Smith, Walmart U.S. VP. This collaboration underscores a unique fusion of physical and digital play experiences for children. This Cyber Monday we partnered with @Walmart to release our influencer box bundle, exclusively on their website. Details below. pic.twitter.com/KbOGAcBuws — Pudgy Penguins (@pudgypenguins) November 27, 2023 The Pudgy Penguins collection, initially launched in 2021 amidst the NFT boom, has experienced notable growth and transformation under the leadership of entrepreneur Luca Netz. Acquired for $2.5 million during community unrest, Netz’s stewardship has seen the project’s Instagram following exceed a million, alongside expansion into new product lines. The collection’s impressive value increase highlights this growth trajectory: an all-time high of over $13,000 in ETH, marking a sevenfold rise since Netz’s takeover in April 2022. Despite the broader market downturn since May 2022, Pudgy Penguins stands out as a resilient and growing NFT project in USD value. Their continuous innovation, as seen with the latest Cyber Monday exclusive, showcases their commitment to staying relevant and accessible in a changing digital landscape. This newest offering aligns with their broader strategy of expanding their brand presence and appeal beyond the traditional NFT space, reaching out to a more varied consumer base.",
    "tags": [
      "#NFT market",
      "#Pudgy Penguins NFT"
    ],
    "publishDate": "28/11/2023"
  },
  {
    "id": 27,
    "title": "Azuki DAO Undergoes Rebranding to ‘Bean’, Withdraws Legal Action Against its Founder",
    "absoluteURL": "https://www.todaynftnews.com/azuki-dao-undergoes-rebranding-to-bean-withdraws-legal-action-against-its-founder/",
    "fullContent": "SNEAK PEEK Azuki DAO rebrands to “Bean,” marking a significant shift in strategy. The DAO drops a lawsuit against NFT collection founder Zagabond. Bean transitions to a memecoin project within Ethereum’s Blast ecosystem. In a significant shift, Azuki DAO, the decentralized autonomous organization associated with the Azuki nonfungible token (NFT) series, has announced a rebranding to “Bean.” This change comes alongside the decision to drop a previously proposed lawsuit against the NFT collection’s founder, Zagabond. The legal action concerned a contentious $39 million NFT minting event in June, initially stirring up substantial debate within the community. Moreover, the rebranding marks a strategic pivot for the DAO. Bean will transition into a memecoin project as part of its new direction, integrating into the Ethereum layer-2 Blast ecosystem. This move will enhance the project’s presence and capabilities within the digital asset space. Developers have revealed that Bean has already garnered significant support, securing $10 million in funding from notable investors. This financial backing aims to accelerate the project’s growth and development within the Blast ecosystem. The proposed Bean memecoin will have a total supply of 1 billion tokens, indicating the project’s ambitions for widespread adoption and utility. Additionally, there have been updates regarding the token distribution plan. Initially, as outlined on the DAO’s website, the plan detailed a 40% allocation of tokens to the treasury, 50% to Azuki DAO members, and 10% to Zagabond, the Azuki NFT creator. It also stated that minting would be exclusively available to Azuki NFT holders, with a 24-hour window for action, after which any unclaimed tokens would be subject to burn. However, recent clarifications indicate changes in the distribution strategy. The follow-up statement from the developers specified that “50% of the $Bean [token] was allocated to the Azuki DAO community for the airdrop of Azuki series NFTs,” a process concluded four months ago. The statement also confirmed that “40% of $Bean [token] was allocated to the Bean Treasury, and 10% of $Bean was allocated to Zagabond.” Godspeed @cz_binance pic.twitter.com/jIaCj43sx8 — ZAGABOND.ETH (@ZAGABOND) November 21, 2023 This rebranding and strategic shift signify a new chapter for the former Azuki DAO, now Bean. By dropping the lawsuit and embarking on a fresh path with a memecoin project, the organization is set to explore new horizons in the blockchain and NFT sphere. The move reflects decentralized organizations’ dynamic and evolving nature and the digital asset industry.",
    "tags": [
      "#Azuki NFT",
      "#NFT market"
    ],
    "publishDate": "27/11/2023"
  },
  {
    "id": 28,
    "title": "Square Enix Reveals Auction Schedule for Symbiogenesis Non-Fungible Tokens",
    "absoluteURL": "https://www.todaynftnews.com/square-enix-reveals-auction-schedule-for-symbiogenesis-non-fungible-tokens/",
    "fullContent": "SNEAK PEEK Square Enix, known for the Final Fantasy series, is venturing into the NFT space with its blockchain game Symbiogenesis. The game combines narrative-driven gameplay with Ethereum-based NFTs, marking a new direction for the company in blockchain technology. Symbiogenesis auctions are divided into three phases, starting with an exclusive event for early backers on Nov 27 and 28. Square Enix, the renowned developer behind the Final Fantasy series, has recently unveiled its latest venture into the world of nonfungible tokens (NFTs) by announcing auction dates for its upcoming blockchain game, Symbiogenesis. Set to revolutionize the gaming and digital collectible experience, Symbiogenesis introduces a unique blend of narrative-driven gameplay and Ethereum-based NFTs. This innovative approach marks a significant stride in Square Enix’s exploration of blockchain technology following their successful introduction of Final Fantasy NFT trading cards earlier this year. 来週より、いよいよオークションが開催！ フェーズ1：11/27 12:00～11/28 11:59 フェーズ2：11/30 12:00～12/1 11:59 フェーズ3：12/2 12:00～12/3 11:59 詳しくはこちらhttps://t.co/MFprrAq47W#SYMBIOGENESIS — SYMBIOGENESIS -NFT Art＆Game Project- | SQUARE ENIX (@symbiogenesisPR) November 24, 2023 The auctions for Symbiogenesis NFTs are scheduled in three distinct phases, each offering a different array of digital collectibles. The first phase, slated for Nov 27 to 28, is an exclusive event targeting early backers, termed “stakeholders.” This phase will feature a selection of facet and mesh characters intricately designed to capture the essence of the Symbiogenesis universe. This exclusive access underscores the company’s appreciation for early investors’ support. Following this, the second auction phase, from Nov 30 to Dec 4, and the third phase, from Dec 2 to 3, will open doors to a broader audience. Eligibility for these phases was determined through an allowlist entry campaign, which Square Enix conducted from Nov 7 to 21. This campaign was an engaging blend of quizzes and a treasure hunt within a prototype of the game world, adding an interactive element to the qualification process. Top performers in the campaign, specifically the 50 highest scorers, along with 40 randomly chosen participants from the 51st to 300th rank, earned the privilege to acquire NFTs in the second phase. The remaining participants can bid in the third phase, ensuring an inclusive participation spectrum. Symbiogenesis, described as a “narrative-unlocked NFT entertainment” game, is more than a digital collectible platform. It promises an immersive story-driven experience intertwined with the ownership and trade of unique NFTs. The scheduled launch date for this ambitious project is Dec 21, a day anticipated by gaming and crypto enthusiasts alike. Square Enix’s move into blockchain gaming reflects the company’s adaptability and innovative spirit in the ever-evolving digital entertainment landscape. With a legacy of over 173 million units sold in the Final Fantasy series alone, Square Enix’s foray into NFTs with Symbiogenesis is not just an expansion of their digital offerings but a testament to their commitment to staying at the forefront of gaming technology. As the gaming world eagerly awaits the arrival of Symbiogenesis, it stands as a beacon of the exciting possibilities that blockchain technology brings to interactive storytelling and digital ownership.",
    "tags": [
      "#Gaming",
      "#NFT market"
    ],
    "publishDate": "25/11/2023"
  },
  {
    "id": 29,
    "title": "Cool Cats NFTs Soar in Macy’s Parade and Expand Digitally: A Multifaceted Evolution",
    "absoluteURL": "https://www.todaynftnews.com/cool-cats-nfts-soar-in-macys-parade-and-expand-digitally-a-multifaceted-evolution/",
    "fullContent": "SNEAK PEEK Cool Cats NFTs make the mainstream leap with Macy’s Parade debut and YouTube Shorts series. Blue Cat NFTs reached “blue chip” status despite crypto market challenges in 2021. The brand’s diversification into gaming, merchandise, and real-world integration marks its evolution into a global lifestyle brand. The iconic NFT collection Cool Cats took a significant leap into mainstream visibility, debuting as a balloon in the Macy’s Thanksgiving Day Parade. This move coincides with the launch of a YouTube Shorts series, “The Milk Chug.” Hence, it marks a pivotal moment for the brand, which originated from the creative mind of artist Colin ‘Clon’ Egan. It’s almost time! 💙 pic.twitter.com/s7ObSNWOQ7 — clon (@cloncast) November 23, 2023 Initially, Clon’s Cool Cats appeared as simple artwork. However, they gained substantial traction after transitioning to Instagram in 2015. The pivotal year for Cool Cats was 2021 when 9,999 Blue Cat PFPs (Profile Picture) NFTs were released. Significantly, the collection became a “blue chip” project in the NFT boom, with prices peaking at an average of $92,000. However, the road could have been smoother. The broader crypto market downturn and community discontent saw a drop in the value of these NFTs. Consequently, the Cool Cats Group sought to diversify and expand its reach. This strategy included plans to extend to multiple blockchain networks and license its IP to game studios. Moreover, this diversification strategy is already in motion. Notably, three well-established gaming publishers, nWay, iCandy, and Sync Studios, have been tapped for game development using the Cool Cats brand. All these games are currently in the works and are expected to be released between 2023 and 2024. Additionally, a limited-edition Cool Cats hoodie will be available in a unique blend of physical and digital worlds. This hoodie, featuring an NFC tag linked to an Azuki physical-backed token, illustrates the brand’s commitment to integrating its digital assets with real-world products. We’re about to turn New York City into Blue York City! Here’s your first look at our OFFICIAL @Macys Thanksgiving Day Parade balloon🎈 Who is going to come see it in person? pic.twitter.com/WjoKmqTkiJ — Cool Cats (@coolcats) September 14, 2023 This strategic expansion into gaming and merchandise and its high-profile appearance at the Macy’s Parade positions Cool Cats as a forward-thinking brand. It is adapting to the changing landscapes of digital assets and consumer engagement. The Cool Cats’ foray into various entertainment and product avenues signifies its evolution from a simple NFT collection to a comprehensive global brand. Consequently, this positions Cool Cats not just as a player in the digital art world but as a multifaceted entertainment and lifestyle brand.",
    "tags": [
      "#Cool Cats NFT",
      "#NFT market"
    ],
    "publishDate": "24/11/2023"
  },
  {
    "id": 30,
    "title": "Matr1x’s $10M Boost for Mobile Gaming Innovations",
    "absoluteURL": "https://www.todaynftnews.com/matr1xs-10m-boost-for-mobile-gaming-innovations/",
    "fullContent": "SNEAK PEEK Matr1x secures $10M for innovative NFT gaming, led by Folius Ventures and SevenX, signaling a significant industry shift. Focus on skill-based gameplay in Matr1x Fire aims to redefine mobile gaming, balancing creativity with legal challenges. Despite being compared to existing titles, Matr1x’s strategic NFT collections and esports ambitions are heralding a new era in gaming. Matr1x, a Singapore-based NFT gaming company, has secured an impressive $10 million in its latest funding round. Consequently, this inflow of capital marks a significant milestone for the company. Folius Ventures spearheaded this A-2 round. Moreover, SevenX, a crypto VC firm, contributed as a co-lead investor. Additionally, the investment was joined by notable names like ABCDE Capital, Jambo, and Initiate Capital. Find Satoshi Lab, known for Stepn and Gas Hero, also participated. 🚀BANG BANG BANG! We’ve hit a monumental $10M in our A-2 funding round, skyrocketing our total to $20M. A rousing welcome to our new allies – @FoliusVentures, @SevenXVentures , @ABCDELabs , @fslweb3 (makers of @stepnofficial \u0026 @gasheroofficial) , @initiatecapital, and… pic.twitter.com/xL6rdJRuQG — MATR1X FIRE｜🐾 KUKU NFT Pre-Launch (@Matr1xOfficial) November 23, 2023 Jason Kam, the founder of Folius Ventures, expressed confidence in Matr1x. He highlighted the company’s potential to redefine the gaming industry. Hence, Kam believes Matr1x could navigate the crypto slowdown and achieve mass market appeal. Significantly, Matr1x is focusing on a first-person shooter game, Matr1x Fire. This game draws aesthetic inspiration from Riot Games’ Valorant. It features similar maps, weapons, and character designs. Matr1x Fire emphasizes team play, where five-person teams compete. However, unlike Valorant, it eschews special powers for a skill-based approach. This approach aligns more with CS:GO’s gameplay style. Additionally, Matr1x aims to establish an esports presence for its game, which remains under development. The studio has introduced two NFT collections and is currently in the process of developing a third collection. This upcoming collection will provide opportunities for governance participation and a stake in the creator economy, along with featuring an upgradeable Battle Pass. However, there are concerns within the gaming community. Some gamers draw parallels between Matr1x Fire and NetEase’s Hyper Front. Riot Games previously sued NetEase over Hyper Front, alleging it copied Valorant. As a result, Hyper Front was shut down. Many fear a similar fate for Matr1x Fire. The game has already garnered labels like “Valorant Mobile” in early-access footage. Despite these concerns, Matr1x is forging ahead. The company is transparent in its distinction from Valorant. It emphasizes a different gaming experience, focusing on gunplay and tactics. This distinction is crucial for Matr1x Fire to avoid legal entanglements and carve its niche. The funding and development trajectory of Matr1x signals a potentially transformative period in mobile gaming. Hence, the industry is watching closely, anticipating the impact of Matr1x’s ambitious projects.",
    "tags": [
      "#Blockchain",
      "#Gaming NFTs",
      "#NFT market"
    ],
    "publishDate": "23/11/2023"
  }
]