[
  {
    "id": 1,
    "title": "Bitcoin Core developer calls Ordinals ‘fraud,’ announces fix",
    "absoluteURL": "https://crypto.news/bitcoin-core-developer-calls-ordinals-a-fraud-announces-fix/",
    "fullContent": "With a new set of upgrades, Bitcoin Core developer Luke Dashjr hopes to put an end to BRC-20 tokens as well as Bitcoin-based NFTs. The Bitcoin (BTC) network is about to undergo a set of upgrades, which are expected to essentially put an end to BRC-20 tokens as well as non-fungible tokens (NFTs) known as Bitcoin Ordinals minted on the network. In an X post on Dec. 6, 2023, Bitcoin Core developer Luke Dashjr said that a loophole in the Bitcoin blockchain made it possible for users “to spam the blockchain,” calling Inscriptions — a way of storing metadata on the blockchain — a “bug.” PSA: “Inscriptions” are exploiting a vulnerability in #Bitcoin Core to spam the blockchain. Bitcoin Core has, since 2013, allowed users to set a limit on the size of extra data in transactions they relay or mine (`-datacarriersize`). By obfuscating their data as program code,… — Luke Dashjr (@LukeDashjr) December 6, 2023 You might also like: Elon Musk’s take on NFTs sparks support for Bitcoin Ordinals While no timetable has been set, Dashjr said Bitcoin Core is expected to fix the “vulnerability” before v27 next year. And it appears Dashjr’s “crusade” against Inscriptions divided the crypto community, with some saying the efforts made by Bitcoin developers are unlikely to be supported by miners. You went the ad-hominem route. I prefer #Bitcoin pure and just being money, we\u0027re aligned there. Still, your argument about miners forefiting profit is simply wrong. — Petkovski (📈, 🚀) (@petkovskix) December 6, 2023 However, Dashjr appears to be standing his ground, saying that NFTs on the Bitcoin network “never existed” in the first place, calling them all “fraud.” Bitcoin mempool since 2022 | Source: Mempool According to data from Mempool.space, the Bitcoin network got overloaded since February 2023, a few weeks after Bitcoin Ordinals were first launched on the network by developer Casey Rodarmor. Yet, despite technical issues, Bitcoin-based NFTs turned out to be pretty much profitable for miners as the total amount of Ordinals fees has come close to $150 million, as per data from Dune. Bitcoin Ordinals are non-fungible asset artifacts that enable the inscribing of data onto a satoshi, the smallest division of a Bitcoin. Since its launch in January 2023, the protocol has seen the inscription trend take off, leading to thousands being minted on the Bitcoin network. This has caused congestion and spikes in transaction fees, reaching a peak in April and May 2023. Read more: Binance lists ORDI, confuses it with Bitcoin Ordinals project Follow Us on Google News",
    "tags": [
      "#Bitcoin",
      "#NFT",
      "#Ordinals"
    ],
    "publishDate": "06/12/2023"
  },
  {
    "id": 2,
    "title": "OKX NFT marketplace overtakes OpenSea and Blur in trading volume",
    "absoluteURL": "https://crypto.news/okx-nft-marketplace-overtakes-opensea-and-blur-in-trading-volume/",
    "fullContent": "The daily trading volume of the OKX non-fungible tokens (NFT) marketplace has surpassed market leaders Blur and Magic Eden. On Dec. 18, the trading platform’s indicator was $45.31 million putting it in front of Blur, Magic Eden, UnitSat and OpenSea in terms of trading volume. Source: DappRadar The growth of the OKX platform is due to an increase in the trading volume of Bitcoin (BTC) NFTs. On Dec. 15, the crypto exchange listed SATS, a BRC-20 standard token, an asset that competitors like OpenSea and Blur do not yet support. Blur daily trading volume topped out at $13.48 million, while Magic Eden took third-place with $7.63 million followed by UniSat with $3.3 million. You might also like: Satoshi price explodes after Binance listing From Dec. 10 to 17, trading volume on OKX surpassed $305.44 million; the week earlier, it was $121.28 million, according to CryptoSlam. The NFT trading volume on Ethereum (ETH), by contrast, reached $93.45 million during that same period. While on Solana — the blockchain witnessing a surge in NFT activity as of late — hit $90.74 million. You might also like: NFT sales decline, Solana surpasses Ethereum’s volume In December, Ordinals tokens overloaded the BTC-20 network five times, causing transferring fees to jump. Transfer fees hit a record high of $37 per transaction this past May. You might also like: Crypto in 2024: Bitcoin to hit record highs as NFTs and fan tokens exit | Opinion Follow Us on Google News",
    "tags": [
      "#Blur",
      "#Magic Eden",
      "#NFT",
      "#OKX"
    ],
    "publishDate": "18/12/2023"
  },
  {
    "id": 3,
    "title": "Hong Kong mobile network provider launches NFT marketplace",
    "absoluteURL": "https://crypto.news/hong-kong-mobile-network-provider-launches-nft-marketplace/",
    "fullContent": "China Mobile Hong Kong, a leading mobile communication brand in Hong Kong, is launching its own NFT marketplace, LinkNFT. It will be Hong Kong’s first telecom-operated NFT marketplace. This launch coincides with the breakthrough of their comprehensive smart living mobile application, MyLink, which has acquired over seven million users. LinkNFT will offer NFT minting services for businesses, facilitating digital asset creation, trade, and circulation through various scenarios such as SocialFi, DeFi, and GameFi. It will use a trio of cross-chain standards – web3 Center cross-chain service protocol, cross-chain adapter, and cross-chain smart contract – for seamless web3 interoperability. Hong Kong residents can easily access their digital assets, including Ethereum-based ones like Opensea, through MyLink’s exclusive digital wallet “LinKey.” You might also like: SEC is taking ‘new look’ at spot Bitcoin ETF applications China Mobile Hong Kong (CMHK) has collaborated with various sectors to release over 30 NFTs on LinkNFT, including 20 commemorative editions from the MyLink ArLink series and 15 NFTs associated with publishers and music platforms like Migu Music. The total number of NFT issuance is expected to exceed 500,000. MyLink’s Metaverse digital space has also been upgraded to a comprehensive 3D immersive experience, allowing Hong Kong citizens to create their digital homes and explore a virtual Hong Kong city with various facilities like shopping malls and exhibition halls. This upgrade enables citizens to convert their Meta IDs into NFTs, fostering a unique digital community within the web3 ecosystem. Mr. Tan Hui, Executive Director of MyLink, says the new venture will allow enterprises to offer novel consumer rights through various NFTs while users enjoy collectible and circulation value. Read more: Hong Kong mulls green bond sale using blockchain Follow Us on Google News",
    "tags": [
      "#China",
      "#Hong Kong",
      "#NFT"
    ],
    "publishDate": "16/12/2023"
  },
  {
    "id": 4,
    "title": "Yuga Labs unveils CryptoPunks721 wrapper to simplify NFT trading",
    "absoluteURL": "https://crypto.news/yuga-labs-unveils-cryptopunks721-wrapper-to-simplify-nft-trading/",
    "fullContent": "Bored Ape developer Yuga Labs has rolled out a new wrapper for the CryptoPunks collection to ease trades on marketplaces. According to an X thread by Yuga Labs‘ smart contract developer, @0xQuit, the newly introduced CryptoPunks721 wrapper operates on a permissionless basis and utilizes Larva Labs‘ PunksData smart contract for on-chain metadata. The primary objective behind developing the new wrapper is to streamline the trading of NFTs from the CryptoPunks collection, originally minted in 2017, predating the widespread acceptance of the ERC-721 standard in January 2018. Last week, Yuga finalized a series of interconnected contracts that unlock new possibilities across our projects. They\u0027ll start simple, but they\u0027re designed to allow evolution over time. Introducing: Your Stash. 1/🧵 pic.twitter.com/lI5L0eapZQ — quit (👀,🦄) (@0xQuit) December 20, 2023 As noted by @0xQuit, the original NFTs from the CryptoPunks collection necessitate wrapping before being eligible for sale on key marketplaces. Wrapping involves creating a cloned token with equivalent value, while a custodian securely holds the original token. This process involves multiple transactions, resulting in high operational costs. You might also like: CryptoPunks drive NFT surge with $1.1m sale The introduction of the CryptoPunks721 wrapper aims to address these limitations by enabling both wrapping and unwrapping of C721 tokens in a single transaction, consequently reducing gas fees. Launched in 2017 by Matt Hall and John Watkinson of Larva Labs, CryptoPunks is a collection of 10,000 algorithmically generated pixel art characters in the form of NFTs on the Ethereum blockchain. Each CryptoPunk is distinct and has its own set of features, contributing to its rarity. In March 2022, Yuga Labs, the company behind the Bored Ape Yacht Club (BAYC) NFT collection, acquired the NFT series of CryptoPunks and Meebits. The financial terms of the deal were not disclosed. Read more: What’s the story behind Bored Ape Yacht Club creator Yuga Labs Follow Us on Google News",
    "tags": [
      "#CryptoPunks",
      "#Larva Labs",
      "#NFT",
      "#Yuga Labs"
    ],
    "publishDate": "21/12/2023"
  },
  {
    "id": 5,
    "title": "Heavy metal band Megadeth launches generative NFT collection",
    "absoluteURL": "https://crypto.news/heavy-metal-band-megadeth-launches-generative-nft-collection/",
    "fullContent": "Heavy metal band Megadeth took to X on Dec. 5 to announce the introduction of its 5,000-piece generative collection featuring the band’s mascot, Vic Rattlehead. This initiative transforms beyond a traditional fan club, emerging as a community owned by the fans. Introducing @MegadethDigital. Our 5000-piece generative collection featuring Vic Rattlehead brought to life in a new way by our talented artist @TheHaddy. Live on December 22nd, you\u0027ll have the opportunity to unlock doors in the real and metaverse world alike, gaining access to… pic.twitter.com/Ed9YxqCTe6 — Megadeth (@Megadeth) December 5, 2023 As part of the announcement, the band shares that the collection, MegadethDigital, brought to life by artist TheHaddy, is set to go live on Dec. 22. The collection will offer participants access to exclusive merchandise and VIP experiences, including opportunities to acquire signed items and engage in one-on-one conversations with the band members. You might also like: Megadeth Debuts on Web3 With Its “Rattleheads” NFT Collection The band is hardly the first to the NFT game where metal bands are concerned. Avenged Sevenfold was also reported to share support for the digital asset class in May of this year. A resurgence of NFTs The timing of the release may also be suitable for another reason, coinciding with a recent research report by Binance that highlighted the NFT market witnessed a notable upswing in November, signaling a reversal from its year-long decline, achieving a sales volume of $0.91 billion. This surge indicates a remarkable 200% month-over-month increase, marking the highest growth in 2023. Read more: Binance Research: NFTs witnessed turnaround in November, reversing year long downward trend Follow Us on Google News",
    "tags": [
      "#Binance",
      "#Megadeth",
      "#NFT"
    ],
    "publishDate": "06/12/2023"
  },
  {
    "id": 6,
    "title": "SOL becomes 4th in market cap, overtaking BNB",
    "absoluteURL": "https://crypto.news/sol-becomes-4th-in-market-cap-overtaking-bnb/",
    "fullContent": "Solana (SOL) token has surpassed BNB from the Binance cryptocurrency exchange in terms of market capitalization. SOL’s capitalization reached $41.724 billion, and BNB’s capitalization was $41.721, according to CoinMarketCap. However, Solana’s trading volumes are more than three times higher than BNB’s in the last 24 hours. The price of SOL has increased by 78% over the month and by 15% in the last 24 hours amid rapid growth in market capitalization. On Dec. 20 the token overtook Ripple’s XRP in market capitalization and broke into the top 5 of the ranking. The growth of Solana’s price has caused an increase in interest in the ecosystem and activity on the blockchain. Source: CoinMarketCap The number of Google searches for “Solana” also increased by 250% from the beginning of October to the beginning of December. In addition to the network’s native token, other tokens issued on the Solana chain have also recently increased in price. Meme coin Bonk (BONK) rose in price by more than 10,000% and entered the list of the most significant crypto assets. Solana stands out with its hybrid consensus mechanism, combining Proof of Stake and Proof of History, enabling more efficient transaction processing than Bitcoin’s Proof of Work and Ethereum’s Proof of Stake. It also excels in transaction speed and capacity, handling around 65,000 transactions per second, and offers significantly lower transaction fees compared to both Ethereum and Bitcoin. It is noteworthy that last year, after the collapse of the FTX cryptocurrency exchange, which was one of the leading investors of Solana, many predicted the end of the ecosystem. The exit of a key investor from the market and the risks of a coin sale triggered the fall of Solana. With SOL freed from pressure from a powerful partner, the project’s fate no longer seems unclear, a situation some see as increasing Solana’s investment attractiveness. Read more: Solana ecosystem projects for exploration in 2024 Follow Us on Google News",
    "tags": [
      "#BNB",
      "#Bull Market",
      "#Meme Coin",
      "#Solana"
    ],
    "publishDate": "22/12/2023"
  },
  {
    "id": 7,
    "title": "El Salvador Congress green lights citizenship for investments in BTC",
    "absoluteURL": "https://crypto.news/el-salvador-congress-green-lights-citizenship-for-investments-in-btc/",
    "fullContent": "The El Salvadoran Congress has approved a law to speed up the citizenship acquisition for those who make donations in Bitcoin (BTC). El Salvador’s Congress, with backing from President Nayib Bukele’s New Ideas party, has passed a migration law that offers fast-tracked citizenship to foreigners who contribute to government social and economic programs through Bitcoin donations. This unexpected decision, made in a late-night vote by the unicameral legislature on Dec. 21, is expected to come into enforcement in the coming days, per a Reuters report. However, the law does not contain any minimum requirements for a donation. The reform stipulates that those who qualify will skip the standard need for the naturalization process of five years of continuous residence for anyone from a non-Hispanic country or two years if the person has a Salvadoran spouse. You might also like: Few people sent money to El Salvador using Bitcoin and Crypto in H1 2023 At the same time, it was previously reported that anyone can get the El Salvador Freedom Visa if one invests $1 million in BTC or USDT for the country’s development. The main goal of such an initiative is “to benefit the economy, culture, and people of El Salvador.” It is designed to create conditions in which people can independently contribute to forming a new economy for the country and a better future for the first cryptocurrency. El Salvador made Bitcoin its national currency in 2021. Although its adoption has been slow and its use limited, since November 2022, El Salvadoran authorities have been purchasing 1 BTC a day in a bid to shore up the country’s treasury. Read more: VanEck: El Salvador’s Bitcoin adoption to fuel economic renaissance Follow Us on Google News",
    "tags": [
      "#Bitcoin",
      "#BTC Investments",
      "#El Salvador"
    ],
    "publishDate": "22/12/2023"
  },
  {
    "id": 8,
    "title": "Solana Mobile faces inventory challenges amid high demand for Saga",
    "absoluteURL": "https://crypto.news/solana-mobile-faces-inventory-challenges-amid-high-demand-for-saga/",
    "fullContent": "Solana Mobile’s third-party distributor faced inventory issues, sparking order cancellations and refunds for affected customers. In an X post on Dec. 22, Solana Mobile, a mobile tech company developing the Solana Mobile Stack and Saga, revealed that a high surge in demand for its Saga product resulted in sellouts across the United States and the European Union. Last week, we saw an overwhelming demand for Saga, with sellouts in both the US \u0026 EU on our limited inventory of 20,000 devices produced globally. In working to fulfill orders, we learned of an inventory management issue with our third-party distributor that resulted in an… — Solana Mobile 🌱 (@solanamobile) December 22, 2023 However, amid the hype, the company, which had a limited inventory of 20,000 devices produced globally, is facing challenges in fulfilling orders due to an inventory management issues with a third-party distributor. “In working to fulfill orders, we learned of an inventory management issue with our third-party distributor that resulted in an inaccurate representation of our inventory.” Solana Mobile The inventory problem led to inaccuracies in representing the available stock that is preventing the company from fulfilling orders placed after the inventory had been depleted. Additionally, orders flagged for suspicious activity, such as those with excessive device quantities or payment risk, were also canceled, Solana Mobile added. You might also like: Solana Saga called by tech-industry critic as worst smartphone of 2023 Customers impacted by the cancellations have been notified, with refunds scheduled to be processed in the coming days, the company says. For those who have not received a cancellation notice, Solana Mobile assured that their Saga devices are en route. Unveiled in late October 2022, the Solana Saga is an IP68-rated smartphone running on Android, featuring a 120Hz AMOLED screen, a 50MP primary camera, and up to 1TB of storage, with an initial price of $1,000. Ever wondered about the security of your Web3 devices? Our newest exploration reveals a significant bootloader vulnerability in the Solana Phone, a challenge not just for this device but for the entire industry. Our commitment to enhancing security standards is unwavering. 🔐… pic.twitter.com/lHZ5W7hXzy — CertiK (@CertiK) November 15, 2023 In mid-November 2023, the blockchain security firm CertiK released a video demonstrating a critical vulnerability exploit on Solana’s flagship Saga phone. According to the firm’s analytics, the Solana Saga phone has a significant vulnerability that could allow hackers to create a backdoor into its software and compromise the device. However, shortly after the news surfaced, Steven Laver, the lead mobile software engineer at Solana Labs, commented to the media that the video does not disclose any known vulnerabilities or security risks for Saga owners. In early December, during an appearance on Laura Shin’s Unchained podcast, Solana CEO Anatoly Yakovenko acknowledged that the smartphone faced an uncertain future due to disappointing sales. Nevertheless, once the BONK craze began, Solana’s smartphones quickly sold out as Saga owners could claim free 30 million BONK tokens, equivalent to about $565, as of press time. Read more: Solana Mobile launches Saga developer kit program Follow Us on Google News",
    "tags": [
      "#BONK",
      "#Cryptocurrency",
      "#Solana"
    ],
    "publishDate": "22/12/2023"
  },
  {
    "id": 9,
    "title": "Crypto exchange Coinbase to reorganize priorities in 2024 to work ‘more efficiently’",
    "absoluteURL": "https://crypto.news/crypto-exchange-coinbase-to-reorganize-priorities-in-2024-to-work-more-efficiently/",
    "fullContent": "Coinbase set to undergo a shift in operational efficiency as CEO Brian Armstrong introduces a new initiative called ‘Delete Week.’ In a blog post on Dec. 21, Brian Armstrong revealed he had sent a note to employees unveiling a new initiative designed to streamline the company’s business. To “operate even more efficiently in the new year.” In the letter, Armstrong said the new concept called “Delete Week,” slated for Q1, 2024 between Jan. 8 and Jan. 12, will try to eliminate complexities such as features or products, lines of code, backend services, security measures, meetings, Slack channels, policies, internal and external documentation and many more. Inspired by the philosophy that subtraction is a powerful tool for founders, with insights from board member Tobi Lütke, the co-founder and CEO of Shopify, Armstrong emphasized the initiative is just an experiment. However, the Coinbase CEO noted a successful Delete Week should result in a 10% reduction or more, highlighting the commitment to significant simplification. “If you’re not sure whether it’s worth deleting something, my push is to try it, as it’s OK if we need to add it back later. If we don’t end up adding back at least 10%, we didn’t delete enough.” Brian Armstrong You might also like: Coinbase ends GiveCrypto initiative, prompting crypto charity scrutiny With the initiation of Delete Week, Coinbase appears to be optimizing its operations, given that its operating expenses still significantly surpass its net revenue. As of Q3, Coinbase’s total operating expenses stood at $754 million, while net revenue was $623 million. In the Q3 shareholder letter, the exchange projected that by the end of 2023, technology, development, and general administrative expenses would amount to $575 million. Following the announcement of the new initiative, Coinbase’s COIN shares experienced a surge of 3.8%, reaching $168.03. Consequently, the firm’s market capitalization reached the $40.2 billion mark, according to Google Finance. Read more: ARK sells Coinbase,Robinhood shares amid impressive stock growth Follow Us on Google News",
    "tags": [
      "#Brian Armstrong",
      "#Coinbase",
      "#Cryptocurrency"
    ],
    "publishDate": "22/12/2023"
  },
  {
    "id": 10,
    "title": "Marathon Digital’s stock performance peaks in 2023 as BTC halving draws nearer",
    "absoluteURL": "https://crypto.news/marathon-digitals-stock-performance-peaks-in-2023-as-btc-halving-draws-nearer/",
    "fullContent": "Bitcoin miner Marathon Digital Holdings (MARA) has experienced a remarkable surge in its stock value, with a 622.8% increase throughout 2023, even though it has previously faced a substantial decline from its all-time high levels. The current price of Marathon Digital Holdings (MARA) sits at $24.78, a figure which, however, still represents an approximate 85% decline from its all-time high of $166.40 reached in March 2012. Marathon Digital stock 1 year price chart | Source: Google Finance The stock’s remarkable performance coincides with pivotal developments in the cryptocurrency market, particularly the anticipated decision by the US Securities and Exchange Commission (SEC) regarding the approval of the spot Bitcoin Exchange-Traded Fund (ETF), expected by Jan. 10. The approval of this ETF is expected to bring a massive influx of capital into the market, with major institutions like BlackRock and Grayscale potentially offering it to their clients. Amidst these market speculations, Marathon Digital’s CEO and Chairman, Fred Thiel, has pointed to the company’s “significant progress” in strengthening its financial position, a factor he considers crucial in the lead-up to the Bitcoin halving event scheduled for April 2024. You might also like: Bitcoin halving 2024: Expert predictions point to major BTC price surge This BTC halving event, which occurs approximately every four years, is expected to impact miners’ rewards and has been a topic of discussion within the industry regarding its potential effects on profitability. This comes after recent reports that Marathon Digital has recently announced a significant move towards increasing its operational capacity. The BTC mining firm has formalized a purchase agreement to acquire two fully operational Bitcoin mining sites, which together offer 390 megawatts of capacity. As earlier reported by crypto.news, the deal, valued at $178.6 million, represents a significant shift for Marathon Digital as the company moves from its previous asset-light structure to managing a more diverse range of Bitcoin mining operations. Financially, Marathon Digital has demonstrated a significant turnaround, reporting a net income of $64.1 million in the third quarter, a stark contrast to a net loss of $72.5 million during the same period in the previous year. This improvement in financial performance is attributed to a 467% increase in Bitcoin production coupled with a 32% rise in the average price of Bitcoin, resulting in a substantial growth in quarterly revenues to $97.8 million. Valuation challenges in wake of financial success Despite these developments, Marathon Digital has not escaped scrutiny as MinerMetrics has identified the company as one of the most overvalued in the crypto mining sector, citing a high enterprise value-to-sales (EV/S) ratio of 5.6. This elevated valuation is influenced by Marathon’s visibility and favorable standing among institutional investors, which has facilitated better access to capital and, consequently, a higher market valuation. MARA’s power costs are some of the highest among public miners. However, Bitcoin transaction fees peaked at a record two-year high, thereby adding around 30% higher mining rewards for miners. Looking ahead, Marathon Digital is positioning itself for further growth, with plans to increase its hash rate by approximately 30% in 2024. Read more: Marathon Digital mined 1,187 BTC in November amidst record network difficulty Follow Us on Google News",
    "tags": [
      "#Bitcoin",
      "#Bitcoin ETF",
      "#Bitcoin Halving",
      "#BlackRock",
      "#Grayscale",
      "#Marathon Digital Holdings"
    ],
    "publishDate": "22/12/2023"
  }
]