[
  {
    "title": "Recent Studies Reveal Personal Experiences as Key Drivers in NFT Market Movements",
    "absoluteURL": "https://www.todaynftnews.com/recent-studies-reveal-personal-experiences-as-key-drivers-in-nft-market-movements/",
    "fullContent": "SNEAK PEEK New research studies offer fresh insights into the NFT market, emphasizing the roles of personal experiences, luck, scarcity, and optimism. Guneet Kaur Nagpal and Luc Renneboog’s study on CryptoPunks reveals Ethereum investors’ tendencies towards higher-cost activities and gains. The research indicates that Ethereum’s market performance influences asset sale decisions more than NFT prices. In a fascinating twist in understanding the nonfungible token (NFT) market, new research studies have revealed that personal experiences, luck, scarcity, and consumer optimism play crucial roles in market dynamics. This insight emerges from a trio of studies conducted by academicians from several prestigious institutions, offering a fresh perspective on the factors influencing the NFT landscape. At the forefront of these studies, researchers Guneet Kaur Nagpal from Western University and Luc Renneboog from Tilburg University explored the market dynamics of CryptoPunks, a leading NFT asset collection. Their study, “On Nonfungible Tokens, Blockchain Hypes, and the Creation of Scarcity,” highlighted that Ethereum (ETH) investors were more inclined to engage in higher-cost market activities and experienced significant gains. Interestingly, the study noted that ETH’s market performance did not directly influence NFT prices but impacted decisions on asset sales. Meanwhile, Chuyi Sun of the University of North Carolina at Chapel Hill delved into how personal experiences shape market behavior in the NFT domain. In the study “Personal Experience Effects across Markets: Evidence from NFT and Cryptocurrency Investing,” Sun analyzed data from approximately one million wallets. The findings revealed that investors receiving more valuable NFTs in initial offerings were likelier to engage in subsequent NFT purchases and gravitate towards speculative cryptocurrencies. Contrastingly, a study from the Rennes School of Business, “The Impact of Experience, Overconfidence and Optimism on Future Cryptocurrency Ownership,” conducted by Akanksha Jalan and Roman Matkovskyy, brought to light an intriguing aspect of investor behavior. Contrary to expectations, negative past experiences and investor optimism positively influenced future engagements in cryptocurrencies and NFTs. This trend suggests a unique resilience among investors, attributing losses to external factors like market volatility rather than personal decision-making. These studies offer a nuanced understanding of the NFT market, moving beyond conventional economic models. They underscore the importance of personal experiences and psychological factors in driving market trends. This research paves the way for a deeper exploration of the human elements behind the burgeoning world of NFTs, suggesting that market movements are as much about individual stories and perceptions as they are about economic indicators. The recent findings challenge traditional market theories, highlighting the complex interplay of personal experiences, luck, scarcity, and optimism in shaping the future of NFTs. This new knowledge enriches our understanding of the NFT market and opens doors for more human-centric approaches to studying digital asset economies.",
    "tags": [
      "#Blockchain",
      "#NFT market"
    ],
    "publishDate": "30/11/2023"
  },
  {
    "title": "Bioniq Ushers in a New Era in Bitcoin NFT Trading with ICP Integration",
    "absoluteURL": "https://www.todaynftnews.com/bioniq-ushers-in-a-new-era-in-bitcoin-nft-trading-with-icp-integration/",
    "fullContent": "SNEAK PEEK Bioniq emerges as a key player in cryptocurrency with a Bitcoin NFT marketplace The platform uses Internet Computer Protocol to reduce network congestion and fees. Bioniq offers contract auctions and a cross-chain wallet bridging Bitcoin and ICP. Bioniq has emerged as a pivotal player in the dynamic world of cryptocurrency, launching an innovative Bitcoin nonfungible token (NFT) marketplace. This platform stands out for its strategic use of the Internet Computer Protocol (ICP), significantly reducing the network congestion and high fees often associated with Bitcoin Ordinals inscriptions. Developed in the wake of the creation of Bitcoin Ordinals in early 2023, Bioniq is set to revolutionize the way Bitcoin-based NFTs are traded. Leveraging the ICP’s native Bitcoin integration, Bioniq has crafted a seamless marketplace featuring innovative contract auctions and a comprehensive cross-chain wallet bridging Bitcoin and ICP. Bob Bodily, CEO and co-founder of Bioniq emphasized the platform’s quick response to the immense potential of Ordinals, starting its development as early as February 2023. The platform’s innovation doesn’t stop there. Bioniq introduces an intelligent wallet, enabling users to manage their private keys through Web3Auth. This feature brings the convenience of logging in via standard Web2 Google accounts while retaining noncustodial control over wallets and assets. Furthermore, Bioniq capitalizes on the advantages of partially signed Bitcoin transactions (PSBTs) integrated within the ICP’s Bitcoin network. This integration allows for smart contract capabilities directly on Bitcoin, bypassing the need for centralized cross-chain bridges. Backed by influential names like Polychain Capital, Bioniq takes a unique approach by treating Internet Computers as a Bitcoin layer-2 network. This strategy harnesses the ICP’s efficiencies in time and cost through a token-wrapping process. Users can transfer their Bitcoin and Ordinals assets into Bioniq’s wallet, opting to wrap their assets for safekeeping while generating equivalent NFTs on the ICP network. This process enables trading on the ICP network, free from the usual gas or transaction fees and immune to the Bitcoin network’s speed limitations. Bioniq’s launch addresses the market capitalization growth of BRC-20 tokens and tackles the issue of Bitcoin network congestion. The platform’s unique approach offers a more reliable and efficient trading experience, even in high Bitcoin fee environments. Looking ahead, Bioniq plans to expand its offerings, including a launchpad for new collections, a crypto borrowing feature using Ordinals assets as collateral, and a platform for collection offers targeting specific projects. This holistic approach marks a significant step forward in the crypto marketplace, bringing efficiency and innovation to the forefront.",
    "tags": [
      "#Bitcoin",
      "#NFT market"
    ],
    "publishDate": "30/11/2023"
  },
  {
    "title": "Solana’s Mad Lads NFTs Eclipse Bored Ape Yacht Club Sales",
    "absoluteURL": "https://www.todaynftnews.com/solanas-mad-lads-nfts-eclipse-bored-ape-yacht-club-sales/",
    "fullContent": "SNEAK PEEK Mad Lads, a Solana-based NFT, reaches a new floor price of 123 SOL or over $7,100. In November, the collection’s value more than tripled, indicating rapid growth. Mad Lads outperformed other NFTs with over $1.39 million in 24-hour sales. The digital asset space is witnessing a remarkable surge in the value and popularity of Mad Lads, a Solana-based profile picture (PFP) NFT collection. Outperforming many leading NFT projects, Mad Lads has reached new heights in its floor price and sales volume. As noted by Solana Floor data, Mad Lads’ entry price has recently experienced a significant increase. The collection’s floor price now stands at 123 SOL, equating to over $7,100. This marks a substantial rise, with the price more than tripling in November alone. On November 13, Decrypt reported the collection’s floor value at nearly $4,500 worth of SOL, highlighting a robust growth trajectory. Regarding sales, Mad Lads is making waves in the secondary markets. Over the past 24 hours, sales have exceeded $1.39 million, according to CryptoSlam data. This volume surpasses other notable NFT projects, including the Fortune Founder’s Pass from Army of Fortune and the renowned Bored Ape Yacht Club on Ethereum. The latter registered approximately $881,000 in sales, while Solana’s Tensorians followed closely with about $810,000. Several elements contribute to the increasing demand and value of Mad Lads. The Solana token has seen significant appreciation, rising from around $21 to a current value of $58, even touching $65 recently. This price increase has impacted the broader Solana NFT market, with sales topping $62 million in November, a steep rise from October’s $28 million. Mad Lads distinguishes itself with unique attributes. Developed by startup Coral, the collection integrates with the Backpack app and its executable NFTs (xNFTs) standard, providing a range of experiences around tokenized assets. Coral’s upcoming crypto exchange, licensed in Dubai and led by former FTX general counsel Can Sun, has also added to the project’s appeal. Mad Lads NFT holders were given priority access to exchange signups and received PYTH tokens during the recent Pyth Network airdrop on Solana. These factors, combined with the project’s innovative approach and exclusive holder benefits, fuel the increasing demand for Mad Lads NFTs. Mad Lads’ success is not just a triumph for the project itself but also signifies a pivotal moment in the NFT sector, especially for Solana-based projects. Its performance against Ethereum’s Bored Ape Yacht Club, a long-time leader in the NFT market, suggests a shift in investor interest toward Solana’s ecosystem. This shift could lead to increased competition and innovation within the NFT space as projects strive to offer unique benefits and experiences to their communities. As the NFT market continues to evolve, the success of collections like Mad Lads will likely inspire new developments and trends within this dynamic and ever-changing industry.",
    "tags": [
      "#Bored Ape Yacht Club",
      "#NFT market",
      "#Solana"
    ],
    "publishDate": "29/11/2023"
  },
  {
    "title": "Bored Ape Yacht Club Member Almost Falls for a Phony Forbes Scheme While Seeking a Banana",
    "absoluteURL": "https://www.todaynftnews.com/bored-ape-yacht-club-member-almost-falls-for-a-phony-forbes-scheme-while-seeking-a-banana/",
    "fullContent": "SNEAK PEEK A Bored Ape Yacht Club member named Crumz narrowly escaped a sophisticated scam disguised as an interview opportunity with Forbes. The scammer impersonated Forbes editor Robert LaFanco and contacted Crumz directly by message. Red flags included a non-premium Zoom account and a request to use a separate screen recording bot. In a recent turn of events, the Bored Ape Yacht Club (BAYC) community has witnessed an alarming scam attempt. A member of this prestigious NFT group, known as Crumz, narrowly escaped a well-orchestrated scheme. The scam, posing as an opportunity for an interview with Forbes, targeted Crumz through a direct message from an impersonator of Robert LaFanco, a real Forbes editor. Crumz faced several red flags during the interview, including the interviewer’s non-premium Zoom account and a request to use a separate recorder bot for screen recording. Despite these signs, Crumz initially complied with the requests. The scammer asked Crumz to fetch a banana, supposedly to add a personal touch related to his BAYC NFT. However, Crumz later realized that this request was a ploy to distract him and gain control of his computer remotely. 🚨🚨SCAM ALERT!!🚨🚨 I just spent the last 2hours on Zoom with \u0027@Forbes\u0027 it was pretty sophisticated and well thought out because I\u0027m usually on high alert but luckily I wasn\u0027t caught. Here\u0027s what they did. 🧵1/8 — Crumz 🇮🇪 (@crumz10) November 26, 2023 Upon refusing to leave his computer, Crumz observed the scammers attempting to take over his screen. He acted quickly to prevent any potential theft of his valuable digital assets. This incident highlights the growing sophistication of scams within the NFT community. Similar scams have been reported, involving fake journalists luring NFT owners into compromising their security for a supposed media feature. This case serves as a warning to the NFT community, particularly high-value asset holders like BAYC members. The incident underscores the importance of vigilance and skepticism when dealing with unsolicited offers, especially those involving access to personal or digital assets. The BAYC community and broader NFT holders are now more aware of these tactics, thanks to the sharing of this experience by Crumz and others who have encountered similar situations. As the NFT market thrives, collectors must stay informed and cautious. This incident not only reflects the vulnerabilities within the digital asset space but also the resilience of its members in the face of evolving cyber threats.",
    "tags": [
      "#Bored Ape Yacht Club",
      "#NFT market"
    ],
    "publishDate": "28/11/2023"
  },
  {
    "title": "Pudgy Penguins Unveil Limited Edition Walmart ‘Influencer Package’ for Cyber Monday",
    "absoluteURL": "https://www.todaynftnews.com/pudgy-penguins-unveil-limited-edition-walmart-influencer-package-for-cyber-monday/",
    "fullContent": "SNEAK PEEK Pudgy Penguins, an Ethereum-based NFT giant, is launching an exclusive ‘Influencer Box’ through Walmart on Cyber Monday. Priced at $25 on Walmart.com, this bundle offers significant savings compared to the regular price of individual items. Pudgy Penguins has a strategic partnership with Walmart, distributing their toy line across over 2,000 U.S. stores. Ethereum-based NFT giant Pudgy Penguins marks a distinctive entry into the retail arena this Cyber Monday with an exclusive offering through Walmart. The unique ‘Influencer Box,’ a blend of physical and digital collectibles, demonstrates the brand’s innovative approach in a fluctuating market. It aimed at mainstream consumers; this box includes a variety of engaging items: a 12-inch plush toy, an action figure, a clip-on plush, an igloo toy, and a certificate for a complimentary NFT on the zkSync Era, redeemable on the Pudgy World gaming platform. With a promotional price of $25, exclusively available on Walmart.com, this bundle represents significant savings from its regular combined item value. Each 12-inch plush toy, part of this collection, is usually priced between $20 and $25. Pudgy Penguins’ strategic partnership with Walmart has already seen their toy line distributed across over 2,000 stores in the United States, according to Brittany Smith, Walmart U.S. VP. This collaboration underscores a unique fusion of physical and digital play experiences for children. This Cyber Monday we partnered with @Walmart to release our influencer box bundle, exclusively on their website. Details below. pic.twitter.com/KbOGAcBuws — Pudgy Penguins (@pudgypenguins) November 27, 2023 The Pudgy Penguins collection, initially launched in 2021 amidst the NFT boom, has experienced notable growth and transformation under the leadership of entrepreneur Luca Netz. Acquired for $2.5 million during community unrest, Netz’s stewardship has seen the project’s Instagram following exceed a million, alongside expansion into new product lines. The collection’s impressive value increase highlights this growth trajectory: an all-time high of over $13,000 in ETH, marking a sevenfold rise since Netz’s takeover in April 2022. Despite the broader market downturn since May 2022, Pudgy Penguins stands out as a resilient and growing NFT project in USD value. Their continuous innovation, as seen with the latest Cyber Monday exclusive, showcases their commitment to staying relevant and accessible in a changing digital landscape. This newest offering aligns with their broader strategy of expanding their brand presence and appeal beyond the traditional NFT space, reaching out to a more varied consumer base.",
    "tags": [
      "#NFT market",
      "#Pudgy Penguins NFT"
    ],
    "publishDate": "28/11/2023"
  },
  {
    "title": "Azuki DAO Undergoes Rebranding to ‘Bean’, Withdraws Legal Action Against its Founder",
    "absoluteURL": "https://www.todaynftnews.com/azuki-dao-undergoes-rebranding-to-bean-withdraws-legal-action-against-its-founder/",
    "fullContent": "SNEAK PEEK Azuki DAO rebrands to “Bean,” marking a significant shift in strategy. The DAO drops a lawsuit against NFT collection founder Zagabond. Bean transitions to a memecoin project within Ethereum’s Blast ecosystem. In a significant shift, Azuki DAO, the decentralized autonomous organization associated with the Azuki nonfungible token (NFT) series, has announced a rebranding to “Bean.” This change comes alongside the decision to drop a previously proposed lawsuit against the NFT collection’s founder, Zagabond. The legal action concerned a contentious $39 million NFT minting event in June, initially stirring up substantial debate within the community. Moreover, the rebranding marks a strategic pivot for the DAO. Bean will transition into a memecoin project as part of its new direction, integrating into the Ethereum layer-2 Blast ecosystem. This move will enhance the project’s presence and capabilities within the digital asset space. Developers have revealed that Bean has already garnered significant support, securing $10 million in funding from notable investors. This financial backing aims to accelerate the project’s growth and development within the Blast ecosystem. The proposed Bean memecoin will have a total supply of 1 billion tokens, indicating the project’s ambitions for widespread adoption and utility. Additionally, there have been updates regarding the token distribution plan. Initially, as outlined on the DAO’s website, the plan detailed a 40% allocation of tokens to the treasury, 50% to Azuki DAO members, and 10% to Zagabond, the Azuki NFT creator. It also stated that minting would be exclusively available to Azuki NFT holders, with a 24-hour window for action, after which any unclaimed tokens would be subject to burn. However, recent clarifications indicate changes in the distribution strategy. The follow-up statement from the developers specified that “50% of the $Bean [token] was allocated to the Azuki DAO community for the airdrop of Azuki series NFTs,” a process concluded four months ago. The statement also confirmed that “40% of $Bean [token] was allocated to the Bean Treasury, and 10% of $Bean was allocated to Zagabond.” Godspeed @cz_binance pic.twitter.com/jIaCj43sx8 — ZAGABOND.ETH (@ZAGABOND) November 21, 2023 This rebranding and strategic shift signify a new chapter for the former Azuki DAO, now Bean. By dropping the lawsuit and embarking on a fresh path with a memecoin project, the organization is set to explore new horizons in the blockchain and NFT sphere. The move reflects decentralized organizations’ dynamic and evolving nature and the digital asset industry.",
    "tags": [
      "#Azuki NFT",
      "#NFT market"
    ],
    "publishDate": "27/11/2023"
  },
  {
    "title": "Square Enix Reveals Auction Schedule for Symbiogenesis Non-Fungible Tokens",
    "absoluteURL": "https://www.todaynftnews.com/square-enix-reveals-auction-schedule-for-symbiogenesis-non-fungible-tokens/",
    "fullContent": "SNEAK PEEK Square Enix, known for the Final Fantasy series, is venturing into the NFT space with its blockchain game Symbiogenesis. The game combines narrative-driven gameplay with Ethereum-based NFTs, marking a new direction for the company in blockchain technology. Symbiogenesis auctions are divided into three phases, starting with an exclusive event for early backers on Nov 27 and 28. Square Enix, the renowned developer behind the Final Fantasy series, has recently unveiled its latest venture into the world of nonfungible tokens (NFTs) by announcing auction dates for its upcoming blockchain game, Symbiogenesis. Set to revolutionize the gaming and digital collectible experience, Symbiogenesis introduces a unique blend of narrative-driven gameplay and Ethereum-based NFTs. This innovative approach marks a significant stride in Square Enix’s exploration of blockchain technology following their successful introduction of Final Fantasy NFT trading cards earlier this year. 来週より、いよいよオークションが開催！ フェーズ1：11/27 12:00～11/28 11:59 フェーズ2：11/30 12:00～12/1 11:59 フェーズ3：12/2 12:00～12/3 11:59 詳しくはこちらhttps://t.co/MFprrAq47W#SYMBIOGENESIS — SYMBIOGENESIS -NFT Art＆Game Project- | SQUARE ENIX (@symbiogenesisPR) November 24, 2023 The auctions for Symbiogenesis NFTs are scheduled in three distinct phases, each offering a different array of digital collectibles. The first phase, slated for Nov 27 to 28, is an exclusive event targeting early backers, termed “stakeholders.” This phase will feature a selection of facet and mesh characters intricately designed to capture the essence of the Symbiogenesis universe. This exclusive access underscores the company’s appreciation for early investors’ support. Following this, the second auction phase, from Nov 30 to Dec 4, and the third phase, from Dec 2 to 3, will open doors to a broader audience. Eligibility for these phases was determined through an allowlist entry campaign, which Square Enix conducted from Nov 7 to 21. This campaign was an engaging blend of quizzes and a treasure hunt within a prototype of the game world, adding an interactive element to the qualification process. Top performers in the campaign, specifically the 50 highest scorers, along with 40 randomly chosen participants from the 51st to 300th rank, earned the privilege to acquire NFTs in the second phase. The remaining participants can bid in the third phase, ensuring an inclusive participation spectrum. Symbiogenesis, described as a “narrative-unlocked NFT entertainment” game, is more than a digital collectible platform. It promises an immersive story-driven experience intertwined with the ownership and trade of unique NFTs. The scheduled launch date for this ambitious project is Dec 21, a day anticipated by gaming and crypto enthusiasts alike. Square Enix’s move into blockchain gaming reflects the company’s adaptability and innovative spirit in the ever-evolving digital entertainment landscape. With a legacy of over 173 million units sold in the Final Fantasy series alone, Square Enix’s foray into NFTs with Symbiogenesis is not just an expansion of their digital offerings but a testament to their commitment to staying at the forefront of gaming technology. As the gaming world eagerly awaits the arrival of Symbiogenesis, it stands as a beacon of the exciting possibilities that blockchain technology brings to interactive storytelling and digital ownership.",
    "tags": [
      "#Gaming",
      "#NFT market"
    ],
    "publishDate": "25/11/2023"
  },
  {
    "title": "Cool Cats NFTs Soar in Macy’s Parade and Expand Digitally: A Multifaceted Evolution",
    "absoluteURL": "https://www.todaynftnews.com/cool-cats-nfts-soar-in-macys-parade-and-expand-digitally-a-multifaceted-evolution/",
    "fullContent": "SNEAK PEEK Cool Cats NFTs make the mainstream leap with Macy’s Parade debut and YouTube Shorts series. Blue Cat NFTs reached “blue chip” status despite crypto market challenges in 2021. The brand’s diversification into gaming, merchandise, and real-world integration marks its evolution into a global lifestyle brand. The iconic NFT collection Cool Cats took a significant leap into mainstream visibility, debuting as a balloon in the Macy’s Thanksgiving Day Parade. This move coincides with the launch of a YouTube Shorts series, “The Milk Chug.” Hence, it marks a pivotal moment for the brand, which originated from the creative mind of artist Colin ‘Clon’ Egan. It’s almost time! 💙 pic.twitter.com/s7ObSNWOQ7 — clon (@cloncast) November 23, 2023 Initially, Clon’s Cool Cats appeared as simple artwork. However, they gained substantial traction after transitioning to Instagram in 2015. The pivotal year for Cool Cats was 2021 when 9,999 Blue Cat PFPs (Profile Picture) NFTs were released. Significantly, the collection became a “blue chip” project in the NFT boom, with prices peaking at an average of $92,000. However, the road could have been smoother. The broader crypto market downturn and community discontent saw a drop in the value of these NFTs. Consequently, the Cool Cats Group sought to diversify and expand its reach. This strategy included plans to extend to multiple blockchain networks and license its IP to game studios. Moreover, this diversification strategy is already in motion. Notably, three well-established gaming publishers, nWay, iCandy, and Sync Studios, have been tapped for game development using the Cool Cats brand. All these games are currently in the works and are expected to be released between 2023 and 2024. Additionally, a limited-edition Cool Cats hoodie will be available in a unique blend of physical and digital worlds. This hoodie, featuring an NFC tag linked to an Azuki physical-backed token, illustrates the brand’s commitment to integrating its digital assets with real-world products. We’re about to turn New York City into Blue York City! Here’s your first look at our OFFICIAL @Macys Thanksgiving Day Parade balloon🎈 Who is going to come see it in person? pic.twitter.com/WjoKmqTkiJ — Cool Cats (@coolcats) September 14, 2023 This strategic expansion into gaming and merchandise and its high-profile appearance at the Macy’s Parade positions Cool Cats as a forward-thinking brand. It is adapting to the changing landscapes of digital assets and consumer engagement. The Cool Cats’ foray into various entertainment and product avenues signifies its evolution from a simple NFT collection to a comprehensive global brand. Consequently, this positions Cool Cats not just as a player in the digital art world but as a multifaceted entertainment and lifestyle brand.",
    "tags": [
      "#Cool Cats NFT",
      "#NFT market"
    ],
    "publishDate": "24/11/2023"
  },
  {
    "title": "Matr1x’s $10M Boost for Mobile Gaming Innovations",
    "absoluteURL": "https://www.todaynftnews.com/matr1xs-10m-boost-for-mobile-gaming-innovations/",
    "fullContent": "SNEAK PEEK Matr1x secures $10M for innovative NFT gaming, led by Folius Ventures and SevenX, signaling a significant industry shift. Focus on skill-based gameplay in Matr1x Fire aims to redefine mobile gaming, balancing creativity with legal challenges. Despite being compared to existing titles, Matr1x’s strategic NFT collections and esports ambitions are heralding a new era in gaming. Matr1x, a Singapore-based NFT gaming company, has secured an impressive $10 million in its latest funding round. Consequently, this inflow of capital marks a significant milestone for the company. Folius Ventures spearheaded this A-2 round. Moreover, SevenX, a crypto VC firm, contributed as a co-lead investor. Additionally, the investment was joined by notable names like ABCDE Capital, Jambo, and Initiate Capital. Find Satoshi Lab, known for Stepn and Gas Hero, also participated. 🚀BANG BANG BANG! We’ve hit a monumental $10M in our A-2 funding round, skyrocketing our total to $20M. A rousing welcome to our new allies – @FoliusVentures, @SevenXVentures , @ABCDELabs , @fslweb3 (makers of @stepnofficial \u0026 @gasheroofficial) , @initiatecapital, and… pic.twitter.com/xL6rdJRuQG — MATR1X FIRE｜🐾 KUKU NFT Pre-Launch (@Matr1xOfficial) November 23, 2023 Jason Kam, the founder of Folius Ventures, expressed confidence in Matr1x. He highlighted the company’s potential to redefine the gaming industry. Hence, Kam believes Matr1x could navigate the crypto slowdown and achieve mass market appeal. Significantly, Matr1x is focusing on a first-person shooter game, Matr1x Fire. This game draws aesthetic inspiration from Riot Games’ Valorant. It features similar maps, weapons, and character designs. Matr1x Fire emphasizes team play, where five-person teams compete. However, unlike Valorant, it eschews special powers for a skill-based approach. This approach aligns more with CS:GO’s gameplay style. Additionally, Matr1x aims to establish an esports presence for its game, which remains under development. The studio has introduced two NFT collections and is currently in the process of developing a third collection. This upcoming collection will provide opportunities for governance participation and a stake in the creator economy, along with featuring an upgradeable Battle Pass. However, there are concerns within the gaming community. Some gamers draw parallels between Matr1x Fire and NetEase’s Hyper Front. Riot Games previously sued NetEase over Hyper Front, alleging it copied Valorant. As a result, Hyper Front was shut down. Many fear a similar fate for Matr1x Fire. The game has already garnered labels like “Valorant Mobile” in early-access footage. Despite these concerns, Matr1x is forging ahead. The company is transparent in its distinction from Valorant. It emphasizes a different gaming experience, focusing on gunplay and tactics. This distinction is crucial for Matr1x Fire to avoid legal entanglements and carve its niche. The funding and development trajectory of Matr1x signals a potentially transformative period in mobile gaming. Hence, the industry is watching closely, anticipating the impact of Matr1x’s ambitious projects.",
    "tags": [
      "#Blockchain",
      "#Gaming NFTs",
      "#NFT market"
    ],
    "publishDate": "23/11/2023"
  },
  {
    "title": "CoinGecko has acquired Zash, a startup focused on nonfungible tokens (NFTs)",
    "absoluteURL": "https://www.todaynftnews.com/coingecko-has-acquired-zash-a-startup-focused-on-nonfungible-tokens-nfts/",
    "fullContent": "SNEAK PEEK CoinGecko acquires NFT data platform Zash to expand its data services. The integration of Zash’s NFT data into CoinGecko’s API is planned for the second quarter of 2024. CoinGecko’s users will gain direct access to on-chain NFT data, including a new NFT floor price tracker. CoinGecko, a leading cryptocurrency tracking website, recently announced the acquisition of Zash, an innovative NFT data infrastructure platform, in a strategic expansion of its data services. This move signifies CoinGecko’s continued confidence in the NFT market despite its recent downturn. CoinGecko plans to enhance its application programming interface (API) by incorporating Zash’s comprehensive NFT data by the second quarter 2024. CoinGecko’s co-founder and chief operating officer, Bobby Ong, emphasized that this integration will provide a unified crypto data experience. Users will have seamless access to fungible and nonfungible token data, enriching their insights into the crypto market. Moreover, CoinGecko users, both on web and mobile applications, will soon benefit from direct access to on-chain NFT data. This includes an NFT floor price tracker slated for release next year and the acquisition cost of Zash remains undisclosed.Zash, established in 2021, has distinguished itself with an enterprise-grade NFT indexer and API. This tool allows users to track NFT data across an impressive range of 102 marketplaces, including prominent exchanges like OpenSea. Zash’s data coverage is notably extensive, tracking secondary sales, bundled trades, and settling transactions in 12 different currencies. It also supports both ERC-721 and ERC-1155 token standards. According to Ong, Zash’s data coverage is four times more comprehensive than its competitors. Despite the NFT market’s significant decline, CoinGecko remains optimistic about its future. Ong expressed a vision where all tokenizable assets will eventually be tokenized, foreseeing continued innovation in the NFT space. This innovation is expected to extend beyond Profile Pictures (PFPs) and Game Finance (GameFi), leading to new global opportunities and use cases. CoinGecko’s proactive approach follows the 2020 acquisition of its main rival, CoinMarketCap, by Binance. The company had previously expressed openness to purchases, focusing on long-term rather than short-term prospects. As Ong stated in 2022, CoinGecko is preparing for the eventual resurgence of the market, drawing on its experience from previous crypto winters. This acquisition marks a significant step for CoinGecko’s mission to provide comprehensive and accessible crypto market data. It demonstrates the firm’s commitment to staying at the forefront of the rapidly evolving digital asset landscape.",
    "tags": [
      "#NFT market"
    ],
    "publishDate": "23/11/2023"
  },
  {
    "title": "Blur NFT Marketplace Awards $8.4M in Season 2 Airdrop",
    "absoluteURL": "https://www.todaynftnews.com/blur-nft-marketplace-awards-8-4m-in-season-2-airdrop/",
    "fullContent": "SNEAK PEEK Trader “Hanwe” earns $8.4 million from Blur NFT marketplace’s Season 2 airdrop. Hanwe’s wallet, hanwe.eth, initially received 22.85 million BLUR tokens valued at $7.3 million. The value of BLUR tokens surged, reaching $0.37 each, according to CoinGecko. Surprisingly, the Blur NFT marketplace has made headlines once again. Under the pseudonymous name Hanwe, one trader walked away with a staggering $8.4 million worth of airdropped BLUR tokens from Season 2. This windfall resulted from Hanwe’s active participation in various NFT-related activities, including bids, listings, and lending, throughout Season 2. Hanwe’s hanwe.eth wallet received a whopping 22.85 million BLUR tokens, a reward initially valued at around $7.3 million when claimed shortly after the conclusion of Blur’s Season 2. However, the token’s value has since surged, with Blur’s token price experiencing an 8% increase, reaching $0.37, according to CoinGecko. Interestingly, Hanwe used the Ethereum Name Service to assign a human-readable name to their wallet, underscoring the rising trend of personalized NFT ownership. Hanwe received the largest share of rewards for Season 2, making this trader’s journey an impressive success story within the NFT space. Blur, a marketplace gaining traction rapidly and even surpassed OpenSea in NFT trading volume, has announced its plans for Season 3. The forthcoming season is set to introduce a new Ethereum layer-2 network called Blast, backed by Paradigm, Standard Crypto, and other prominent investors. Blur’s Season 3 will be “powered” by Blast, promising an exciting future for the platform. To add to the anticipation, Blur’s community can look forward to a significant airdrop at the end of Season 3 in May 2024. Blur will allocate 50% of the season’s rewards to those who deposit BLUR tokens into the platform in a shift from previous reward structures. This change aims to encourage more participation and engagement within the Blur ecosystem. Blur’s Season 2 also saw some traders, like @ESK_NFT on Twitter, achieving remarkable results by turning a modest starting fund into substantial airdrops, exemplifying the platform’s potential for ambitious participants. I gotta hand it to @ESK_NFT — he used just 2-3 ETH to farm Season 2 and managed to turn it into an $83,100 drop. Huge W for someone who hustles like crazy. Created a Discord group sharing his secrets \u0026 tools in the process. — NFTstats.eth (@punk9059) November 21, 2023 However, not all experiences were equally positive, as evidenced by notable trader Jeffrey Huang, also known as Machi Big Brother, who expressed his disappointment with his Season 2 haul. Despite the ups and downs, Blur’s growth and innovations in the NFT space continue to captivate the crypto community, and all eyes are now on the upcoming Season 3, powered by the promising Blast network.",
    "tags": [
      "#Blur",
      "#NFT Marketplace"
    ],
    "publishDate": "22/11/2023"
  },
  {
    "title": "Nike Breaks New Ground with NFT-Embedded Sneakers",
    "absoluteURL": "https://www.todaynftnews.com/nike-breaks-new-ground-with-nft-embedded-sneakers/",
    "fullContent": "SNEAK PEEK Nike has released RTFKT Dunk Genesis sneakers, including the Dunk Ghost and VOID Editions, priced at $222 each. These sneakers feature unique detachable mods like the “Vial Clip Tongue” and “Modular Heel Shield” and come with 3D files for customization. Although no NFT purchase is required to buy these sneakers, they include an NFC chip for obtaining a digital collectible. Nike has leaped into the future of fashion by launching its latest RTFKT Dunk Genesis sneakers. What sets these kicks apart is that you don’t need to own an expensive NFT to purchase them. The democratization of digital fashion is here. Priced at a reasonable $222 each, the Nike x RTFKT Dunk Ghost Edition and Dunk VOID Edition sneakers have a futuristic edge that matches RTFKT’s previous releases and the visual vibe of its digital counterparts. They also come with unique features, including the “Vial Clip Tongue” and “Modular Heel Shield” mods that can be detached for customization. Nike even offers 3D files, allowing owners to create their mods. But here’s the kicker – while no NFT is required to buy these sneakers, they are still connected to the world of non-fungible tokens. Embedded within the sneakers is an NFC chip called the RTFKT World Merging chip, which enables owners to obtain a digital collectible if they choose to do so. It’s a seamless blend of physical and digital fashion. The VOID Edition sneakers are expected to ship by July 31, 2024, with the Ghost Edition by August 31, 2024. Nike and RTFKT gave existing NFT holders an exclusive pre-order window before opening up sales to the public. Regarding the blockchain platform for minting the associated NFT collectibles, it’s still uncertain, but RTFKT has previously used Ethereum. Nike also has its own digital kicks platform Swoosh which is an Ethereum scaling network on Polygon, adds to the intrigue of where these NFTs might land. This move isn’t Nike’s first venture into the world of NFTs earlier this year, they released RTFKT x Nike Air Force 1 sneakers that required an NFT purchase for redemption. The collaboration made waves, with NBA star LeBron James even sporting a pair during a Lakers playoff game. The drop is now live. The @RTFKT x Nike Dunk Ghost and Void editions are now available for pre-order at https://t.co/nVV3ffzdjv. Oops, you stepped into the future! pic.twitter.com/g28DMjV3wK — Nike (@Nike) November 20, 2023 It’s worth noting that RTFKT is also the brains behind the lucrative Clone X NFT profile picture (PFP) collection, which has generated a staggering $852 million in trades to date. Secondary market prices for Clone X NFTs currently start above 1.4 ETH, or approximately $2,850, showcasing the immense value of digital collectibles. This move by Nike represents a significant step in bridging the gap between the physical and digital realms of fashion, making it more accessible to everyone. The fusion of NFT technology with tangible products is an exciting development, and Nike’s latest release is a testament to their commitment to innovation in the industry.",
    "tags": [
      "#NFT market",
      "#NFT Marketplace",
      "#Nike"
    ],
    "publishDate": "21/11/2023"
  },
  {
    "title": "Gaming Retailer G2A Launches an NFT Marketplace Dedicated to Video Games",
    "absoluteURL": "https://www.todaynftnews.com/gaming-retailer-g2a-launches-an-nft-marketplace-dedicated-to-video-games/",
    "fullContent": "SNEAK PEEK G2A, a significant player in the digital gaming industry, has expanded its offerings by launching a new NFT marketplace. The company’s CEO, Bartosz Skwarczek, introduced G2A Geekverse, an online platform aimed at Web3 gaming enthusiasts. Skwarczek emphasized that contrary to popular belief, the gaming community is increasingly receptive to cryptocurrency. G2A Capital Group, a key player in the digital gaming industry, has broadened its horizon by launching a new NFT marketplace focused on Web3 games. This strategic move, announced on November 15, marks a significant expansion in G2A’s offerings, now including a curated selection of gaming NFTs alongside its traditional gaming software. Bartosz Skwarczek, CEO of G2A Capital Group, highlighted the company’s commitment to embracing the evolving landscape of blockchain gaming. He noted that gamers increasingly engage with Web3 games and NFT trading, debunking the myth that the gaming community is opposed to cryptocurrency and blockchain technology. This insight led to G2A Geekverse, an online platform dedicated to Web3 gaming enthusiasts. Here, users can access detailed information about top-tier Web3 games and trade digital assets linked to these games. At @G2A_Geekverse we believe that Web3 gaming is not just a buzzword. It represents a paradigm shift toward decentralization, digital ownership, and a new era of gaming experiences, empowering players and taking digital ownership to the next level. Evolution has begun.🚀 pic.twitter.com/R61fJ1K1EZ — G2A Geekverse 🎮 (@G2A_Geekverse) November 11, 2023 The new venture aligns with the growing acceptance of Web3 gaming in the mainstream gaming industry. Notably, the Google Play Store began supporting NFT games under specific conditions in July, allowing sales and earnings through NFTs while prohibiting gambling-related activities. This development reflects a broader trend towards integrating blockchain technologies in conventional gaming platforms. Similarly, Epic Games, a prominent game developer and publisher, has shown a keen interest in this domain. It listed ‘Gods Unchained,’ a blockchain-based trading card game, on the Epic Games Store. This game, reminiscent of well-known titles like Magic: The Gathering and Hearthstone, exemplifies the potential of NFTs in enhancing gaming experiences. Further underlining its commitment to this new era of gaming, Epic Games plans to introduce ‘Illuvium,’ another blockchain-based game, to its platform on November 28. G2A’s foray into the NFT marketplace for Web3 games is not just an expansion of its product line; it’s a strategic move acknowledging the evolving preferences of the gaming community. By offering a dedicated space for Web3 games and NFTs, G2A positions itself at the forefront of this digital transformation, catering to a new generation of gamers increasingly interested in the intersection of gaming and blockchain technologies.",
    "tags": [
      "#Gaming",
      "#NFT market",
      "#NFT Marketplace"
    ],
    "publishDate": "17/11/2023"
  },
  {
    "title": "Dairy Queen Unveils NFT-Inspired Pop-Up Store in China with Weirdo Ghost Gang Collaboration",
    "absoluteURL": "https://www.todaynftnews.com/dairy-queen-unveils-nft-inspired-pop-up-store-in-china-with-weirdo-ghost-gang-collaboration/",
    "fullContent": "SNEAK PEEK Dairy Queen’s pop-up store in Chengdu, China, represents an innovative blend of traditional retail with digital NFT art. The store, located on Chunxi Road, Chengdu, is transformed into a “ghost ski resort,” providing customers an immersive, themed physical experience. The collaboration features unique co-branded items like a winter-themed beanie and a canvas bag, merging fashion with functionality. Dairy Queen, the renowned American fast food brand, has embarked on an innovative venture by opening a pop-up store in Chengdu, China, collaborating with the nonfungible token (NFT) project, Weirdo Ghost Gang (WGG). This unique partnership marks a significant stride in blending traditional retail with the burgeoning world of digital assets. Situated on the bustling Chunxi Road in Chengdu, the heart of China’s Sichuan province, this pop-up store has transformed into a vibrant “ghost ski resort,” offering an immersive experience for visitors. The collaboration, from November 15 to December 31, intertwines the digital art of NFTs with the tangible world, allowing customers to indulge in a whimsical year-end ski party theme. Moreover, Dairy Queen has not only infused its menu with creativity but also its merchandise. The store features limited-edition co-branded items, including a stylish beanie that embodies winter’s essence and a canvas bag perfect for winter outings. These products exemplify the fusion of fashion and functionality, catering to the contemporary consumer’s lifestyle. However, the highlight of the collaboration is the “ski ghost mixing bowl,” a unique ice cream sundae designed to resemble a ski slope. This dessert blends Dairy Queen’s classic ice cream with crispy toppings enveloped in rich chocolate sauce, offering a delightful sensory experience. This initiative by Dairy Queen and WGG reflects a broader trend in the NFT space, where digital art is increasingly being leveraged as a new form of intellectual property. Brands like Bored Ape Yacht Club and Disney have also ventured into similar integrations, albeit with mixed outcomes. Furthermore, this partnership signifies a strategic move for both entities. For Dairy Queen, it represents an innovative approach to digital marketing and customer engagement. For WGG, it offers a shift from reliance on NFT sales to broader brand collaborations, a critical pivot given the recent downturn in the NFT market. In addition to Chengdu, a second Dairy Queen outlet on Huaihai Middle Road in Shanghai also participates in this collaboration, expanding the reach of this unique venture. This creative alliance between a traditional food retailer and an NFT project exemplifies the evolving landscape of marketing collaborations, blending physical and digital realms to offer enriched consumer experiences.",
    "tags": [
      "#Blockchain",
      "#NFT market",
      "#NFT Marketplace"
    ],
    "publishDate": "16/11/2023"
  },
  {
    "title": "NFTs at Heart of PSG-Blvck Paris Fashion Venture",
    "absoluteURL": "https://www.todaynftnews.com/nfts-at-heart-of-psg-blvck-paris-fashion-venture/",
    "fullContent": "SNEAK PEEK Paris Saint-Germain F.C. partners with Blvck Paris, merging soccer with avant-garde fashion and digital artistry. The collaboration features a unique digital fashion drop of NFTs, available initially on the Crypto.com marketplace. These NFTs function as digital collectibles, providing early access to physical apparel from the collection. In a striking blend of digital and physical fashion, Paris Saint-Germain F.C., a major soccer club, has partnered with avant-garde fashion brand Blvck Paris. This collaboration marks a new era in the fusion of sports, fashion, and digital artistry. The companies announced this innovative venture through a press release on Wednesday. The heart of this collaboration lies in a digital fashion drop consisting of Non-Fungible Tokens (NFTs), which are initially available on the Crypto.com marketplace. These NFTs serve as digital collectibles and grant early access to the physical apparel in the collection. This approach underscores the trend of integrating digital assets with tangible products in the fashion industry. Crypto.com offers 1,000 NFTs at $50 each, with 10% categorized as special edition NFTs. These unique tokens provide the added benefit of being redeemable for a box containing physical items from the collaboration. Minted on Cronos, a blockchain supported by Crypto.com, these NFTs represent a significant step forward in digital asset utility. The physical collection, set to release next week, includes various items embody the distinct monochrome aesthetic of Blvck Paris. Among the teased items are an all-black hoodie and soccer ball, each adorned with white text. The collection is also expected to feature a t-shirt, welcome mat, and scarf, all aligned with the same design philosophy. Moreover, Paris Saint-Germain’s foray into the crypto space is not new. The club has previously launched a crypto fan token with Socios.com and has actively distributed AI-generated posters as NFTs via Crypto.com. The club’s star player, Kylian Mbappé, also serves as a brand ambassador for Sorare, an NFT-based fantasy soccer game. This collaboration between Paris Saint-Germain and Blvck Paris is more than a fashion statement. It represents the evolving intersection of sports, digital technology, and fashion, providing fans a unique way to engage with their favorite club. The initiative highlights the potential of NFTs to transform how we view digital assets and how they can be seamlessly integrated into everyday life. ⚫ 𝐁𝐋𝐕𝐂𝐊 𝐱 𝐏𝐒𝐆 🔴🔵 is officially LIVE! https://t.co/1zo3U8ERDl pic.twitter.com/5xUoxFiezN — Blvck Paris (@BlvckParis) November 15, 2023 The Paris Saint-Germain and Blvck Paris collaboration is a testament to the innovative spirit of both entities, blending the world of soccer with cutting-edge fashion and digital technology. This initiative paves the way for new forms of fan engagement and highlights the growing relevance of NFTs in bridging the digital and physical realms.",
    "tags": [
      "#NFT market",
      "#NFT Marketplace"
    ],
    "publishDate": "16/11/2023"
  },
  {
    "title": "Disney Announces New Digital Collectibles Platform in Partnership with Dapper Labs, Featuring Star Wars and Pixar Themes",
    "absoluteURL": "https://www.todaynftnews.com/disney-announces-new-digital-collectibles-platform-in-partnership-with-dapper-labs-featuring-star-wars-and-pixar-themes/",
    "fullContent": "SNEAK PEEK Disney has partnered with Dapper Labs, known for NBA Top Shot, to create Disney Pinnacle, a platform for digital collectibles as NFTs. Unlike NBA Top Shot’s web-based platform, Disney Pinnacle is designed with a mobile-first strategy, aligning with current trends in digital experiences. The popular physical collector pins at Disney theme parks inspire the concept. Disney and Dapper Labs, known for NBA Top Shot, have announced a new venture, Disney Pinnacle. This platform brings the thrill of Disney’s iconic characters and stories into the digital realm as NFTs. Leveraging the technology behind NBA Top Shot, Disney Pinnacle will offer exclusive digital collectibles inspired by beloved Disney, Pixar, and Star Wars characters, all minted on the Flow blockchain. Disney’s physical pins, a collector’s delight at their theme parks, inspire this innovative venture. Characters like Buzz Lightyear, Woody, Disney Princesses, and Darth Vader will be the first to feature in this digital collectibles ecosystem. However, Marvel characters will not be included at the launch. Disney Pinnacle stands out for its mobile-first approach, distinct from Top Shot’s web-originated platform. This strategy aligns with the growing trend of mobile-focused digital experiences. The platform promises a balanced economy, catering to casual fans and serious collectors with its digital assets. Ridhima Kahn of Dapper Labs played a pivotal role in bridging Disney and Dapper Labs, leading to this collaboration. Dapper Labs’ expertise, showcased in the success of NBA Top Shot and the development of the Flow blockchain, positions them as a leader in the NFT and digital collectibles space. This announcement signals a rejuvenation in the NFT market, hinting at more sophisticated and user-friendly platforms in the pipeline. Disney Pinnacle is set to gradually welcome users, starting with a waitlist, ensuring a polished and tested user experience before its full-scale launch. The collaboration between Disney and Dapper Labs illustrates the evolving landscape of digital collectibles. It marks a significant step in bringing mainstream entertainment into the blockchain world, offering a new way for fans to connect with their favorite characters and stories. Disney Pinnacle is poised to become a new destination for Disney enthusiasts and NFT collectors, encapsulating Disney’s magic in a modern, digital format.",
    "tags": [
      "#Blockchain",
      "#NFT market"
    ],
    "publishDate": "15/11/2023"
  },
  {
    "title": "Designer of Imitation Mutant Monkey NFTs Admits to Orchestrating a $3 Million Fraudulent Operation",
    "absoluteURL": "https://www.todaynftnews.com/designer-of-imitation-mutant-monkey-nfts-admits-to-orchestrating-a-3-million-fraudulent-operation/",
    "fullContent": "SNEAK PEEK Aurelien Michel, a French national, has pleaded guilty to a $3 million fraud involving the sale of Mutant Ape Planet NFTs. Michel and associates deceitfully marketed these NFTs, promising rewards and benefits to investors that were never fulfilled. This fraudulent scheme left investors with considerable losses, highlighting the risks in the unregulated NFT market. In a significant development in the digital art world, Aurelien Michel, a French national, has admitted to a major fraud involving the sale of Mutant Ape Planet NFTs. This collection, a derivative of the renowned Mutant Ape Yacht Club by Yuga Labs, became the center of a $3 million fraud scheme. Michel’s guilty plea to conspiracy to commit wire fraud was entered in a New York federal court, as announced by the U.S. Attorney’s Office for the Eastern District of New York on November 14. Michel and his associates were accused of deceitfully marketing these NFTs, promising investors rewards and benefits to spur demand. However, these promises were never fulfilled. Instead, the proceeds, amounting to millions of dollars, were diverted for personal use. This act, known as a “rug pull” in cryptocurrency, left investors facing significant losses. Nonfungible Token (NFT) Developer Pleads Guilty to an International Scheme to Defraud NFT Purchasers Aurelien Michel Conspired to Steal From Purchasers of “Mutant Ape Planet” NFTs Through False Promises and Misrepresentations@HSINewYork @IRSCI_NY https://t.co/K3CzIb8dQD — US Attorney EDNY (@EDNYnews) November 14, 2023 Special agent Thomas M. Fattorusso of the IRS Criminal Investigation in New York emphasized the gravity of Michel’s actions, noting the transformation of investors’ dreams into a “nightmare of deception and losses.” The case underscores the risks inherent in the largely unregulated NFT market, where the line between innovative investment and fraudulent schemes can often blur. Michel’s arrest in January 2023 marked a turning point in the case. Following his arrest, he admitted to the community via social media that the project was indeed a rug pull, a confession that came amidst growing toxicity within the community. Upon sentencing, Michel faces up to five years in prison. Moreover, he has agreed to pay $1.4 million in restitution. This case highlights the ongoing challenges in the NFT space, where the excitement and novelty of digital assets often collide with the harsh realities of unscrupulous practices. The Mutant Ape Planet collection, once a prominent offering on the NFT platform OpenSea, showcased 6,797 NFTs minted on the Ethereum blockchain. Initially, the group enjoyed substantial sales, with over 320 Ether in volume by February 2022. However, its value had significantly declined by April of the same year. By Michel’s arrest, the average price and total sales volume had plummeted to near zero, reflecting the collapse of trust and value in the wake of the fraud. Michel’s case is a cautionary tale in the rapidly evolving world of NFTs. It highlights the need for greater oversight and consumer protection in a market that continues to captivate and confound investors and enthusiasts alike.",
    "tags": [
      "#NFT market",
      "#Yuga Labs"
    ],
    "publishDate": "15/11/2023"
  },
  {
    "title": "Wildly Successful Mad Lads NFT Collection Reaches New Peak, Backpack Engages Former FTX Attorney for Exchange Debut",
    "absoluteURL": "https://www.todaynftnews.com/wildly-successful-mad-lads-nft-collection-reaches-new-peak-backpack-engages-former-ftx-attorney-for-exchange-debut/",
    "fullContent": "SNEAK PEEK The Mad Lads NFT collection on Solana has seen a significant increase in market value, reaching a starting price of 82.37 SOL on secondary markets. Backpack, a Solana-based NFT wallet app, is launching a cryptocurrency exchange in Dubai. Trek Labs, connected to Backpack and Coral, has secured a Virtual Asset Service Provider license from Dubai’s VARA. Solana’s Mad Lads NFT collection has reached a new zenith in market value, coinciding with significant developments at Backpack, a Solana-based NFT wallet application. Backpack’s latest endeavor involves launching a cryptocurrency exchange in Dubai, a move bolstered by the appointment of former FTX general counsel Can Sun as the leader of this new venture. Backpack’s association with the soaring Mad Lads NFTs is undeniable. These digital collectibles have witnessed a remarkable price surge, starting at 82.37 SOL (approximately $4,480) on secondary marketplaces. This figure represents a substantial increase from their previous high, especially notable given Solana’s 148% rise over the past month. Can Sun’s role be pivotal in developing Trek Labs, the Dubai-based startup connected to Backpack and its creator, Coral? Having recently testified in the fraud trial against FTX co-founder Sam Bankman-Fried, Sun brings a wealth of experience and insight. This move comes after Trek Labs secured a Virtual Asset Service Provider license from Dubai’s Virtual Assets Regulatory Authority (VARA), setting the stage for a regulated exchange in the United Arab Emirates. The ripple effect of these developments extends beyond just the realms of cryptocurrency and legal expertise. Coral co-founder and CEO Armani Ferrante, a minority shareholder in Trek Labs, and Claire Zhang, Sun’s former deputy at FTX and Ferrante’s spouse, add interconnectedness between these entities. Moreover, Trek Labs has unveiled plans to sell a 10% stake in the company, seeking a valuation surpassing $100 million. This ambitious target reflects the growing confidence and potential in the digital asset space, particularly in a region as dynamic as Dubai. The recent beta signups for the Backpack exchange, initially exclusive to Mad Lads NFT holders, have further fueled interest in these digital assets. The strategic move of offering early access to NFT owners underscores the increasing integration of various facets of the digital asset ecosystem. The intertwined developments among Backpack, Trek Labs, and the Mad Lads NFT collection signify a burgeoning era in the digital asset world. The incorporation of experienced professionals and strategic business moves is setting a new course for the future of cryptocurrency exchanges and NFT marketplaces, particularly in the vibrant landscape of Dubai’s digital economy.",
    "tags": [
      "#Blockchain",
      "#FTX Exchange",
      "#NFT market"
    ],
    "publishDate": "14/11/2023"
  },
  {
    "title": "NFT Market Experiences a Resurgence as Trading Volumes and Prices Climb",
    "absoluteURL": "https://www.todaynftnews.com/nft-market-experiences-a-resurgence-as-trading-volumes-and-prices-climb/",
    "fullContent": "SNEAK PEEK The NFT landscape, which had been experiencing a decline in interest and value, shows signs of revival with a significant increase in trading volumes and prices. In October, there was a 32% increase in NFT trading volume compared to September, amounting to $405 million. The resurgence is partially attributed to the rise in cryptocurrency values, with Bitcoin and Ethereum experiencing notable increases. The NFT landscape, previously plagued by declining interest and dropping values, is witnessing a notable resurgence. Recent data reveals a significant uptick in trading volumes and prices, injecting optimism into the market. October marked a pivotal month in this revival, showcasing a 32% increase in NFT trading volume compared to September. This rise, quantified at $405 million, signals a shift in trader sentiment. Although these figures still lag behind the zenith of January 2022, which saw about $5 billion in trades, the increase is nonetheless a positive indicator. PFP Index in USD terms has truly gone parabolic, back at the levels we were at before the Azuki Elementals reveal. pic.twitter.com/FFLFt2txvb — NFTstats.eth (@punk9059) November 10, 2023 Essential NFT collections are leading this rebound. CryptoPunks, Bored Ape Yacht Club, and Azuki NFTs have seen their floor prices – the minimum price for NFTs in these collections – surge dramatically. CryptoPunks’ floor price soared by 82%, reaching approximately $125,500. Bored Ape Yacht Club and Azuki NFTs weren’t far behind, with 67% and 107% increases, respectively. This rejuvenation is not solely attributable to the rising crypto prices, though they play a role. Bitcoin and Ethereum have risen by 38% and 33% in the last month. These increases contribute to the enhanced allure of NFTs as valuable digital assets. The trading activity is also gaining momentum. Popular collections like Bored Ape and CryptoPunks have experienced substantial hikes in their trading volumes, by 140% and 1755%, respectively. This upswing is not limited to these well-known names; even lesser-known collections are seeing renewed interest. However, the scenario isn’t uniformly rosy. Some projects are still struggling to regain their former glory. For instance, DraftKings NFT trading dipped by 40%, and trading on Ethereum’s scaling network, Polygon, saw a 58% decline. Despite these variances, the overall trend points to revitalizing the NFT market. This upturn starkly contrasts the previous year and a half, where both crypto and NFT markets were in a slump. The current boost in trading volumes and prices is breathing new life into the space, drawing in long-time traders and new participants. It’s important to note that we are still some distance from the frenzied heights of the initial NFT boom. Nevertheless, the market is showing tangible signs of recovery. This resurgence is a reminder of the dynamic nature of digital assets and their potential for rapid shifts in value and interest. As the landscape evolves, it presents opportunities and challenges for traders and investors in digital assets.",
    "tags": [
      "#Blockchain",
      "#NFT market"
    ],
    "publishDate": "13/11/2023"
  },
  {
    "title": "NFTs Classified as Data and Virtual Property in China",
    "absoluteURL": "https://www.todaynftnews.com/nfts-classified-as-data-and-virtual-property-in-china/",
    "fullContent": "SNEAK PEEK China criminalizes the theft of digital collections, including NFTs. Digital collections are classified as both data and virtual property. Illegal access to computer systems is part of digital theft in China. China has recently announced a significant legal stance against the theft of digital collections, including nonfungible tokens (NFTs). According to a statement released on November 10, individuals involved in such activities will face theft charges. The Chinese government’s declaration clarifies the legal status of digital collections, categorizing them as data and virtual property, a perspective that aligns with the concept of “co-offending.” The government emphasizes that stealing a digital collection is not just a breach of ownership but also involves illegal access to computer systems. This dual violation, encompassing both property law and computer information system data protection, underlines the seriousness with which China views the theft of digital assets. This approach classifies digital collections, notably NFTs, as “network virtual property,” recognizing their intrinsic value in property law. Interestingly, NFTs, known for their unique and tamper-proof nature through blockchain technology, are highlighted in this context. Despite China’s stringent stance on crypto-related activities, this move acknowledges the growing significance of NFTs, which are increasingly seen as valuable assets due to their unique characteristics. Moreover, China’s approach to NFTs is evolving. While the country has yet to open a secondary market for digital collections, consumers can engage in transactions through trading platforms. These platforms facilitate various operations, including purchasing, collecting, transferring, and destroying digital assets, thereby granting consumers exclusive possession and control over these virtual properties. Additionally, recent developments indicate a growing interest in NFTs within China. Alibaba’s Xianyu, a peer-to-peer marketplace, recently lifted its censorship on search terms related to NFTs and digital assets. This move, reported on October 25, suggests a softening attitude towards the digital asset market. Further emphasizing this trend, China Daily, a government-owned English-language newspaper, announced plans on October 6 to create its own NFT platform. The newspaper intends to invest 2.813 million Chinese yuan (approximately $390,000) in this venture, indicating the government’s increasing engagement with digital assets.",
    "tags": [
      "#China",
      "#NFT market"
    ],
    "publishDate": "11/11/2023"
  },
  {
    "title": "Roblox CEO David Baszucki Envisions a Future of Cross-Platform NFTs",
    "absoluteURL": "https://www.todaynftnews.com/roblox-ceo-david-baszucki-envisions-a-future-of-cross-platform-nfts/",
    "fullContent": "SNEAK PEEK The CEO of Roblox envisions a future where digital collectibles and NFTs can move seamlessly across different digital platforms. The collaboration with celebrities like Elton John for creating exclusive digital items in Roblox. Despite a quarterly loss, Roblox reported a 20% year-over-year booking increase. David Baszucki, CEO of the renowned virtual universe game Roblox, recently shared his vision for the future of digital collectibles and nonfungible tokens (NFTs). In an interview with CNBC following Roblox’s Q3 2023 earnings call, Baszucki discussed how major influencers could significantly contribute to the widespread acceptance and adoption of NFTs and digital items. He emphasized the potential for these assets to move seamlessly across various digital platforms, enhancing their value and usability. Baszucki’s idea involves enabling users to transfer their digital collectibles from one platform to another. This concept could transform how digital assets are perceived and traded. He cited the example of high-profile celebrities like Elton John collaborating with Roblox to create exclusive digital items, such as capes, for charitable causes. Once sold on Roblox, these limited edition items could become NFTs and be traded on different marketplaces, thus transcending the boundaries of a single digital environment. The Roblox CEO’s remarks came when the company reported a 20% year-over-year increase in bookings, thanks to a surge in in-game spending and an expanding user base. Despite posting a loss in the third quarter, Roblox’s performance indicates a robust and growing interest in digital gaming and e-commerce. NFT volume for the past 5 weeks has been steadily increasing 📈 The bottom was the week closing 9th Oct, where NFT weekly volume was 29,704 ETH, compared to last week, week ending Nov 6th, NFT sales volume reached 68,342 ETH Slowly then suddenly…?https://t.co/SOlhKZezmO pic.twitter.com/420fiRYw9e — Nansen 🧭 (@nansen_ai) November 6, 2023 Additionally, the NFT market has been experiencing a significant uptick. Blockchain analytics firm Nansen highlighted a notable rise in NFT sales volumes in November. Specifically, the Bored Ape Yacht Club (BAYC) collection showcased the highest trading volume, amounting to 35,226 ETH, valued at $66.7 million. Concurrently, data from NFTGo revealed a 12% increase in NFT traders over the same period, signaling a growing interest in the NFT space. Baszucki’s vision aligns with these market trends, underscoring the potential for digital collectibles to become more than just assets confined to a single platform. His proposal hints at a future where digital items gain new life and value as they traverse different virtual spaces, propelled by the creativity and influence of their creators. This concept of inter-platform mobility for digital assets could redefine the dynamics of digital ownership and trading. It points towards a more interconnected and fluid digital economy, where the lines between different virtual platforms blur, allowing for a more integrated and expansive digital experience.",
    "tags": [
      "#Blockchain",
      "#Gaming NFTs",
      "#NFT market"
    ],
    "publishDate": "10/11/2023"
  },
  {
    "title": "Bored Ape NFT Holder Takes Legal Action Following ApeFest Eye Injuries",
    "absoluteURL": "https://www.todaynftnews.com/bored-ape-nft-holder-takes-legal-action-following-apefest-eye-injuries/",
    "fullContent": "SNEAK PEEK Artfi CEO Asif Kamal is initiating legal proceedings against Yuga Labs for eye injuries suffered at ApeFest Hong Kong. Several ApeFest attendees reported eye issues, allegedly due to improper lighting at the venue. Yuga Labs says they are investigating the situation and take it seriously. Speculation points to UV-C bulbs being used instead of blacklights. Art technology company Artfi’s CEO, Asif Kamal, has initiated legal proceedings against Yuga Labs, the maker of the Bored Ape Yacht Club (BAYC) NFTs, after suffering from an eye infection and facial burns during ApeFest in Hong Kong. The decision to pursue legal action comes as reports surface of several ApeFest attendees experiencing eye injuries, purportedly due to inadequate lighting at the event’s venue. Kamal expressed his concerns, stating, “I don’t want the price of Apes, the BAYC community, Yuga Labs, or anyone who has supported this Web3 ecosystem to suffer, but neglecting it is something that has offended me so much.” Yuga Labs responded by indicating that they are still investigating and taking the situation seriously. Speculation on Twitter suggests that UV-C bulbs intended for disinfection might have been used instead of blacklights during the event. As Kamal recounted his distressing visit to Hong Kong’s Queen Elizabeth Hospital, where he received treatment for his eye condition, he described sending a legal notice to Yuga Labs as the “first step toward suing them.” He spoke of feeling helpless during the ordeal and experiencing temporary blindness. Turning friends into family out here at ApeFest !! Just got @iamasifkamal to buy his first @BoredApeYC NFT with @CryptoGarga supporting! 🦧🚀#ApeFestHK #BAYC pic.twitter.com/hnTMT7N3Bb — EvanLuthra.eth (@EvanLuthra) November 4, 2023 Yuga Labs reported that less than 1% of the 2,250 ApeFest attendees exhibited symptoms related to eye issues but encouraged anyone with concerns to seek medical attention as a precaution. In an interview from Dubai, Kamal, now wearing sunglasses, revealed his ongoing vision troubles and discomfort in one eye. Before the incident, he owned a Mutant Ape NFT and purchased a $60,000 Bored Ape to support the BAYC community in front of co-founder Greg “Garga” Solano. Kamal shared that two other attendees he knows are facing similar symptoms, and he hopes Yuga Labs will prioritize safety measures for future events. He emphasized the importance of safeguarding the community’s well-being, contributing to Yuga Labs’ success. In this unfolding situation, legal action may shed light on the responsibilities of event organizers and creators in ensuring attendee safety at NFT gatherings like ApeFest.",
    "tags": [
      "#Bored Ape NFT",
      "#NFT market"
    ],
    "publishDate": "09/11/2023"
  },
  {
    "title": "Investor Report: Significant 90% Downward Adjustment in Stake for OpenSea Platform",
    "absoluteURL": "https://www.todaynftnews.com/investor-report-significant-90-downward-adjustment-in-stake-for-opensea-platform/",
    "fullContent": "SNEAK PEEK Coatue Management has significantly reduced the valuation of its investment in OpenSea by 90%, from $120 million to $13 million. The markdown of OpenSea reflects a broader trend of declining valuations in the NFT and Web3 sectors. OpenSea has faced challenges due to the bear market and decreased NFT trading, leading to a substantial workforce reduction of 50%. Coatue Management, a prominent tech investment firm based in the United States, has made a significant move by marking down its investment in the nonfungible token (NFT) platform OpenSea. The company has reduced its initial investment of $120 million to a mere $13 million, reflecting a staggering 90% decrease in the value of its stake. This substantial markdown indicates that OpenSea’s on-paper valuation has plummeted to approximately $1.4 billion. This development comes on the heels of Coatue Management’s decision to also mark down its investment in MoonPay, a Web3 payment provider, by a similarly substantial 90%. These markdowns signal a shifting landscape within the NFT and Web3 sectors. In January 2022, OpenSea raised an impressive $300 million in a Series C funding round led by crypto venture capital firm Paradigm and Coatue Management. At that time, the NFT platform was riding high, with a valuation of $13.3 billion. However, the recent bear market and a prolonged decline in NFT trading activity have forced OpenSea to take drastic measures. On November 3, OpenSea announced a workforce reduction of 50% as part of its strategy to relaunch as “OpenSea 2.0.” CEO Devin Fizner stated that this streamlined team would make the platform more agile and responsive. OpenSea’s new version will focus on enhancing its technology, speed, and overall quality. 1/9 OpenSea is making some big changes today to focus on the next version of our product. — Devin Finzer (dfinzer.eth) (@dfinzer) November 3, 2023 It’s worth noting that OpenSea faced criticism earlier in the year when it retired its operator filter, a feature that allowed creators to blocklist non-royalty-enforcing marketplaces, sparking controversy within the NFT community. Coatue Management’s decision to mark its investment coincides with a broader slump in NFT trading volumes. After reaching its peak in 2021 with over $14 billion in sales, the NFT market has experienced an 80% drop in trading volumes since March 2022. However, a recent report from crypto data firm DappRadar suggests a glimmer of hope, with the NFT market recording its first month of gains in over a year, posting a $99 million increase month-over-month in October. Coatue Management’s substantial markdown of its investment in OpenSea highlights the challenges and adjustments faced by the NFT sector in a changing market landscape. As OpenSea strives to adapt and revamp its platform, the broader NFT industry continues to navigate the complexities of evolving trends and investor sentiment.",
    "tags": [
      "#NFT market",
      "#OpenSea"
    ],
    "publishDate": "08/11/2023"
  },
  {
    "title": "NFT Sales Surge to a Quarter-Year Peak, Bolstered by a Significant CryptoPunks Transaction",
    "absoluteURL": "https://www.todaynftnews.com/nft-sales-surge-to-a-quarter-year-peak-bolstered-by-a-significant-cryptopunks-transaction/",
    "fullContent": "SNEAK PEEK NFT trading volume experienced a significant surge with a single-day high of $19.1 million. CryptoPunk sales contributed $3.6 million to the daily volume, with the transaction by Aronow being the most notable. A satirical “The Simpsons” segment on NFTs coincided with the market upswing and inspired related knockoff collections and sales. NFT trading surged to a notable high on Monday, marking a significant rebound with a daily volume of $19.1 million. This resurgence is partly credited to a hefty transaction involving a CryptoPunks NFT by Wylie “Gordon Goner” Aronow, Bored Ape Yacht Club co-founder. Aronow acquired CryptoPunk #7458 for a staggering 600 ETH, equivalent to $1.1 million. CryptoPunks sales alone brought in $3.6 million, with this seven-figure deal leading the charge. Moreover, the market witnessed this upswing alongside a ripple effect from a satirical segment on NFTs by “The Simpsons.” This episode, while poking fun at the NFT craze, seems to have indirectly spurred the creation and sale of related knockoff collections. Additionally, October had already set a positive precedent with a 32% rise in sales from the previous month. The current peak in trading volume surpasses any single day’s activity of that month, suggesting a sustained interest in the digital collectibles market. However, despite the recent spike, the market is yet to match the frenzied heights of April 2022, when weekly volumes hit $1.4 billion. Last week’s figures stood at just $98 million, highlighting the fluctuating nature of the NFT space. actually had the most wallets of any day since June. pic.twitter.com/91nLVyOoaG — NFTstats.eth (@punk9059) November 7, 2023 The trading landscape has also shifted, with Blur overtaking OpenSea as the dominant marketplace, capturing 73% of the total NFT trading volume by October’s end. This shift may stem from Blur’s strategy of incentivizing traders with the prospect of BLUR token airdrops, which has attracted controversy and increased platform activity. Hence, while “The Simpsons” might have brought NFTs to a broader audience, the core trading community appears consistent, with few new entrants to the space. This aligns with Punk9059’s observations on the number of unique wallets involved in Ethereum-based NFT purchases, which only saw a significant increase after the show aired. While the NFT market has experienced a notable spike in trading volume, the long-term sustainability of this trend remains to be seen, with market dynamics constantly in flux.",
    "tags": [
      "#CryptoPunks",
      "#NFT market",
      "#NFT Marketplace"
    ],
    "publishDate": "08/11/2023"
  },
  {
    "title": "Springfield Punks NFTs Hit $2.5M in First-Day Sales",
    "absoluteURL": "https://www.todaynftnews.com/springfield-punks-nfts-hit-2-5m-in-first-day-sales/",
    "fullContent": "SNEAK PEEK Springfield Punks NFT collection merges “The Simpsons” with CryptoPunks, garnering $2.5 million in sales in 24 hours. Rino Russo’s creation tops OpenSea trends, with all NFTs quickly sold out upon launch. Springfield Punks ranks just below Bored Ape Yacht Club and CryptoPunks in daily volume on OpenSea. The NFT world has witnessed the rise of a new player, Springfield Punks. This collection, a fusion of “The Simpsons” motif with the distinctive look of CryptoPunks, achieved a staggering $2.5 million in sales within the first 24 hours of its launch, becoming a trending phenomenon on OpenSea. The brainchild of parody artist Rino Russo, Springfield Punks captured the attention of enthusiasts quickly, with all 3,405 Ethereum NFTs being claimed promptly after release. 🎃🎃🎃 Bart’s an NFT in Treehouse of Horror XXXIV 👻👻👻 Celebrate with free Springfield Punks mint live now!! 🧟‍♂️🧟‍♂️🧟‍♂️ Mint Site: https://t.co/E8DD0JhAY6 Contract: https://t.co/o5J43ndaKb #Simpsons #NFTs #Halloween #FreeMint pic.twitter.com/v1D9ccSj4X — Rino Russo (@RinaldoRu) November 6, 2023 Moreover, the Springfield Punks collection now commands a notable spot on the leaderboard for daily volume, trailing just behind industry titans Bored Ape Yacht Club and CryptoPunks. This surge in activity underscores the collection’s swift ascension to prominence, a feat that aligns with the buoyant and often unpredictable nature of the NFT marketplace. Additionally, this upswing in interest aligns with a recent “The Simpsons” episode that poked fun at the NFT craze, offering an inadvertent nod to various existing NFT collections, including notable mentions of Beeple’s Everyday and the Bored Ape Yacht Club. The animated series’ take on digital collectibles has only fueled the fire for NFT aficionados and collectors. Other collections drawing from the same well of inspiration, such as “SimpsPunks,” have vied for attention on OpenSea, further validating the immense draw of “The Simpsons” influence. “The Chimpsons Official” collection, although not new, having been established last September, also enjoyed a spike in visibility following the episode, with its floor price experiencing a significant overnight hike. The appeal of Springfield Punks is evident in the trading volume, with a reported 1,311 ETH worth of transactions, highlighting the market’s appetite for themed digital assets. As the collection finds its place in the market, the floor price reflects a healthy interest, with the lowest-priced NFTs commanding just under 0.11 ETH. Despite the unofficial status of Springfield Punks and the absence of an official “The Simpsons” NFT release to coincide with the show’s latest “Treehouse of Horror” installment, Disney has previously dabbled in the arena. In 2021, Disney released “The Simpsons” NFTs on the VeVe marketplace to mark the launch of Disney. The rapid rise of Springfield Punks offers a clear signal of the ongoing enthusiasm for NFTs that combine recognizable pop culture elements with the digital art form. As the collection continues to trade actively, it reflects the dynamic and ever-shifting landscape of digital collectibles. This event also showcases the powerful influence of mainstream media on the burgeoning NFT market, with “The Simpsons” catalyzing the latest trend. While the future of Springfield Punks in the volatile NFT market remains to be seen, its explosive entrance serves as a testament to the genre’s capacity for swift ascents to fame and fortune. With a community eagerly watching, Springfield Punks has etched its place in the digital realm, awaiting its next move in a space that thrives on innovation and nostalgia alike.",
    "tags": [
      "#CryptoPunks",
      "#NFT market"
    ],
    "publishDate": "07/11/2023"
  },
  {
    "title": "Social Media Manager at Yuga Labs Steps Down Following Emergence of Offensive Historical Tweets",
    "absoluteURL": "https://www.todaynftnews.com/social-media-manager-at-yuga-labs-steps-down-following-emergence-of-offensive-historical-tweets/",
    "fullContent": "SNEAK PEEK Shpend Salihu resigns from Yuga Labs after his historical racist and antisemitic tweets resurface and cause public outrage. Yuga Labs, creators of Bored Ape Yacht Club, maintain silence post-resignation, with no further comment on the incident. Salihu’s controversial tweets disrupt Yuga Labs’ significant period of growth, including ApeFest and a new Ethereum NFT marketplace launch. Amidst a storm of social media controversy, Yuga Labs has confirmed the resignation of Shpend Salihu, their former Social Lead, after his past tweets of a racist and antisemitic nature resurfaced and sparked public outcry. Salihu, known by his handle NGBxShpend, was scrutinized as the objectionable content of his personal Twitter account went viral, leading to his departure from the company known for spearheading the Bored Ape Yacht Club (BAYC). Salihu expressed regret over the situation via a tweet on Sunday, acknowledging that his previous statements had become a source of distraction and conflict. He asserted that his past tweets do not represent his beliefs or values. While confirming Salihu’s resignation, Yuga Labs opted not to comment further on the events. Attempts to reach Salihu for a statement have so far been unsuccessful. Hey everyone, tough day today. I am stepping down from my position at Yuga Labs. Some tweets have resurfaced from my past and it’s become a distraction from the Club and what we’re all about. These tweets do not reflect who I am or what I believe in. It has been an amazing… — ngbshpend.eth (@NGBxShpend) November 5, 2023 The ripple effects of this incident coincided with ApeFest, an annual event celebrating BAYC members, which unfolded in Hong Kong this year. Yuga Labs also announced its collaboration with Magic Eden on a new Ethereum NFT marketplace. Additionally, some attendees felt discomfort, potentially attributed to UV light overexposure at the venue. This upheaval comes at a critical juncture for Yuga Labs, a company that, since its inception in early 2021, has seen its projects like the Mutant Ape Yacht Club and Otherside contribute significantly to its trading volume, elevating the firm’s stature in the NFT space. Moreover, the company’s previous acquisition of intellectual property from CryptoPunks and Meebits has solidified its market position. The departure of Salihu has incited reactions from the NFT community, with collectors and owners raising concerns about the vetting process for company representatives. The issue casts a new light on the importance of thorough background checks, especially in roles linked directly to public engagement and brand image. Furthermore, this isn’t the first time Yuga Labs has faced accusations related to insensitive imagery. They have consistently refuted such allegations, focusing on the diverse backgrounds of their co-founders and addressing the claims with legal action when necessary, as evidenced by their lawsuit against Ryder Ripps and Jeremy Cahen. Yuga Labs has navigated through this storm with a quick response, ensuring the focus remains on their creative endeavors and community engagement. Salihu’s exit is a stark reminder of the impact of social media history on professional trajectories and corporate reputations in the digital age.",
    "tags": [
      "#NFT market",
      "#Yuga Labs"
    ],
    "publishDate": "07/11/2023"
  },
  {
    "title": "Yuga Labs Teams Up with Magic Eden to Debut a Royalty-Enforcing Ethereum NFT Bazaar",
    "absoluteURL": "https://www.todaynftnews.com/yuga-labs-teams-up-with-magic-eden-to-debut-a-royalty-enforcing-ethereum-nft-bazaar/",
    "fullContent": "SNEAK PEEK Magic Eden and Yuga Labs have collaborated to create a new Ethereum NFT marketplace focused on enforcing creator royalties. The marketplace aims to make royalties a standard practice in the NFT industry to support artists and creators. Magic Eden’s CEO, Jack Lu, is committed to this cause and wants the platform to be on the right side of history. In a significant collaboration, Magic Eden and Yuga Labs have joined forces to establish a new Ethereum NFT marketplace, which is set to uphold the principle of enforcing creator royalties. Magic Eden, initially a Solana-based marketplace, will utilize new smart contracts to ensure that Yuga Labs and other creators receive their fair share from secondary sales. The marketplace aims to support artists and creators, promising a future where royalties are not optional but a standard practice. This move comes when the NFT industry is witnessing a pivot in how marketplaces address creator earnings, with some platforms choosing to bypass or minimize royalty payments. Magic Eden’s CEO, Jack Lu, has expressed the platform’s commitment to this cause, stating they want to be on the right side of history. The marketplace will not alter the trading experience for users, maintaining ease of use without the requirement for additional verification processes like KYC checks. Landed in HK, pumped for Day 1 of #ApeFestHK \u0026 to support @yugalabs on this Had to pick out this this clean boy with Magic Eden colors to celebrate. We’ve been non stop cooking at @MagicEden across all ecosystems lately – Rare Sats \u0026 BTC Amsterdam, Tokenized Pokemon Cards \u0026… https://t.co/sPXt17U83a pic.twitter.com/wMmLRlunub — Jack Lu (@0xLeoInRio) November 3, 2023 The shift in Magic Eden’s policy is a response to the more significant market trend where established players like OpenSea have retreated from enforcing royalties, sparking controversy among creators who rely on these fees for continued revenue. Moreover, the marketplace’s decision is not just about immediate benefits but also sets a precedent for the future treatment of creators. Other NFT platforms are invited to adopt the new contract standards, which could pave the way for industry-wide adoption. Yuga Labs, known for the popular Bored Ape Yacht Club NFTs, has been vocal in its criticism of platforms that neglect creator royalties. With this new venture, Yuga Labs emphasizes protecting creators’ rights. Daniel Alegre, Yuga Labs CEO, highlighted the importance of standing up for content creators in the ever-shifting digital landscape. The partnership between Yuga Labs and Magic Eden is a beacon for creators seeking respect and acknowledgment in the NFT marketplace. It demonstrates a clear path forward for implementing a fair and sustainable model for creator compensation in the digital realm.",
    "tags": [
      "#Ethereum",
      "#NFT Marketplace",
      "#Yuga Labs"
    ],
    "publishDate": "06/11/2023"
  },
  {
    "title": "OpenSea Trims Workforce Amid Market Cool-Down",
    "absoluteURL": "https://www.todaynftnews.com/opensea-trims-workforce-amid-market-cool-down/",
    "fullContent": "SNEAK PEEK OpenSea has announced a 50% reduction in staff to increase its operational agility in the NFT marketplace. The layoffs are part of a strategic move towards creating “OpenSea 2.0,” which aims to improve technology, reliability, and the user experience. CEO Devin Finzer is focused on regaining OpenSea’s status as an innovator in the NFT space with plans for accelerated development. In a strategic shift towards agility, OpenSea has confirmed substantial staff reductions, cutting its workforce by 50%. This decisive action, revealed on Friday, marks a significant restructuring for the NFT marketplace, which previously enjoyed a leading position during the industry’s peak trading periods. OpenSea has taken this step to streamline operations, ensuring the platform can evolve at the pace demanded by the current NFT space. “Today, we are making significant organizational and operating changes as we focus on building a more nimble—and ultimately better—version of OpenSea,” a spokesperson shared. This move is seen as a preparation for “OpenSea 2.0,” a comprehensive upgrade touted to enhance the platform’s technology, reliability, and user experience. CEO Devin Finzer expressed that the marketplace aims to reclaim its position as an innovator rather than a follower. OpenSea’s future plans involve accelerating development to make more impactful decisions that resonate with the community. 5/9 So we took a step back and reimagined our operating culture, product, and tech from the ground up. And today, we’re re-orienting the team around “OpenSea 2.0,” a big upgrade to our product – including the underlying technology, reliability, speed, quality, \u0026 experience. — Devin Finzer (dfinzer.eth) (@dfinzer) November 3, 2023 Affected employees are receiving a support package that includes four months of severance, continued health benefits for six months, and an expedited schedule for equity vesting. OpenSea’s approach to the layoffs reflects an understanding of the current challenging climate, offering a buffer for those impacted. The NFT market, once buoyant, has felt the pinch of the broader cryptocurrency market downturn. OpenSea faced competitive pressures, especially from Blur, which recently took the lead in trading volume, although OpenSea still maintains a larger trader base. These developments follow a previous reduction in July 2022, when the company addressed economic uncertainties by downsizing by 20%. Despite the cutbacks, OpenSea had sustained a robust trading activity with over 32,000 unique wallets engaging on its platforms over the past week, even as it adjusts its course in response to market shifts. OpenSea’s commitment to maintaining its royalty policy amidst industry-wide changes has been a balancing act, reflecting its dedication to creators’ interests. The company continues to navigate the complexities of the evolving NFT ecosystem, aligning its structure and strategy to serve its community effectively. The marketplace’s recalibration comes as a pragmatic response to the changing dynamics of the digital assets sphere. With a flatter organization and a concentrated vision, OpenSea is charting a course for resilience and adaptability in an unpredictable sector.",
    "tags": [
      "#NFT market",
      "#NFT Marketplace",
      "#OpenSea"
    ],
    "publishDate": "04/11/2023"
  },
  {
    "title": "Victor Wembanyama’s Digital Collectible Outperforms His Physical Trading Card",
    "absoluteURL": "https://www.todaynftnews.com/victor-wembanyamas-digital-collectible-outperforms-his-physical-trading-card/",
    "fullContent": "SNEAK PEEK Victor Wembanyama’s NFT sold for 61.182 ETH, approximately $110,120, surpassing the value of his physical trading card, which sold for $67,333. The sale demonstrates the increasing market value and collector interest in digital collectibles, particularly NFTs associated with popular sports figures. The platform’s growth is evident, with $713 million in NFT sales and a substantial valuation increase following a $680 million Series B funding round in 2021. In a striking display of the digital collectibles market’s vitality, an NFT of NBA rookie sensation Victor Wembanyama eclipsed the sale figures for his physical trading cards. The digital asset, crafted by Sorare NBA and tied to the San Antonio Spurs’ number one draft pick, changed hands for a formidable 61.182 ETH, translating to approximately $110,120. This transaction outpaced the previous record for a Wembanyama trading card by a significant margin, with the physical version selling for $67,333 earlier in August. Sorare NBA’s unique offering merges the realm of sports fandom with the burgeoning technology of NFTs, allowing enthusiasts to possess and utilize these digital assets within their fantasy sports engagements. The purchase underscores Wembanyama’s rapidly growing stature within the basketball community and accentuates the shifting paradigms of collectibility in the digital age. Moreover, selling Wembanyama’s NFT relieves Sorare’s platform’s escalating trajectory. Since its inception in 2019, Sorare has introduced an innovative fantasy soccer game and expanded its purview to include partnerships with the NBA and Major League Baseball. Such alliances have borne fruit, with Sorare’s ventures yielding over $713 million in NFT sales. The platform’s valuation soared following a $680 million Series B funding round in 2021, cementing its position in the digital collectibles arena. 🚀🏀 History Made: Victor Wembanyama’s Unique @Sorare NBA card just sold for a record-breaking $110K! Digital leapfrogs physical as the most valuable Wembanyama collectible to date. Ownership, fantasy play, and AR tech – the future of sports memorabilia is here. 🌟 pic.twitter.com/tAMWhRKwoJ — Nicolas Julia (@ni2las) November 2, 2023 Additionally, the record-breaking sale of the Wembanyama NFT comes on the heels of another notable transaction within Sorare NBA. A digital token of Giannis Antetokounmpo, the Milwaukee Bucks’ marquee player, fetched a handsome 113.9 ETH, or about $187,000 at the time, setting a precedent in February. The burgeoning interest in NFTs, particularly those merging real-world talents with digital ownership, highlights a nuanced shift in collectible culture. These assets promise more than mere possession; they offer utility in virtual games, rewards, and an immutable record of ownership. Sorare’s strategic maneuvers within this niche appear increasingly astute, with the digital sports collectible market gaining momentum. Concluding the discourse on this digital sports memorabilia milestone, the Wembanyama NFT’s notable auction results cement the convergence of sports, technology, and investment, marking another chapter in the evolution of sports fandom and digital collectibles.",
    "tags": [
      "#Blockchain",
      "#NFT market"
    ],
    "publishDate": "03/11/2023"
  },
  {
    "title": "Elon Musk Points Out NFT Weakness, Bitcoin Backers Rejoice",
    "absoluteURL": "https://www.todaynftnews.com/elon-musk-points-out-nft-weakness-bitcoin-backers-rejoice/",
    "fullContent": "SNEAK PEEK Elon Musk raised concerns on the “Joe Rogan Experience” podcast about the potential loss of NFT-linked artwork. Some Ethereum-based platforms, like Art Blocks, store artwork directly on the blockchain, which can be recreated anytime. Bitcoin’s Ordinals protocol ensures the complete on-chain storage of assets, permanently linking them to the blockchain via a single satoshi. Elon Musk, CEO of Tesla, SpaceX, and owner of Twitter, recently commented on the potential vulnerabilities surrounding non-fungible tokens (NFTs) during his appearance on the “Joe Rogan Experience” podcast. Musk highlighted the issue and stated that many NFTs link to artwork on external servers. Consequently, he suggested that owners might lose their related artwork if such hosting companies go out of business. Podcast with the great and powerful @elonmusk #ad Full episode is 2 hours and 41 minutes, first 2 hours is available here on https://t.co/AIkGSaxVMA pic.twitter.com/DQh0GGNyaO — Joe Rogan (@joerogan) October 31, 2023 However, not all NFTs face this issue. Projects on Ethereum, the leading blockchain network for NFTs, sometimes store their artwork directly on-chain. Notably, platforms like Art Blocks ensure their artists’ algorithms are on-chain. Hence, the art produced can be recreated from the output. Additionally, NFTs don’t always represent digital art. They can act as proof of ownership for items ranging from digital creations to tangible objects, like wristwatches. Significantly, there’s one NFT-style ecosystem that guarantees whole on-chain artwork storage: Bitcoin’s Ordinals protocol. Through this, users can inscribe media or artwork directly onto the blockchain, linking it to a single satoshi, the smallest Bitcoin unit. This ensures the permanent recording of assets on the blockchain. As long as the Bitcoin network remains active, these assets endure. Bitcoin enthusiasts and supporters of the Ordinals swiftly reacted to Musk’s comments. Will Clemente, co-founder of Reflexivity Research, pointed out that around 38 million inscriptions are currently on the Bitcoin blockchain. Rohun “Frank” Vora, a prominent figure in the NFT space, emphasized how the Ordinals model addresses NFT criticisms. Moreover, Dogecoin co-creator Billy Markus supported Musk’s stance, highlighting his preference for Ordinals over conventional NFTs. In a move that captured the essence of Musk’s message, Leonidas, a prominent supporter of Ordinals, has inscribed the Musk video segment onto Bitcoin. His action emphasized the capability and resilience of the fully on-chain Ordinals, further endorsing its merits. While Musk’s comments have sparked debate, they’ve also brought attention to the continuous innovations in blockchain and NFTs. Bitcoin’s Ordinals protocol is a potential solution to some concerns raised about off-chain storage of NFT-linked media.",
    "tags": [
      "#Bitcoin",
      "#Elon Musk",
      "#NFT market"
    ],
    "publishDate": "02/11/2023"
  },
  {
    "title": "Phantom Introduces Mobile-based NFT Creation with Camera Mint",
    "absoluteURL": "https://www.todaynftnews.com/phantom-introduces-mobile-based-nft-creation-with-camera-mint/",
    "fullContent": "SNEAK PEEK Phantom introduces Camera Mint, enabling easy NFT creation from mobile devices. The feature aims to make NFTs more user-friendly, lessening the need for deep blockchain knowledge. Concerns arise about Solana blockchain expansion due to potential NFT influx. Phantom has rolled out its Camera Mint feature, simplifying NFT creation directly from mobile devices. This innovative feature emphasizes user-friendly attributes, aiming to bring more individuals into NFTs. Now, transforming cherished personal experiences into digital assets is a swift process, bypassing the once-necessary intricate grasp of blockchain technology. Moreover, this innovation has its challenges. The ease of minting might lead to an influx of NFTs on the Solana (SOL) blockchain, leading to potential concerns about blockchain expansion. Sustainability, especially from an environmental standpoint, is now under the spotlight. The sentimental attachment to these new NFTs also introduces a novel dimension to their value. As personal experiences become tradable commodities, the distinction between emotional and market value might become hazier. This nuance could lead to some misconceptions about the actual worth of such assets. Don’t just collect NFTs… CREATE them. With Camera Mint on Phantom mobile, instantly turn photos and videos into @solana NFTs you can save forever. pic.twitter.com/4Ei0LpdKUI — Phantom (@phantom) October 30, 2023 Significantly, the erratic tendencies of the NFT market can lead to rapid value shifts. Such fluctuations might surprise those new to this realm, especially if they need to be privy to the market dynamics. However, Phantom has yet to focus on minting merely. Their platform’s reward system is structured to boost user interactions with Camera Mint. While such a tactic might increase user engagement, a potential pitfall is the inadvertent promotion of quantity over quality. Hence, Phantom is on the clock to ensure its platform remains a hub for content of unerring quality. Furthermore, the user experience is enriched with features like an integrated display for minted NFTs under the ‘collectibles’ tab. But there’s room for improvement. Offering in-depth information about NFTs, blockchain intricacies, and potential digital asset risks can pave the way for a well-informed user community. Phantom’s Camera Mint feature is a noteworthy addition to the NFT space, making the creation process more accessible. However, with opportunities come challenges that the company must address to ensure long-term success and user satisfaction. Only time will reveal the real impact of this feature in the rapidly advancing digital collectible landscape.",
    "tags": [
      "#Blockchain",
      "#NFT market"
    ],
    "publishDate": "31/10/2023"
  },
  {
    "title": "Revolutionary Collaboration: SAND Token and hi Debit Card Join Forces for Seamless Transactions",
    "absoluteURL": "https://www.todaynftnews.com/revolutionary-collaboration-sand-token-and-hi-debit-card-join-forces-for-seamless-transactions/",
    "fullContent": "SNEAK PEEK Web 3 Neo-Banking App, hi, has partnered with The Sandbox to enhance the usability of The Sandbox’s native token, SAND. Users can now spend SAND tokens both in-store and online using the hi Debit Card. Sebastien Borget, the COO of The Sandbox, expressed excitement about enabling the SAND token community to explore its utility further. Web 3 Neo-Banking App has just unveiled an exciting partnership set to change how users interact with The Sandbox’s native token, SAND. This collaboration allows SAND enthusiasts to seamlessly spend their tokens in-store and online using the hi Debit Card, marking a significant step in cryptocurrency adoption. What sets this partnership apart is the introduction of the first-of-its-kind NFT Customizable Card, brought to you by Hi and Mastercard. This innovative card empowers SAND holders to transact with their tokens at various merchants, bridging the gap between the digital and physical worlds. Sebastien Borget, Co-Founder and COO of The Sandbox expressed his enthusiasm for this collaboration, stating, “We’re thrilled to collaborate with Hi to enable our existing community of Creators to explore the utility of SAND tokens further while also attracting Hi customers to the creative possibilities of the open metaverse.” To celebrate this groundbreaking collaboration, The Sandbox and hi are extending a warm invitation to all members of The Sandbox community in eligible markets within the EEA to apply for the hi Debit Card. And, as a bonus, the first 100 cardholders who spend the equivalent of EUR 1,000 in SAND using the hi Debit Card will receive a unique reward—a coveted The Sandbox Avatar NFT. In addition to these exciting developments, European SAND holders can earn impressive Spend Rewards of up to 5% with every SAND transaction. They will also have access to up to 8 digital subscriptions and travel benefits, making the hi Debit Card an enriching experience. Sean Rach, Co-Founder of Hi, commented, “The team at The Sandbox are true innovators, and we are delighted to be partnering with them. Enabling spending with SAND gives our users even more utility, and we can’t wait to welcome SAND holders to the hi community.” The hi Crypto \u0026 Fiat Debit Mastercard is redefining the cryptocurrency and fiat asset management landscape. Its unique features, including NFT avatar customization, Buy-Now-Convert-Later technology, and convenient currency top-ups, set the standard for modern digital banking.",
    "tags": [
      "#NFT market",
      "#The Sandbox",
      "#Web3"
    ],
    "publishDate": "30/10/2023"
  },
  {
    "title": "Avante Art and Yuga Labs Collaborate on Physical CryptoPunk Prints",
    "absoluteURL": "https://www.todaynftnews.com/avante-art-and-yuga-labs-collaborate-on-physical-cryptopunk-prints/",
    "fullContent": "SNEAK PEEK Avante Art has partnered with Yuga Labs to offer tangible prints of CryptoPunk NFTs for a limited 48-hour window. The “Punk-On-Chain” version requires CryptoPunk NFT owners to prove ownership before commissioning a physical print. Both print editions include a Yuga Labs holographic sticker as a mark of authenticity. Avante Art has teamed up with Yuga Labs, the owner of the CryptoPunks brand, to offer a limited-time opportunity for CryptoPunk NFT holders. Beginning October 26 at 3:00 p.m. UTC and running for a mere 48 hours, the online art store allows enthusiasts to obtain tangible prints of their digital art. Hence, two distinctive versions of these iconic pieces are on the menu at Avante Art. The first, named “Punk-On-Chain,” allows each CryptoPunk NFT owner to commission a physical print. However, proving ownership is essential before one can request a print. This strategic move ensures exclusivity, as those without the on-chain version can’t acquire its physical counterpart. Our print collaboration with @avant_arte is officially live – for 48 hours only. Punk On-Chain is available exclusively to CryptoPunk holders at https://t.co/skT1FKTJgB pic.twitter.com/X657IqdgUT — CryptoPunks (@cryptopunksnfts) October 26, 2023 Additionally, Avante Art is presenting the “10,000 On-Chain” collection. This set comprises prints of all 10,000 CryptoPunks and is available to all, regardless of ownership status. It’s worth noting the tangible differences between these collections. The 10,000 On-Chain artworks are crafted as Archival pigment prints with a silkscreen varnish seal. Conversely, the Punks-On-Chain prints utilize UV pigment techniques with white underpins. Both editions, however, come adorned with a Yuga Labs holographic sticker, affirming their authenticity. Moreover, the Punks-On-Chain prints have a unique feature: a QR code on the back. This code is a gateway to a digital Certificate of Authenticity (CoA) on the blockchain. The 10,000 On-Chain pieces, on the other hand, include a physical CoA. This document houses a QR code, which, unlike the former, is not on the print but leads to the digital certificate. Significantly, the genesis of CryptoPunks can be traced back to June 2017, courtesy of Larva Labs. These algorithmically generated art pieces, initially free for Ethereum network users to mint, have seen exponential appreciation. Currently, the starting price for a single CryptoPunk is around $78,000. The entire collection’s market cap stands impressively over $782 million, as per Coingecko data. It’s also noteworthy that Yuga Labs acquired CryptoPunks copyrights from Larva Labs in March 2022. Avante Art’s collaboration with Yuga Labs bridges the digital and physical realms, offering a fresh perspective on the rapidly evolving NFT market. This limited-time event celebrates the nostalgic beginnings of CryptoPunks and their undeniable present-day value.",
    "tags": [
      "#CryptoPunks",
      "#NFT market",
      "#Yuga Labs"
    ],
    "publishDate": "27/10/2023"
  },
  {
    "title": "Yuga Labs Triumphs in $1.5 Million Bored Ape Trademark Battle",
    "absoluteURL": "https://www.todaynftnews.com/yuga-labs-triumphs-in-1-5-million-bored-ape-trademark-battle/",
    "fullContent": "SNEAK PEEK California’s U.S. District Judge ruled favor of Yuga Labs, ordering Ryder Ripps and Jeremy Cahen to pay $1.5 million for trademark infringement. The judge imposed penalties beyond monetary damages, requiring Ripps and Cahen to stop all NFT sales and hand over their online blockchain assets. The court rejected the defendants’ counterclaim, affirming Yuga Labs’ rights to the Bored Ape Yacht Club marks. In a significant turn, California’s U.S. District Judge ruled in favour of Yuga Labs, the mastermind behind the well-known Bored Ape Yacht Club. The judge ordered Ryder Ripps and Jeremy Cahen to pay $1.5 million for infringing on Yuga Labs’ trademark rights. The profits Ripps and Cahen made from their counterfeit “Ryder Ripps Bored Ape Yacht Club” led to this judgment. Besides the monetary damages, the judge imposed an additional penalty. The duo must stop all NFT sales and hand over their online blockchain assets. The court’s decision also emphasized the illegitimacy of Ripps and Cahen’s argument. They previously claimed their version was merely “satire” and “parody” of the original Bored Ape Yacht Club rather than a direct infringement. Moreover, the judge has granted Yuga Labs $200,000 in damages concerning cybersquatting violations. Cybersquatting involves registering a renowned brand or company’s domain name to sell it later for a profit. In this case, the domains rrbayc.com and apemarket.com were the culprits. The court observed, “Defendants only had an interest in the domain name to divert potential customers of Yuga Labs to their commercial website.” However, the court didn’t stop there; they rejected the defendants’ counterclaim, which accused Yuga Labs of using offensive imagery in their Bored Ape Yacht Club NFTs. The court highlighted that Yuga Labs, despite having unregistered BAYC Marks, still possessed the rights to those marks. Consequently, these marks are valid and protectable. The timing of domain registrations by Ripps and Cahen was another point of contention. The pair registered their domains post the launch of Yuga Labs’ Bored Ape Yacht Club NFTs, further cementing the infringement case against them. The Bored Ape Yacht Club started in April 2021 and is a collection of 10,000 unique NFTs on the Ethereum blockchain. Holders of these NFTs not only join an exclusive community and gain unlimited copyright for media or design usage. Such is the craze that Seth Green, the renowned Family Guy star, spent a hefty $300,000 to reclaim his Bored Ape NFT after a phishing incident.",
    "tags": [
      "#Blockchain",
      "#Bored Ape Yacht Club",
      "#NFT market",
      "#Yuga Labs"
    ],
    "publishDate": "27/10/2023"
  },
  {
    "title": "Maison Margiela’s Digital Couture: A Web3 Gaming Fusion with NFTs",
    "absoluteURL": "https://www.todaynftnews.com/maison-margielas-digital-couture-a-web3-gaming-fusion-with-nfts/",
    "fullContent": "SNEAK PEEK Maison Margiela has launched a unique blockchain-based game, Numbers. The game is inspired by Margiela’s iconic 0-23 numbering system for its collections. By using ERC-1155 tokens on the Polygon network, the game ensures fairness and inclusivity. Maison Margiela, the renowned Parisian fashion house, has ventured into the Web3 space, launching a captivating blockchain-based game termed “Numbers.” Drawing inspiration from its iconic 0-23 numbering system, which represents its 23 distinct collections, this Web3 experience is reminiscent of “blockchain bingo.” Players will compete over the next few weeks to mint all 24 token-linked digits. The reward? A coveted spot in Maison Margiela’s evolving Web3 community. Significantly, as the numbers increase, their rarity does too. For instance, while a whopping 15,000 zeros are available, there are only 742 of the number 23s. A circle highlights the number currently up for grabs, while those fully minted appear in black. The game reaches its climax when the first 100 players have minted all 24 numbers or at Maison Margiela’s discretion. Besides the game’s intriguing concept, its fairness makes it stand out. These ERC-1155 tokens, minted on the Polygon network, are unique in that they’re soul-bound. Consequently, they are non-transferable, and each wallet can only mint one of each number. Additionally, minting comes at no gas fee to ensure a level playing field, and every user receives the same gas allocation for each transaction. Hence, while early birds might have a slight advantage, the game fundamentally rewards perseverance and strategic insight. Moreover, Margiela’s foray into gamified minting is timely and astute. While the NFT market has seen a recent dip, the gaming industry continues its robust growth. According to IPSOS, gaming, currently valued at $385 billion, is projected to soar to over $522 billion by 2027. The symbolism isn’t lost on those familiar with Maison Margiela’s heritage. Every physical item from the fashion house comes with a tag numbered 0-23. The circled number corresponds to the collection to which the piece belongs. Furthermore, Martin Margiela’s preference for collective statements over personal appearances in the brand’s early days resonates with the decentralized ethos of Web3. This isn’t the brand’s first brush with technology, either. Earlier this year, they incorporated on-chain certificates of authenticity, accessible via NFC chips, in their signature Tabi footwear. In conclusion, Maison Margiela’s innovative blend of fashion and technology signifies a promising fusion of the past and the future, bridging the gap between traditional luxury and the digital frontier.",
    "tags": [
      "#Gaming",
      "#NFT market",
      "#NFT Marketplace",
      "#Web3"
    ],
    "publishDate": "25/10/2023"
  },
  {
    "title": "Dubai Takes the Lead in NFT Education and Web3 Technologies",
    "absoluteURL": "https://www.todaynftnews.com/dubai-takes-the-lead-in-nft-education-and-web3-technologies/",
    "fullContent": "SNEAK PEEK UAE’s art scene is experiencing a transformative phase, particularly in Dubai and Abu Dhabi. The soon-to-be-launched 37xDubai, situated in the DIFC, represents a significant evolution in the art space. 37xDubai is positioned as an entry point for individuals into the digital art sphere and NFTs. The United Arab Emirates art landscape is currently undergoing a significant transformation, led by the vibrant activities in Dubai and Abu Dhabi. This evolution marks the country’s position as a leading force in the region’s expanding art scene. Dubai, in particular, is making strides with its innovative technology integration in art. At the Dubai Mall, ftNFT is at the forefront, offering a unique physical and digital art blend. This physical, digital space provides visitors with an interactive experience, allowing them to acquire Non-Fungible Tokens (NFTs) through conventional payment methods. The journey also includes full-body 3D scanning and a variety of immersive encounters. Dubai continues to showcase its dedication to innovation with the upcoming launch of 37xDubai in the Dubai International Financial Center (DIFC). Under the leadership of Danilo Carlucci from Morningstar Ventures, this establishment aims to be more than just an art gallery. It seeks to combine art, technology, and education, educating visitors about NFTs and the broader Web3 ecosystem. Morningstar Ventures sees 37xDubai as an entry point into the digital art and NFT domain. The gallery aims to serve as an informative resource, shedding light on the importance and potential of NFTs. It will also host collaborative events and workshops to educate the public further. 37xDubai is set to make a significant impact, not just as an exhibition space but as an educational hub, fostering a deeper understanding of the digital world and its possibilities. With its innovative approach and commitment to education, it is poised to play a crucial role in the UAE’s burgeoning art scene.",
    "tags": [
      "#Blockchain",
      "#NFT market",
      "#Web3"
    ],
    "publishDate": "24/10/2023"
  },
  {
    "title": "Singapore High Court Approves Unique NFT-based Freeze Order on Stolen Crypto Assets",
    "absoluteURL": "https://www.todaynftnews.com/singapore-high-court-approves-unique-nft-based-freeze-order-on-stolen-crypto-assets/",
    "fullContent": "SNEAK PEEK The High Court of Singapore approved using NFTs by iSanctuary to mark wallets linked to a high-profile hack as a means of digital asset recovery. These NFTs contain a worldwide freeze order issued by the court and are a constant reminder to parties involved in transactions with the marked wallets. The NFTs are designed to help track any funds that depart from these wallets, enhancing their effectiveness in asset recovery. In a unique approach to digital asset recovery, the High Court of Singapore recently approved a move by UK financial investigation firm Intelligent Sanctuary (iSanctuary). The court allowed Sanctuary to use nonfungible tokens (NFTs) to mark wallets linked to a high-profile hack. Significantly, these are not your everyday NFTs; these digital tokens house a worldwide freeze order issued by the court. While these NFTs don’t impede transactions, they act as a constant reminder to all parties involved. Exchanges and potential trading partners will be notified of the wallets’ questionable history. Moreover, this creative use of technology doesn’t stop at the warning. The NFTs, produced by Singapore’s Mintable studio, are designed to aid in tracking any funds that depart from these wallets. However, these measures didn’t come out of the blue. iSanctuary was roped in by an entrepreneur who faced the misfortune of losing $3 million in cryptocurrency assets. With the melding of on-chain and off-chain evidence, iSanctuary was able to pin down the stolen funds. Presented before the Singapore High Court, their findings were instrumental in securing the unprecedented injunction. Besides the core details, iSanctuary has maintained discretion regarding the facts of the case. Still, it’s evident that Mintology, an application by Mintable, played a role in crafting these unique NFTs. Additionally, Zach Burks, the founder of Mintable, gave an indirect nod to their involvement in a recent post on X, the platform formerly known as Twitter. Thanks @straits_times for the great article. Happy to help clean up the crypto space and move the NFT ecosystem into a realm of utility and away from the speculation of jpegs! The future is of NFTs is coming! https://t.co/PKmd7uxD7k shows how.https://t.co/S8Jf2seNhy — Zach Burks (@ZachSpaded) October 18, 2023 While the story unfolds, The Straits Times sheds light on a few elements. The case pivots around a stolen private key, indicating compromised security. Singapore-based crypto exchanges have been implicated in laundering the stolen money, with fraudulent actors alleged to be Singaporeans. Furthermore, the scope of this incident is vast, involving nations from Singapore to Spain, Ireland, Britain, and various European countries. This landmark decision by the Singapore High Court marks a shift in how legal jurisdictions may approach the intricacies of digital assets. As technology advances, judicial systems worldwide will likely have to adapt and find innovative solutions to unique challenges.",
    "tags": [
      "#Blockchain",
      "#NFT market",
      "#Singapore"
    ],
    "publishDate": "23/10/2023"
  },
  {
    "title": "OKX NFT Marketplace Expands with Polygon zkEVM Support",
    "absoluteURL": "https://www.todaynftnews.com/okx-nft-marketplace-expands-with-polygon-zkevm-support/",
    "fullContent": "SNEAK PEEK OKX has integrated Polygon zkEVM into its Non-fungible Tokens Marketplace. It’s a zero-knowledge scaling solution compatible with the Ethereum Virtual Machine (EVM). OKX has introduced a competition related to India’s 2023 international cricket championship. In a significant move, OKX, a global leader in Web3 technology, has integrated Polygon zkEVM into its NFT Marketplace. Hence, users can seamlessly explore, manage, and trade Polygon zkEVM NFTs without incurring fees. This enhancement highlights OKX’s commitment to offering its customers a wide range of services. 📣 OKX NFT now supports Polygon zkEVM 🎊 With this integration, creators, artists, and users can seamlessly get @0xPolygonDeFi zkEVM NFTs on #OKX with better liquidity! 🔗 Explore more: https://t.co/j8LH28dje5 pic.twitter.com/ob0rOeFyJZ — OKX Web3 (Wallet | DeFi | NFT) (@okxweb3) October 18, 2023 Additionally, the integration of Polygon zkEVM, a zero-knowledge scaling solution, further strengthens OKX’s position in the market. Compatible with the Ethereum Virtual Machine (EVM), it aids in integrating smart contracts and developer tools. Moreover, this news coincides with OKX’s recent unveiling of the Crypto Cricket Cup competition. Linked to the 2023 international cricket championship in India, Phase 2 offers users who complete Polygon-based tasks via the OKX Wallet a chance to win from a US$200,000 prize pool. However, this is not the sole offering from OKX. The OKX Wallet, revered for its security and versatility, supports over 70 blockchains. It notably employs MPC technology, which provides a more straightforward recovery method than traditional seed phrases. Its Smart Account feature also facilitates users transacting on various blockchains using USDC or USDT. Furthermore, OKX boasts a DEX, aggregating over 300 decentralized exchanges and 15 bridges. This platform supports more than 200,000 coins and over 20 blockchains. In NFTs, the marketplace gives access to listings across prominent platforms like OpenSea and MagicEden. The company also offers Web3 DeFi, a platform accommodating earning and staking on around 70 protocols across over 10 chains. Beyond its technological prowess, OKX collaborates with globally recognized brands and athletes. Manchester City F.C., McLaren Formula 1, and The Tribeca Festival are just a few names on the list. Consequently, OKX’s continual advancements emphasize its belief in a Web3-led future. Their latest brand campaign, “The System Needs a Rewrite,” underscores this vision. By combining Polygon zkEVM and other diverse offerings, OKX solidifies its position in the rapidly evolving Web3 landscape.",
    "tags": [
      "#NFT Marketplace",
      "#OKX Exchange",
      "#Polygon",
      "#Web3"
    ],
    "publishDate": "20/10/2023"
  },
  {
    "title": "Bybit and MIBR Launch Exclusive NFT Collection Celebrating 20 Years of Esports Excellence",
    "absoluteURL": "https://www.todaynftnews.com/bybit-and-mibr-launch-exclusive-nft-collection-celebrating-20-years-of-esports-excellence/",
    "fullContent": "SNEAK PEEK Cryptocurrency exchange Bybit has collaborated with the esports team Made in Brazil (MIBR) to launch a special NFT collection. The collection celebrates MIBR’s 20th anniversary and introduces “phygital” NFTs, combining digital tokens and physical apparel. Standard editions have a 250 print run. Ultra-rare editions are limited to five units each. Bybit, the globally recognized cryptocurrency exchange, has partnered with esports giants Made in Brazil (MIBR) to unveil a distinctive NFT collection. This move commemorates MIBR’s 20th birthday, fusing digital tokens and physical apparel, coining them as “phygital” NFTs. The collection, set for an October 24th debut on Bybit, consists of 12 iconic jerseys, reflecting MIBR’s illustrious two-decade journey in esports. Significantly, two new NFTs from this elite series will follow in the subsequent week. The rarity of these collectible jerseys varies while the standard editions are capped at a 250 print run, the ultra-rare editions are significantly limited, with only five units available for each design. Moreover, in a generous move, six of these highly sought-after NFTs will be available at zero cost, while the rest can be acquired on Bybit’s platform. For fans striving for exclusivity, collecting the full set will reward them with an autographed, tailor-made MIBR jersey. Additionally, those amassing 11 NFTs will receive a personal acknowledgment from a chosen MIBR personality. Furthermore, securing between 7 and 10 jerseys entitles fans to a special MIBR store discount and a bonus of $BRZ on Bybit. Ben Zhou, CEO of Bybit, expressed his enthusiasm regarding the collaboration. He stated, “Merging esports with cryptocurrency through this ‘phygital’ NFT collaboration with MIBR allows us to celebrate their esteemed legacy. Moreover, this sets a new standard for fan engagement and phygital collectibles, underscoring our dedication to providing pioneering experiences to our global community.” Roberta Coelho, MIBR’s CEO, echoed these sentiments. “This partnership offers a unique platform to commemorate MIBR’s remarkable 20-year trajectory,” she said. “Sharing this significant landmark with our global followers via Bybit’s advanced crypto platform is exhilarating.”",
    "tags": [
      "#NFT Launch",
      "#NFT market"
    ],
    "publishDate": "20/10/2023"
  },
  {
    "title": "French Assembly Passes Sorare Law for NFT-Based Gaming",
    "absoluteURL": "https://www.todaynftnews.com/french-assembly-passes-sorare-law-for-nft-based-gaming/",
    "fullContent": "SNEAK PEEK The French National Assembly approved the “Sorare Law” under the Digital Space Regulation Law. The decision received a majority vote, with 437 members in favor, but faced opposition from 77 members. Karima Lachgar, CEO of Olky Wallet, recognizes the law’s potential to bring credibility to the crypto gaming sector. The French National Assembly endorsed the “Sorare Law” as part of the broader Digital Space Regulation Law (SREN). The landmark decision, which witnessed a favorable vote from 437 of the 561 members, introduces a pioneering regulatory landscape for video games utilizing Non-Fungible Tokens (NFTs) and crypto-monetization avenues. The decision, however, hasn’t resonated well with everyone, as 77 members opposed its adoption. The legislation, coined as the “Jonum regime” for games with monetizable digital objects, delicately balances the scales between stimulating French startup innovation and fortifying user safety. With this enactment, a clear legal distinction is drawn for Jonum, distinguishing it from conventional video games and gambling. Karima Lachgar, the CEO of Olky Wallet, noted the potential of SREN to lend credibility to a rapidly evolving sector, which has, in the past, been marred by scams. But the journey isn’t over. The legislation awaits scrutiny from the Constitutional Council, which possesses the power to either endorse or dismiss it. This is a turn of events some assembly members eagerly anticipate. Interestingly, critics argue the law may inadvertently favor crypto games over online casinos. Karima Lachgar, reflecting on the implications, hinted at the likelihood of betting platforms transitioning to the play-to-earn and Web3 domain, much like the state-run Pari Mutuel Urbain. The latter has already made inroads into the crypto realm with its fantasy horse racing game, Stables. Historically, French regulators believed that assets in crypto games fulfilled most criteria defining gambling. This put popular games, like Sorare and Stables, in jeopardy of being categorized as gambling ventures. Such classification brings with it hefty tax implications. Under the new law, however, the onus of ensuring compliance falls on the Autorité Nationale des Jeux (ANJ), the French National Gambling authority. Consequently, crypto game platforms will mandate age declaration during account creation and ascertain player identity upon in-game earnings withdrawals. Notably, initial registration won’t demand identity verification. Moreover, the Jonum regime offers clarity on promotional strategies involving Web3 games and influencers. The directive explicitly bans the engagement of influencers for campaigns on platforms accessible to minors. This implies that popular platforms like YouTube might still be in the clear for promotional activities.",
    "tags": [
      "#Gaming",
      "#Gaming NFTs",
      "#NFT market"
    ],
    "publishDate": "19/10/2023"
  },
  {
    "title": "Norman Rockwell Museum Launches NFTs of Unpublished Works",
    "absoluteURL": "https://www.todaynftnews.com/norman-rockwell-museum-launches-nfts-of-unpublished-works/",
    "fullContent": "SNEAK PEEK The Norman Rockwell Museum and the Rockwell family have collaborated to launch an NFT series called “Studio Sessions. This initiative presents Norman Rockwell’s work as digital tokens for the first time and includes both digital. The “Studio Sessions” collection will be available on Iconic’s platform starting November 1. In a collaborative effort, the Norman Rockwell Museum and the Rockwell family have introduced a new NFT series named “Studio Sessions, the Norman Rockwell Collection.” This initiative presents the esteemed American artist’s work as digital tokens for the first time. This series will highlight several digital and physical pieces by Rockwell. Additionally, it offers insights into previously unseen images and behind-the-scenes material from the extensive Rockwell archives. Iconic, a platform that merges traditional art with modern tech trends, facilitated this groundbreaking move. Their recent partnership with the Jackson Pollock Studio, which centered on releasing an NFT collection on the Ethereum network, showcases their expertise. Art lovers and collectors must wait a while. The “Studio Sessions” collection will be up for grabs from November 1 on Iconic’s platform. Moreover, the anticipation builds as the exact details of the artworks in this collection remain under wraps. Upon release, those interested can buy these NFTs with a credit card or Ethereum, though the precise pricing for each piece. Beyond its digital appeal, this project also supports a worthy cause. The Rockwell Museum will use the proceeds from the NFT sales to advance its mission. It involves increasing public access to Rockwell’s iconic works, nurturing emerging illustrators, and upholding the artist’s rich heritage under the stewardship of the Rockwell Family. Spanning much of the last century, Norman Rockwell’s artistry vividly portrayed American life and values. His beloved illustrations depict a mosaic of daily experiences. “Studio Sessions” aims to showcase these moments specifically, looking into the preliminary sketches, photography sessions, and studies that led to each masterpiece. Moreover, each NFT purchase comes with a limited-edition museum-quality print. The director of the Rockwell Museum, Norton Moffatt, conveyed the museum’s excitement, stating, “Our move into digital art editions marks a pivotal point in our pledge to uphold and honor Norman Rockwell’s legacy. It’s a significant step in both art and culture.”",
    "tags": [
      "#NFT Art",
      "#NFT Launch",
      "#NFT market"
    ],
    "publishDate": "19/10/2023"
  },
  {
    "title": "NFT Royalty Issues Under Spotlight—Yuga Labs Teams Up with Magic Eden for Solutions",
    "absoluteURL": "https://www.todaynftnews.com/nft-royalty-issues-under-spotlight-yuga-labs-teams-up-with-magic-eden-for-solutions/",
    "fullContent": "SNEAK PEEK The Open Metaverse Alliance for Web3 (OMA3) forms a working group focused on NFT creator royalties, involving key industry figures. Creator royalties, essential for rewarding NFT artists, face inconsistency due to marketplace strategies eliminating these fees. These changes pose a threat to the envisioned metaverse, where genuine digital ownership and inter-platform operability are key. OMA3, a consortium known as the Open Metaverse Alliance for Web3, has assembled a working group to address and enhance the current state of NFT creator royalties. This group comprises major players from the blockchain, NFT, and metaverse sectors. Creator royalties—fees ranging from 2.5% to 10%—are added to secondary NFT sales. These fees are directed towards the original creators. However, the changing market dynamics have threatened the consistent application of these royalties. A few NFT marketplaces began removing these fees in an effort to attract more users. Consequently, the successful implementation of this tactic caused significant shifts in platform dominance within the NFT marketplace. Additionally, OMA3 participants view this change as a risk, not only to the NFT space but to the ultimate goal of metaverse development. They believe in a metaverse where users have true digital ownership, enabling virtual items to move effortlessly between platforms. Robby Yung, the CEO of Animoca Brands and co-founder of OMA3, emphasized the significance of creator royalties. He believes that without the promise of future royalty benefits, creators might be hesitant to share their content. His vision is for a more democratic, transparent, and fair online ecosystem than what currently exists. However, Yung acknowledges a challenge. Many current NFT purchasers seem to be more focused on immediate financial gains rather than considering the broader implications for the digital community. The OMA3 working group, featuring Animoca, Yuga Labs, Magic Eden, and others like Decentraland, aims to establish protective measures for these royalties. They hope to introduce universal standards for NFT marketplaces, ensuring these fees are upheld. Mike Seavers, the CTO of Yuga Labs, expressed Yuga’s commitment to a fair and interoperable Web3 environment. They’re dedicated to working alongside OMA3 in setting the standards for success. Moreover, some renowned NFT brands, in response to platforms like OpenSea halting creator royalty enforcement, have considered limiting their association. Yuga Labs, for example, considered ending its NFT brand compatibility with OpenSea after it ceased enforcement of royalties. To conclude, the digital landscape is evolving, and the need to protect creator royalties is more pressing than ever. OMA3’s initiative, backed by industry heavyweights, aims to restore balance and ensure fairness within the NFT marketplace.",
    "tags": [
      "#NFT market",
      "#Open Metaverse",
      "#Yuga Labs"
    ],
    "publishDate": "18/10/2023"
  },
  {
    "title": "Ryder Ripps Faces Judicial Skepticism in Bored Ape Lawsuit",
    "absoluteURL": "https://www.todaynftnews.com/ryder-ripps-faces-judicial-skepticism-in-bored-ape-lawsuit/",
    "fullContent": "SNEAK PEEK Ryder Ripps and Jeremy Cohen (also known as “Pauly”) face legal challenges. The defense’s arguments were not persuasive to the Ninth District U.S. Court of Appeals judges during the October 17 hearing. Sprankling positioned Ripps and Cahen’s NFT sales as avant-garde art aiming to push the boundaries of free speech. Ryder Ripps, a prominent NFT artist, and Jeremy Cohen, identified as “Pauly” in certain circles, faced an uphill battle in a recent courtroom showdown. The duo’s defense, led by esteemed attorney Thomas Sprankling of the WilmerHale firm, seemed unable to sway the Ninth District U.S. Court of Appeals judges in an October 17 hearing. Moreover, the crux of the defense revolved around the controversial Bored Ape NFTs. Sprinkling asserted that these NFTs, supposedly imitating the original Yuga Labs collection, served as a protest against hidden anti-Semitic imagery. By positioning Ripps and Cahen’s sales as avant-garde, the attorney emphasized the boundaries of speech they intended to push. Additionally, Sprinkling referred to the anti-SLAPP statute in California, which aims to halt lawsuits that intimidate and suppress free speech. He told the panel that the statute is a safeguard, ensuring no speech-chilling threats arise from legal proceedings. Furthermore, the defense motion under anti-SLAPP highlighted their belief that Yuga Labs initiated the lawsuit merely to stifle their protest art and inundate them with exorbitant legal fees. However, the judges focused on the NFT sales rather than the proclaimed artistic intent. In a poignant moment, Judge Anthony Johnstone remarked, “He was selling the same images, on the same marketplaces, on virtually indistinguishable NFT identifiers.” Echoing a similar sentiment, Judge Morgan Christen voiced her confusion, indicating that the defense’s argument failed to resonate with the bench. In conclusion, while the artist’s intentions might be rooted in pushing the boundaries of expression, the court’s focus seems firmly on sales and potential infringement. As the case progresses, how this interpretation shapes the final judgment remains to be seen.",
    "tags": [
      "#Bored Ape NFT",
      "#NFT market"
    ],
    "publishDate": "17/10/2023"
  },
  {
    "title": "SEGA Executive Explores the Potential of NFTs in Gaming",
    "absoluteURL": "https://www.todaynftnews.com/sega-executive-explores-the-potential-of-nfts-in-gaming/",
    "fullContent": "SNEAK PEEK Sega Co-COO Shuji Utsumi is optimistic about the potential of blockchain gaming and NFTs in the video game industry. Despite earlier reservations, Utsumi now views blockchain aligning with Sega’s mission to embrace innovative technology. A primary challenge is the complexity of integrating crypto wallets, which is essential for managing in-game NFT assets. Sega Co-COO Shuji Utsumi has expressed a positive outlook on the future of blockchain gaming and the potential role of Non-Fungible Tokens (NFTs) within the video game industry. His recent interview shed light on the ever-evolving landscape of blockchain games and the fresh opportunities they bring to players, starkly contrasting his earlier description of play-to-earn games as “boring.” Blockchain technology seamlessly aligns with Sega’s mission of embracing cutting-edge tech while creating content that resonates with its fans in Japan and various Asian markets. However, Utsumi candidly acknowledged the hurdles that crypto games face, particularly concerning the integration of crypto wallets. These wallets are essential for users to manage their in-game assets, including NFTs. The complexities surrounding the creation and connection of wallets to gaming platforms can be a stumbling block. For Sega, the focus is first on providing players with an engaging gaming experience rather than overwhelming them with the intricacies of crypto wallets. In essence, Sega perceives blockchain gaming as an opportunity to enhance the overall player experience and explore new dimensions of player ownership within the gaming realm. Utsumi expressed his anticipation for the potential of NFTs, emphasizing their ability to authentically capture the sensation of owning unique in-game assets akin to possessing coveted cards in a trading card game—Sega’s collaboration with Double Jump. Tokyo for the development of Battle of Three Kingdoms exemplifies the gaming industry’s pivot toward blockchain technology and NFTs. This partnership underscores Sega’s dedication to embracing and adapting to new technologies while staying true to the essence of their beloved gaming intellectual property. As the industry digs deeper into these emerging technologies, obstacles such as crypto wallet integration are addressed to provide players with a seamless and immersive gaming experience. The ever-evolving landscape of blockchain gaming holds immense promise for players and developers as they venture into this exciting frontier.",
    "tags": [
      "#Blockchain",
      "#Gaming NFTs",
      "#NFT market"
    ],
    "publishDate": "16/10/2023"
  },
  {
    "title": "The Sandbox and Sandsoft Partner for Middle East Gaming Expansion",
    "absoluteURL": "https://www.todaynftnews.com/the-sandbox-and-sandsoft-partner-for-middle-east-gaming-expansion/",
    "fullContent": "SNEAK PEEK The Sandbox collaborates with Riyadh’s mobile-first game developer, Sandsoft. The partnership marks The Sandbox’s aim to extend its presence in Saudi Arabia and the wider Middle East. Sandsoft, celebrated for its AAA-rated gaming experts, is set to lead initiatives attracting regional video gaming talents. The Sandbox has forged a strategic alliance with Riyadh-based mobile-first game developer Sandsoft. This collaboration underlines The Sandbox’s intent to broaden its reach in Saudi Arabia and the Middle East region. Sandsoft, known for its AAA-rated gaming talent, will spearhead the push to entice local talent in the video gaming sector, paving the way for increased educational and employment prospects within the locale. Moreover, the partnership isn’t merely about market expansion. The Sandbox and Sandsoft are set on constructing a robust team of Web3 gaming aficionados. This team aims to develop meaningful affiliations with local public and private entities, influential personalities, and major brands. Their combined vision focuses on probing into gamified social experiences within The Sandbox. Consequently, the mission also includes galvanizing local artistic aptitude, ushering in and training developers, and integrating artists into The Sandbox’s expansive ecosystem. Sebastien Borget, the COO and co-founder of The Sandbox, expressed his enthusiasm about the collaboration. He emphasized the potential for Middle Eastern brands and creators to tap into The Sandbox’s vast creative reservoir. Additionally, he highlighted how the partnership would infuse The Sandbox’s international ecosystem with the cultural richness and historical legacy of Saudi Arabia. Echoing these sentiments, David Fernandez, the CEO of Sandsoft, underscored the immense potential that The Sandbox presents for a diverse array of stakeholders, from game developers to consumers, hailing from the Middle East and North Africa. He voiced his optimism about the union, which he believes will further Sandsoft’s existing endeavors to cultivate talent within the regional gaming landscape. Sandsoft, with its international team of over 60 individuals, is on an upward trajectory, positioning itself as a formidable force in mobile-first gaming. Significantly, Sandsoft’s ‘Press Start’ internship initiative aims to offer budding talents in Saudi Arabia a unique platform. Here, they can hone their game development skills, guided by eminent figures from the gaming world, including VP Studio Yahsir Qureshi and CTO Ahmed Sharif, both of whom have illustrious associations with industry giants like EA, Zynga, Meta, and Sony.",
    "tags": [
      "#Blockchain",
      "#Gaming",
      "#NFT market",
      "#The Sandbox",
      "#Web3"
    ],
    "publishDate": "14/10/2023"
  }
]